<?php
/* ========================================================================
 * Open eClass 2.9
 * E-learning and Course Management System
 * ========================================================================
 * Copyright 2003-2014  Greek Universities Network - GUnet
 * A full copyright notice can be read in "/info/copyright.txt".
 * For a full list of contributors, see "credits.txt".
 *
 * Open eClass is an open platform distributed in the hope that it will
 * be useful (without any warranty), under the terms of the GNU (General
 * Public License) as published by the Free Software Foundation.
 * The full license can be read in "/info/license/license_gpl.txt".
 *
 * Contact address: GUnet Asynchronous eLearning Group,
 *                  Network Operations Center, University of Athens,
 *                  Panepistimiopolis Ilissia, 15784, Athens, Greece
 *                  e-mail: info@openeclass.org
 * ======================================================================== */


$langWindowClose="Κλείσιμο παραθύρου";

$langHDefault='Βοήθεια μη διαθέσιμη';
$langDefaultContent='<p>Δεν υπάρχει κείμενο βοήθειας για την περιοχή της πλατφόρμας στην οποία βρίσκεστε.</p>';

// PHP Math Publisher
$langPHPMathPublisher="<p><b>Υποστήριξη μαθηματικών συμβόλων</b></p>
<p>Για την ενσωμάτωση μαθηματικών συμβόλων στα κείμενα σας, μπορείτε να χρησιμοποιείτε τις
<a href='http://wiki.openeclass.org/doku.php?id=mathp'>εντολές</a> (συμβολισμούς) του PhpMathPublisher.
Συγκεκριμένα χρησιμοποιήστε τον συντάκτη κειμένου για να εισάγετε το περιεχόμενό σας. Αν στο περιεχόμενο
υπάρχουν μαθηματικά σύμβολα που επιθυμείτε να εμφανίσετε τότε:</p>
<ol>
  <li>Κάντε κλικ στο εικονίδιο 'Μετάβαση σε κώδικα HTML'.</li>
  <li>Εισάγετε το μαθηματικά σύμβολα σας μεταξύ των συμβόλων [m].....[/m]</li>
</ol>
<p>Αν ο συντάκτης κειμένου δεν υποστηρίζει κείμενο σε μορφή html θα πρέπει και πάλι το περιεχόμενό σας
να είναι μεταξύ των συμβόλων [m].....[/m]</p>
<p>Π.χ. για να εισαγάγετε την τετραγωνική ρίζα του 2 πληκτρολογήστε [m]sqrt{2}[/m]></p>";


// Forums
$langHFor="Περιοχές συζητήσεων";
$langHFor_student=$langHFor;
$langForContent="<p>Για να δημιουργήσετε μια νέα περιοχή συζητήσεων πρέπει πρώτα να την εντάξετε σε μια κατηγορία.
Για να δημιουργήσετε μια κατηγορία κάντε κλικ στο ‘Προσθήκη κατηγορίας’. Για να εισαγάγετε μια νέα περιοχή συζητήσεων
σε συγκριμένη κατηγορία επιλέξτε το κουμπί <img src='$themeimg/add.png' width=16
 height=16> το οποίο βρίσκεται δεξιά της επιλεγμένης κατηγορίας.
 Πληκτρολογήστε τον τίτλο και μια περιγραφή για την περιοχή συζητήσεων και πατήστε το κουμπί προσθήκη.</p>
<hr>
<p><b>Ενέργειες:</b><br><br>
<ul>
  <li>Για να δημιουργήσετε μια νέα περιοχή συζητήσεων κάντε κλικ στο <img src='$themeimg/add.png' width=16 height=16></li>
  <li>Για να τροποποιήσετε μια υπάρχουσα περιοχή συζητήσεων κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16></li>
  <li>Για να διαγράψετε μια περιοχή συζητήσεων κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
  <li>Για να επιλέξετε αν θέλετε να λαμβάνετε ή όχι ειδοποιήσεις μέσω email για την ανάρτηση συζητήσεων της συγκριμένης κατηγορίας
  κάντε κλικ στο <img src='$themeimg/email.png' width=16 height=16></li>
  </ul>";

$langFor_studentContent= "<p>
Μπορείτε είτε να δημιουργήσετε ένα νέο θέμα συζήτησης κάνοντας κλικ στο 'Νέο θέμα' (αφού προηγουμένως επιλέξετε
την αντίστοιχη περιοχή συζητήσεων), είτε να απαντήσετε σε ένα υπάρχον θέμα κάνοντας κλικ στο 'Απάντηση'.
Επίσης μπορείτε κάνοντας κλικ στο <img src='$themeimg/email.png' width=16 height=16>
          να επιλέξετε να λαμβάνετε ή όχι ειδοποιήσεις μέσω email για την ανάρτηση συζητήσεων της συγκριμένης κατηγορίας.</li>";


// Documents
$langHDoc="Έγγραφα";
$langHDoc_student = $langHDoc;
$langDocContent="<p>Μπορείτε να ανεβάσετε όλους τους συνηθισμένους τύπους αρχείων κειμένου κ.λπ. Οι επιτρεπόμενες ενέργειες είναι:</p>
<h4>Ανέβασμα ενός αρχείου</h4>
<ul>
  <li>Κάντε κλικ στο 'Ανέβασμα αρχείου στον εξυπηρέτη'. Στη φόρμα που θα σας εμφανιστεί,
  χρησιμοποιήστε το 'Browse' για να επιλέξετε το αρχείο στον υπολογιστή σας
   </li>
<li>Ολοκληρώστε το ανέβασμα κάνοντας κλικ στο 'Ανέβασμα'.</li>
</ul>
<h4>Διαγραφή ενός αρχείου (ή καταλόγου)</h4>
<ul>
<li>Κάντε κλικ στο <img src='$themeimg/delete.png' width=10 height=10></li>
</ul>
<h4>Κατέβασμα όλου του καταλόγου</h4>
<ul>
  <li>Κάντε κλικ στο <img src='$themeimg/save_s.png' width=16 height=16> για να κατεβάσετε στον υπολογιστή σας
          όλο τον κατάλογο των εγγράφων του μαθήματος.</li>
  </ul>
<h4>Μετακίνηση ενός αρχείου (ή καταλόγου)</h4>
    <ul>
      <li>Κάντε κλικ στο <img src='$themeimg/move.png' width=10 height=10 align=basename>
        </li>
      <li>Επιλέξτε τον κατάλογο μέσα στον οποίο θέλετε να μετακινήσετε το έγγραφο (ή το κατάλογο)
      (σημείωση: ο χαρακτηρισμός 'αρχικό κατάλογο' σημαίνει ότι δεν μπορείτε να πάτε
      πάνω από αυτό το επίπεδο στο δέντρο αρχείων του εξυπηρέτη).</li>
      <li>Επιβεβαιώστε το κάνοντας κλικ στο 'Μετακίνηση'.</li>
    </ul>

<h4>Μετονομασία ενός αρχείου (ή ένα κατάλογου)</h4>
<ul>
  <li>Κάντε κλικ στο <img src='$themeimg/rename.png' width=16 height=16></li>
  <li>Πληκτρολογήστε το καινούριο όνομα στο πεδίο (πάνω αριστερά)</li>
  <li>Επιβεβαιώστε το κάνοντας κλικ στο 'Μετονομασία'</li>
</ul>
    <h4>Προσθήκη ή τροποποίηση σχολίου σε ένα αρχείο (ή σε ένα κατάλογο)</h4>
    <ul>
  <li>Κάντε κλικ στο <img src='$themeimg/comment_edit.png' width=16 height=16>
    στη στήλη </li>
      <li>Πληκτρολογήστε καινούριο σχόλιο στο αντίστοιχο πεδίο (πάνω δεξιά).</li>
      </ul>
    <h4>Μετατροπή αρχείου (ή καταλόγου) σε αόρατο για τους εκπαιδευόμενους</h4>
    <ul>
  <li>Κάντε κλικ στο <img src='$themeimg/visible.png' width=10 height=10>
</li>
   <li>Μετά την παραπάνω ενέργεια το αρχείου (ή ο κατάλογος) θα υπάρχει αλλά δεν θα είναι ορατό από τους εκπαιδευόενους.</li>
  <li>Για να το κάνετε ορατό ξανά, κάντε κλικ στο <img src='$themeimg/invisible.png' width=14 height=10>
  </li>
    </ul>
    <hr>
    <h4><b>Δημιουργήστε ένα κατάλογο</b></h4>
	<p>Μπορείτε να οργανώσετε το περιεχόμενό σας σε καταλόγους. Για να δημιουργήσετε ένα κατάλογο: </p>
    <ul>
      <li>Πατήστε στο σύνδεσμο 'Δημιουργία ενός καταλόγου'</li>
      <li>Πληκτρολογήστε το όνομα του καινούριου σας καταλόγου στο αντίστοιχο πεδίο</li>
      <li>Μετά κάντε κλικ στην 'Δημιουργία καταλόγου.</li>
    </ul>
    <hr>
    <h4><b>Επισκόπηση αποθηκευτικού χώρου</b></h4>
	<p>Μπορείτε να βλέπετε τον διαθέσιμο χώρο σας</p>
    <ul>
      <li>Πατήστε στο σύνδεσμο 'Επισκόπηση αποθηκευτικού χώρου'</li>
      <li>Παρουσιάζεται ο χρησιμοποιούμενος χώρος, το ποσοστό χρήσης και ο συνολικά διαθέσιμος χώρος.</li>
    </ul>
      </p>";
$langDoc_studentContent="<p>Μπορείτε να κατεβάσετε αρχεία ή καταλόγους κάνοντας κλικ στο τίτλο του αρχείου.</p>
        <h4>Κατέβασμα όλου του καταλόγου</h4>
        <p>Εάν επιθυμείτε να αποθηκεύσετε στον υπολογιστή σας όλο τον κατάλογο των εγγράφων
        του μαθήματος κάντε κλικ στο εικονίδιο <img src='$themeimg/save_s.png' width=16 height=16></p>" ;

// Users admin
$langHUser="Διαχείριση Χρηστών";
$langUserContent="<p>Μπορείτε να διαχειριστείτε τους εγγεγραμμένους χρήστες της πλατφόρμας.
        Παρουσιάζονται διάφορες πληροφορίες (π.χ. ο συνολικός αριθμός των εγγεγραμμένων χρηστών στην πλατφόρμα,
        ο αριθμός των εκπαιδευτών κ.λπ.).</p>
        <p>Για να προσθέσετε ένα χρήστη στο μάθημά σας κάντε κλικ στο 'Προσθήκη'. Στη φόρμα που σας εμφανιστεί
         πληκτρολογήστε το όνομά του ή το username του.</p>
         <p>Για να προσθέσετε πολλούς χρήστες κάντε κλικ στο 'Προσθήκη πολλών χρηστών' και πληκτρολογήστε τα username τους.</p>
        <p>Για να προσθέσετε ένα χρήστη επισκέπτη (guest account) κάντε κλικ στο 'Προσθήκη χρήστη επισκέπτη'.
        Στη φόρμα που θα σας εμφανιστεί πληκτρολογήστε το επιθυμητό συνθηματικό του.
        <p>Για να αναζητήσετε ένα εγγεγραμμένο χρήστη  κάντε κλικ στο 'Αναζήτηση χρήστη'. Πληκτρολογήστε
        το όνομα ή το username του.</p>
        <p>Για να διαχειριστείτε ομάδες χρηστών κάντε κλικ στο 'Διαχείριση ομάδας χρηστών'. Μεταφέρεστε στο
        υποσύστημα 'Ομάδες χρηστών'.</p>
        <p>Για να δώσετε δικαιώματα δικαιώματος εκπαιδευτή σε ένα χρήστη του μαθήματός σας κάντε κλικ στο
        <img src='$themeimg/teacher_add.png' width=24 height=16>.</p>
        <p>Για να δώσετε δικαιώματα βοηθού εκπαιδευτή σε ένα χρήστη του μαθήματός σας κάντε κλικ στο
        <img src='$themeimg/assistant_add.png' width=24 height=16>.</p>
        <p>Για να δώσετε δικαιώματα υπεύθυνου ομάδας χρηστών κάντε κλικ στο <img src='$themeimg/group_manager.png' width=16 height=16>.</p>
        <p>Για να απεγγράψετε ένα χρήστη από το μάθημά σας κάντε κλικ στο <img src='$themeimg/cunregister.png' width=16 height=16>.</p>";

// Guest user
$langHGuest = "Χρήστη Επισκέπτης";
$langGuestContent = "<p>Επιλέγοντας 'Προσθήκη χρήστη Επισκέπτη' σας δίνετε η δυνατότητα να δημιουργήσετε ένα χρήστη επισκέπτη.</p>";

// Questionnaire
$langHQuestionnaire="Ερωτηματολόγιο";
$langHQuestionnaire_student=$langHQuestionnaire ;
$langQuestionnaireContent="<p>Μπορείτε να δημιουργήσετε ερωτηματολόγια με ερωτήσεις 'Πολλαπλής επιλογής'
        όσο και ερωτήσεων 'Συμπλήρωσης κενού'.
Για να δημιουργήσετε ένα ερωτηματολόγιο κάντε κλικ στο 'Δημιουργία Ερωτηματολογίου'.
Στην οθόνη που εμφανίζεται συμπληρώστε τον τίτλο του και το χρονικό διάστημα για το οποίο θα είναι ενεργό
το ερωτηματολόγιο σας. Εν συνεχεία επιλέξτε τον τύπο ερωτήσεων που επιθυμείτε πατώντας σε
ένα από τους συνδέσμους 'Νέα ερώτηση πολλαπλής επιλογής' ή 'Νέα ερώτηση συμπλήρωσης κενού'.
Η διαδικασία ολοκληρώνεται κάνοντας κλικ στο 'Δημιουργία Ερωτηματολογίου'.
<p><img src='$themeimg/warning.png' width=18 height=18> <b>Επισήμανση</b>: Εάν σε ένα ενεργό ερωτηματολόγιο έχει
        απαντηθεί  έστω και μια ερώτηση από έναν εκπαιδευόμενο η διαδικασία της διόρθωσης του
        συγκεκριμένου ερωτηματολογίου επιτυγχάνεται με την δημιουργία ενός “νέου” (του διορθωμένου).
        Αυτή η αυτόματη από την πλατφόρμα διαδικασία εξασφαλίζει την αξιοπιστία των
        αποτελεσμάτων των ερωτηματολογίων.
        </p>
<hr>
<p><b>Διαθέσιμες ενέργειες</b>
<ul>
  <li>Για να τροποποιήσετε ένα ερωτηματολόγιο κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16></li>
  <li>Για να διαγράψετε ένα ερωτηματολόγιο κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
  <li>Για να εμφανίσετε ή όχι ερωτηματολόγιό σας κάντε κλικ στο <img src='$themeimg/visible.png' width=16 height=16></li>
  </ul>";
$langQuestionnaire_studentContent="<p>Μπορείτε να υποβάλλετε απαντήσεις τόσο σε ερωτήσεις
        'Πολλαπλής επιλογής' όσο και σε ερωτήσεις 'Συμπλήρωσης κενού'.
        Για να απαντήσετε σε ένα ερωτηματολόγιο κάντε κλικ στον τίτλο του.
        Στην οθόνη που εμφανίζεται παρουσιάζονται τα στοιχεία του όπως o τίτλος του,
        η ημερομηνία δημιουργίας, η έναρξη και λήξη του και το εάν έχετε συμμετάσχει σε αυτό η όχι.
        Μόλις απαντήσετε σε όλες τις ερωτήσεις κάντε κλικ στο 'Υποβολή' για την ολοκλήρωση
        της διαδικασίας.</p>";


// Exercises
$langHExercise="Ασκήσεις";
$langHExercise_student=$langHExercise ;
$langExerciseContent="<p>Παρουσιάζονται όλες οι ασκήσεις αυτοαξιολόγησης του μαθήματος και οι αντίστοιχες ενέργειές τους.</p>
<p>Για να δημιουργήσετε μια άσκηση κάντε κλικ στο 'Νέα άσκηση'. Στη φόρμα που θα σας εμφανιστεί
πληκτρολογήστε τον τίτλο και την περιγραφή της άσκησης. Μπορείτε επίσης να ορίσετε τον τρόπο
που θα εμφανίζεται η άσκηση (σε μια σελίδα ή μια ερώτηση ανά σελίδα), τον χρονικό περιορισμό
στον οποίο υπόκειται (έναρξη – λήξη), τον αριθμό των επαναλήψεων που έχει στην διάθεση του ο εκπαιδευόμενος
για να επαναλάβει την συγκεκριμένη άσκηση αλλά και το εάν μετά την ολοκλήρωση της άσκησης θα
εμφανίζονται τόσο οι σωστές απαντήσεις όσο και η βαθμολογία τους.
Επίσης τσεκάροντας το 'τυχαίες ερωτήσεις' εμφανίζονται οι ερωτήσεις με τυχαία σειρά στους εκπαιδευόμενους.
Μόλις ολοκληρώσετε τις αλλαγές κάντε κλικ στο 'Δημιουργία'.</p>
<p>Για να ορίσετε ερωτήσεις στην άσκηση κάντε κλικ στο 'Νέα ερώτηση'.
Μπορείτε να δημιουργήσετε τους παρακάτω τύπους ερωτήσεων
<ul>
  <li>Πολλαπλής Επιλογής (Μοναδική Απάντηση)</li>
  <li>Πολλαπλής Επιλογής (Πολλαπλές Απαντήσεις)</li>
  <li>Ταίριασμα</li>
  <li>Συμπλήρωμα κενών</li>
  <li>Σωστό / Λάθος</li>
</ul></p>
<p>
 Πληκτρολογήστε τον τίτλο της ερώτησης και προαιρετικά μπορείτε να εισαγάγετε σχόλιο και εικόνα. Μόλις ολοκληρώσετε κάντε κλικ στο 'Εντάξει'.
 </p>
 <p>Μπορείτε να εισαγάγετε ερωτήσεις από άλλη άσκηση κάνονας κλικ στο 'Ερώτηση από άλλη άσκηση'. Αναζητήστε την ερώτηση που θέλετε και κάντε
 κλικ στο εικονίδιο <i class='fa fa-plus-square'></i></p>
 <p>Για να αλλάξετε μια άσκηση κάντε κλικ στο <i class='fa fa-edit'></i>.
    Για να διαγράψετε μια άσκηση κάντε κλικ στο <i class='fa fa-times'></i>.
    Για να είναι ή όχι ορατή η άσκηση σας κάντε κλικ στο <i class='fa fa-eye'></i>.
    Για να δείτε τις διαθέσιμες ερωτήσεις (από όλες τις ασκήσεις) κάντε κλικ στο 'Τράπεζα Ερωτήσεων'.
    Μπορείτε να δείτε τα αποτελέσματα των ασκήσεων σε μορφή html ή csv κάνοντας κλικ στο 'html' ή 'csv' αντίστοιχα.
 </p>";

$langExercise_studentContent="<p>Παρουσιάζονται όλες οι διαθέσιμες ασκήσεις. Αφού ολοκληρώσετε μια άσκηση σας εμφανίζεται η
        βαθμολογία σας και τυχόν επιτρεπόμενες επαναλήψεις ή χρονικός περιορισμός. Για να εκτελέσετε μια άσκηση κάντε κλικ
        πάνω στον τίτλο της άσκησης.";


// Work
$langHWork = "Εργασίες";
$langHWork_student = $langHWork ;
$langWorkContent = "<p>Μπορείτε να δημιουργήσετε μια εργασία κάνοντας κλικ στο σύνδεσμο 'Δημιουργία Εργασίας'</b>.
Συμπληρώστε τον τίτλο της εργασίας και καθορίστε την ημερομηνία υποβολής. Προαιρετικά μπορείτε να προσθέστε και ένα
σχόλιο. Θα πρέπει να επιλέξετε τον τύπο της εργασίας 'Ατομική' (αφορά εργασία από ένα χρήστη) ή 'Ομαδική' (αφορά εργασία από μια ομάδα χρηστών).
Σημειώστε ότι αν επιλέξετε 'Ομαδική' θα πρέπει πρώτα να έχετε ενεργοποιήσει το υποσύστημα 'Ομάδες Χρηστών'.</p>
<p>Μόλις ολοκληρωθεί η δημιουργία της εργασίας μπορείτε να διορθώσετε την εργασία κάνοντας κλικ στο
εικονίδιο <img src='$themeimg/edit.png' border='0' align='middle'> ή να την
διαγράψετε κάνοντας κλικ στο εικονίδιο <img src='$themeimg/delete.png' border='0' align='middle'>.
Κάνοντας κλικ στον τίτλο της εργασίας βλέπετε τις εργασίες που έχουν υποβληθεί από τους εκπαιδευόμενους.
Σε αυτό το σημείο εμφανίζονται τα στοιχεία του εκπαιδευόμενου όπως: ο αριθμός μητρώου,
η ημερομηνία υποβολής της εργασίας καθώς και το αρχείo της εργασίας.
Μέσω της επιλογής 'Κατέβασμα όλων των εργασιών σε μορφή .zip' σας δίνετε η δυνατότητα να κατεβάσετε
όλα τα αρχεία της συγκεκριμένης εργασίας τα οποία έχουν υποβάλλει οι εκπαιδευόμενοι.
Για να βαθμολογήσετε την εργασία συμπληρώστε τον αντίστοιχο βαθμό δίπλα στο όνομα του εκπαιδευόμενου και
κάντε κλικ στο 'Υποβολή Βαθμολογίας'. Μπορείτε να προαιρετικά να προσθέσετε και σχόλιο.
Ο εκπαιδευόμενος έχει την δυνατότητα να δει τον βαθμό του πατώντας στον τίτλο της
εργασίας.</p><hr>";
$langWork_studentContent = "<p>Παρουσιάζονται όλες οι εργασίες του μαθήματος που έχουν δημιουργηθεί από τον εκπαιδευτή.
Για την υποβολή της εργασίας κάντε κλικ στον τίτλο της. Σε περίπτωση που έχετε υποβάλλει μια εργασία
και θέλετε να την διορθώσετε θα πρέπει να την ξαναυποβάλετε. Η 'παλιά' εργασία θα
αντικατασταθεί με τη 'καινούργια'.</p>
<p>Σημειώστε ότι δεν είναι δυνατή η αποστολή εργασίας μετά τη λήξη της προθεσμίας υποβολής.</p>";

// Group
$langHGroup="Ομάδες Χρηστών";
$langHGroup_student = $langHGroup;
$langGroupContent="<p>Μπορείτε να δημιουργήσετε ομάδες χρηστών για το μάθημά σας.
 Για να δημιουργήσετε μια ομάδα χρηστών κάντε κλικ στο 'Δημουργία'. Θα σας ζητηθεί
 ο αριθμός της ομάδας ή των ομάδων χρηστών που θα δημιουργηθούν καθώς και ο αριθμός
 των συμμετεχόντων σε αυτή. Στη συνέχεια κάντε κλικ στο 'Δημιουργία'.</p>
 <p>Για να διαγράψετε όλες τις ομάδες χρηστών κάντε κλικ στο 'Διαγραφή'.</p>
 <p>Για να συμπληρώσετε όλες τις ομάδες χρηστών με τους επαπομείναντες χρήστες κάντε κλικ στο 'Συμπλήρωση Όλων'.</p>
<p>Για να διαγράψετε όλους τους χρήστες από όλες τις ομάδες χρηστών κάντε κλικ στο 'Εκκαθάριση όλων'.</p>
<p>Μόλις δημιουργήσετε μια ομάδα χρηστών θα σας εμφανιστεί κάτω από τις 'Ρυθμίσεις ομάδεων χρηστών'.
Μπορείτε να τη διαγράψετε (κάνοντας κλικ στο <img src='$themeimg/delete.png' width=16 height=16>) ή αλλάζοντας
        τους χρήστες της κάνοντας κλικ στο <img src='$themeimg/edit.png' width=16 height=16>.</p>
Για να αλλάξετε τις ρυθμίσεις των ομάδων χρηστών κάντε κλικ στο εικονίδιο δίπλα στις 'Ρυθμίσεις ομάδων χρηστών'.
Μπορείτε να ρυθμίσετε το εάν οι εκπαιδευόμενοι θα επιτρέπεται να εγγραφούν μόνοι τους στις ομάδες χρηστών
ή θα χρειαστεί παρέμβαση από τον εκπαιδευτή. Επίσης σας δίνεται η δυνατότητα της επιλογής
σχετικά με το εάν η ομάδα θα διαθέτει περιοχή συζητήσεων ή όχι. Μπορείτε να επιλέξετε αν
η πρόσβαση στην περιοχή συζητήσεων να είναι κλειστή (δηλαδή να επιτρέπεται η συμμετοχή
μόνο σε μέλη της ομάδας) ή να είναι ανοικτή (δηλαδή να μπορεί κάθε εκπαιδευόμενος να διαβάσει
και να γράψει μηνύματα).</p>";

$langHGroupSpace="Ομάδες Χρηστών";
$langGroupSpaceContent = "<p>Για να διορθώσετε τα στοιχεία της ομάδας χρηστών κάντε κλικ στο 'Διόρθωση της ομάδας χρηστών'.
        Κάνοντας κλικ στο 'Περιοχές συζητήσεων' μεταφέρεστε στο υποσύστημα 'περιοχές συζητήσεων' όπου έχει δημουργηθεί μια
        περιοχή συζητήσεων για κάθε ομάδα χρηστών. Κάνοντας κλικ στο 'Εγγραφα ομάδας' μπορείτε να προσθέστε ή να αφαιρέσετε
        μέσω των αντίστοιχων συνδέσμων έγγραφα τα οποία θα αφορούν την συγκεκριμένη ομάδα.
        Εδώ και πάλι πρέπει να τονιστεί ότι τα ανεβασμένα  έγγραφα της ομάδας αφορούν την συγκριμένη ομάδα
        και δεν σχετίζονται με το υποσύστημα 'Έγγραφα' της κύριας οθόνης της πλατφόρμας.
        Μπορείτε να στείλετε ηλεκτρονικό μήνυμα στα μέλη μιας ομάδας κάνοντας κλικ στο 'Αποστολή e-mail στην ομάδα'.
         Επίσης μπορείτε να δείτε κάποια στατιστικά για μια ομάδα κάνοντας κλικ στο 'Στατιστικά'.</p>";

$langGroup_studentContent="<p>Σας εμφανίζονται όλες οι διαθέσιμες ομάδες χρηστών που έχουν καθοριστεί από τον
        διδάσκοντα του μαθήματός σας.
        Για να εγγραφείτε σε μια ομάδα κάντε κλικ στο 'Έγγραφή' (δίπλα στο όνομα της ομάδας).";


// Agenda
$langHAgenda = "Ατζέντα";
$langHAgenda_student = $langHAgenda ;
$langAgendaContent = "<p>Για την προσθήκη ενός γεγονότος στην ατζέντα του μαθήματος πατήστε στο σύνδεσμο
        'Προσθήκη ενός γεγονότος'. Πληκτρολογήστε τον τίτλο, την ημερομηνία και το χρονικό διάστημα
        που θα αναρτηθεί το συγκεκριμένο γεγονός καθώς και την περιγραφή του.
        Η διαδικασία ολοκληρώνεται κάνοντας κλικ στο 'Προσθήκη /Αλλαγή'.</p>
        <p>Αφού προσθέσετε ένα γεγονός μπορείτε να κάνετε τα παρακάτω:
        <ul>
        <li>Να τροποποιήσετε ένα γεγονός κάνοντας κλικ στο εικονίδιο <img src='$themeimg/edit.png' width=16 height=16></li>
        <li>Να διαγράψετε ένα γεγονός κάνοντας κλικ στο εικονίδιο <img src='$themeimg/delete.png' width=16 height=16></li>
        <li>Να καθορίσετε το αν θα εμφανίζεται στους εκπαιδευόμενους κάνοντας κλικ στο εικονίδιο <img src='$themeimg/visible.png' width=16 height=16></li>
        <li>Να αλλάξετε τη σειρά παρουσίασης των γεγονότων κάνοντας κλικ στο 'Αντιστροφή σειράς παρουσίασης'.</li>
      </ul>
      </p>
<hr noshade size=1>
<p> $langPHPMathPublisher</p>";

$langAgenda_studentContent= "<p>Παρουσιάζονται όλα τα γεγονότα του μαθήματος σας που έχουν οριστεί από τον εκπαιδευτή</p>";

$langHMyAgenda = "Το ημερολόγιό μου";
$langMyAgendaContent = $langAgenda_studentContent;


// link
$langHLink = "Σύνδεσμοι";
$langHLink_student = $langHLink;
$langLinkContent = "<p>Εμφανίζονται όλοι οι σύνδεσμοι που έχετε προσθέσει στο μάθημά σας. Για να προσθέσετε ένα σύνδεσμο
         κάντε κλικ στο 'Προσθήκη συνδέσμου'. Στην εμφανιζόμενη οθόνη πληκτρολογήστε τη διεύθυνση του
         πόρου στον Παγκόσμιο Ιστό, το όνομα του και μια προαιρετική περιγραφή. Προαιρετικά επίσης
         μπορείτε να ταξινομήσετε το σύνδεσμο σε μια κατηγορία που έχετε ήδη ορίσει. Κάντε κλικ στο 'Προσθήκη' για να
         υποβάλλετε τις αλλαγές σας.</p>
         <p>Μπορείτε να οργανώσετε τους συνδέσμους σε κατηγορίες. Για να δημιουργήσετε μια κατηγορία κάντε κλικ στο
         'Προσθήκη κατηγορίας'. Στην εμφανιζόμενη οθόνη πληκτρολογήστε το όνομα της κατηγορίας και μια περιγραφή
         της. Κάντε κλικ στο 'Προσθήκη κατηγορίας' για να υποβάλλετε τις αλλαγές σας.</p>
<hr>
<p>
<ul>
  <li>Για να τροποποιήσετε ένα σύνδεσμο κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16></li>
  <li>Για να διαγράψετε ένα σύνδεσμο κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
  <li>Για να αλλάξετε τη σειρά εμφάνισης των συνδέσμων κάντε κλικ στο εικονίδια <img src='$themeimg/up.png' width=16 height=16> και
          <img src='$themeimg/down.png' width=16 height=16></li>.
 </ul>";
$langLink_studentContent = "<p>Παρουσιάζονται όλοι οι σύνδεσμοι που έχουν οριστεί από τους εκπαιδευτές του μαθήματος.</p>";


// Announcements
$langHAnnounce = "Ανακοινώσεις";
$langHAnnounce_student = $langHAnnounce ;
$langAnnounceContent = "<p>Μπορείτε να προσθέσετε ανακοινώσεις στο μάθημά σας κάνοντας κλικ στο 'Προσθήκη Ανακοίνωσης'.
        Στην εμφανιζόμενη φόρμα συμπληρώνετε τον τίτλο και το σώμα της ανακοίνωσης.
        Εάν επιθυμείτε την αποστολή της συγκεκριμένης ανακοίνωσης μέσω μηνύματος ηλεκτρονικού ταχυδρομείου (email)
        σε όλους τους εγγεγραμμένους στο μάθημα χρήστες απλά επιλέξτε το αντίστοιχο πλαίσιο έλεγχου.
        Η διαδικασία ολοκληρώνεται κάνοντας κλικ στο 'Προσθήκη'.</p>
        <p>
        <ul>
        <li>Για να αλλάξετε το περιεχόμενο μιας ανακοίνωσης κάντε κλικ στο εικονίδιο <img src='$themeimg/edit.png' width=16 height=16>.</li>
        <li>Για να διαγράψετε μια ανακοίνωση κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
        <li>Για να καθορίσετε το αν θα εμφανίζεται η ανακοίνωση στους εκπαιδευόμενους ή όχι κάντε κλικ στο εικονίδιο <img src='$themeimg/visible.png' width=16 height=16></li>
        </ul>
        </p>
<p>Το εικονίδιο <img src='$themeimg/feed.png' width=16 height=16> αφορά την δυνατότητα αυτόματης παραλαβής ανακοινώσεων του μαθήματος
        μέσω RSS (Really Simple Syndication) τόσο από υπολογιστή όσο και από κινητό τηλέφωνο.
        Κάνοντας κλικ στο εικονίδιο και διαθέτοντας στον υπολογιστή ή το κινητό σας τηλέφωνο ένα RSS reader
        μπορείτε να επωφεληθείτε από τα πλεονεκτήματα της συγκεκριμένης υπηρεσίας.</p>
<hr noshade size=1>
<p> $langPHPMathPublisher</p>";

$langHAnnounce_student = $langHAnnounce;

$langAnnounce_studentContent = "<p>Παρουσιάζονται όλες οι ανακοινώσεις που έχουν οριστεί από τον εκπαιδευτή του μαθήματός σας.</p>
        <p>Το εικονίδιο <img src='$themeimg/feed.png' width=16 height=16> αφορά την δυνατότητα αυτόματης παραλαβής ανακοινώσεων του μαθήματος
        μέσω RSS (Really Simple Syndication) τόσο από υπολογιστή όσο και από κινητό τηλέφωνο.
        Κάνοντας κλικ στο εικονίδιο και διαθέτοντας στον υπολογιστή ή το κινητό σας τηλέφωνο ένα RSS reader
        μπορείτε να επωφεληθείτε από τα πλεονεκτήματα της συγκεκριμένης υπηρεσίας.</p>";

// profile
$langHProfile = "Αλλαγή του Προφίλ μου";
$langProfileContent = "
<p>Μέσω του συγκεκριμένου υποσυστήματος μπορείτε να αλλάξετε τα στοιχεία σας.
Συγκεκριμένα μπορείτε να αλλάξετε το ονοματεπώνυμο σας, το username σας, τον αριθμό μητρώου κ.λπ..
Μπορείτε επίσης να αλλάξετε τον τρόπο εμφάνισης του χαρτοφυλακίου σας επιλέγοντας 'Αναλυτικό' ή 'Συνοπτικό' τρόπο.
Εάν επιθυμείτε ή όχι να λαμβάνετε e-mails από τα μαθήματα σας τσεκάρετε την αντίστοιχη επιλογή.
 Για να ανεβάσετε μια εικόνα στο προφίλ σας κάντε κλικ στο 'Προσθήκη εικόνας'. Για να ολοκληρώσετε τις αλλαγές σας κάντε κλικ
 στο 'Αλλαγή'.</p>
 <p>Αν θέλετε να αλλάξετε το συνθηματικό σας (password) κάντε κλικ στο 'Αλλαγή συνθηματικού πρόσβασης'.
 Για να επιλέξετε τα μαθήματα από τα οποία θέλετε να λαμβάνετε emails κάντε κλικ στο 'Ειδοποιήσεις μαθήματος'.
 Για να διαγράψετε το λογαριασμό σας κάντε κλικ στο 'Διαγραφή λογαριασμού'.";

// External Module
$langHModule = "Προσθήκη εξωτερικού συνδέσμου";
$langModuleContent = "<p>Αν θέλετε να προσθέσετε συνδέσμους από την αρχική σελίδα του μαθήματος προς άλλες ιστοσελίδες
πληκτρολογήστε το σύνδεσμο και τον τίτλο του και στη συνέχεια κάντε κλικ στο 'Προσθήκη'.
Οι σελίδες που προσθέτετε με αυτόν τον τρόπο μπορούν να απενεργοποιηθούν και να διαγραφούν.</p>";

//tools management
$langHcourseTools = "Ενεργοποίηση εργαλείων";
$langcourseToolsContent = "<p>Μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε τα διάφορα υποσυστήματα του μαθήματος.
Στις δύο στήλες παρουσιάζεται η κατάσταση του κάθε υποσυστήματος, δηλαδή αν είναι ενεργό ή όχι.<br>
Χρησιμοποιήστε το <img src='$themeimg/arrow.png' width=16 height=16> για να τα μεταφέρετε από την μία στήλη στην άλλη.
        Μπορείτε να επιλέξετε περισσότερα από ένα υποσυστήματα κρατώντας πατημένο το πλήκτρο
 CTRL και επιλέγοντας τα με το ποντίκι. Οι αλλαγές θα ολοκληρωθούν αφού κάνετε κλικ στο 'Υποβολή αλλαγών'.</p>";

$langCourseAccessHelp = "
<ul>
<li><b><img src='$themeimg/lock_open.png' width=16 height=16> Ανοικτό Μάθημα</b>.
        Επιτρέπεται η ελεύθερη πρόσβαση δηλαδή χωρίς εγγραφή σε αυτό ή τη δημιουργία λογαριασμού στην πλατφόρμα.</li>
<li><b><img src='$themeimg/lock_registration.png' width=16 height=16> Απαιτείται εγγραφή</b>.
        Επιτρέπεται η πρόσβαση σε όσους διαθέτουν λογαριασμό στην πλατφόρμα.
        Υπάρχει η δυνατότητα ορισμού προαιρετικού συνθηματικού.</li>
<li><b><img src='$themeimg/lock_closed.png' width=16 height=16> Κλειστό μάθημα</b>.
        Επιτρέπεται η πρόσβαση στο μάθημα (για εγγραφή) μόνο σε όσους βρίσκονται στη Λίστα Χρηστών του μαθήματος.</li>
<li><b><img src='$themeimg/lock_inactive.png' width=16 height=16> Ανενεργό μάθημα</b>.
        Επιτρέπεται η πρόσβαση στο μάθημα μόνο από τους εκπαιδευτές του μαθήματος.</li>
</ul>";

// course info
$langHInfocours = "Διαχείριση Μαθήματος";
$langInfocoursContent = "
<p>Μπορείτε να τροποποιήσετε/επεξεργαστείτε μια σειρά παραμέτρων οι οποίες σχετίζονται με το μάθημά σας όπως τον κωδικό του μαθήματος,
τον τίτλο του, τα ονόματα των εκπαιδευτών, την σχολή / τμήμα στο οποίο ανήκει κ.λπ.</p>
<p>Μπορείτε να αλλάξετε τον τρόπο πρόσβασης του μαθήματος σας. Οι διαθέσιμοι τύποι πρόσβασης είναι:
$langCourseAccessHelp
</p>
<p>Για να αλλάξετε τη γλώσσα εμφάνισης των μηνυμάτων του μαθήματος επιλέξτε την αντίστοιχη γλώσσα.</p>
<p>Για να ολοκληρωθούν οι ενέργειες κάντε κλικ στο 'Υποβολή'.</p>
<p>Άλλες διαθέσιμες ενέργειες είναι:
<ul>
<li><b>Αντίγραφο ασφαλείας του μαθήματος:</b> Μπορείτε να δημιουργήσετε ένα αντίγραφο ασφαλείας του μαθήματος
και να το αποθηκεύσετε τοπικά στον υπολογιστή σας.
Σε περίπτωση που θέλετε να ανακτήσετε το περιεχόμενό του θα πρέπει να επικοινωνήσετε με τον διαχειριστή της πλατφόρμας.</li>
<li><b>Διαγραφή του μαθήματος:</b> Διαγράφοντας το μάθημα, διαγράφετε το περιεχόμενό του και οι χρήστες από αυτό. (σημειώστε ότι δεν διαγράφονται από την πλατφόρμα).</li>
<li><b>Ανανέωση μαθήματος:</b> Μπορείτε επιλεκτικά να διαγράψετε κάποια από τα δεδομένα του μαθήματος για να το προετοιμάσετε για την καινούρια ακαδημαϊκή χρονιά.</li>
</ul>
</p>";

// Chat
$langHConference = "Τηλεσυνεργασία";
$langConferenceContent = "<p>Μπορείτε να επικοινωνήσετε σε πραγματικό χρόνο με τους εκπαιδευόμενους του μαθήματός σας.
        Πληκτρολογήστε το μήνυμα σας και κάντε κλικ στο <img src='$themeimg/arrow.png' width=16 height=16>.</p>
       <p>Για να διαγράψετε όλα τα μηνύματα κάντε κλικ στο 'Καθάρισμα'. Για να αποθηκεύσετε τα μηνύματα
       κάντε κλικ στο 'Αποθήκευση'. Τα μηνύματα αποθηκεύονται σε ένα αρχείο κειμένου και μεταφέρονται στο υποσύστημα 'Έγγραφα'.</p>";

$langHConference_student = $langHConference ;
$langConference_studentContent ="<p>Μπορείτε να επικοινωνήσετε σε πραγματικό χρόνο με εκπαιδευτές ή με τους εκπαιδευόμενους του μαθήματος.
        Πληκτρολογήστε το μήνυμα σας και κάντε κλικ στο <img src='$themeimg/arrow.png' width=16 height=16>.</p>";

//  video
$langHVideo = "Πολυμέσα";
$langHVideo_student = $langHVideo ;
$langVideoContent = "<p>Για να προσθέσετε πολυμεσικό υλικό στο μάθημά σας κάντε κλικ στο 'Προσθήκη πολυμεσικού αρχείου'.
        Αναζητήστε το αρχείο που θέλετε στον υπολογιστή σας μέσω του 'Browse'. Πληκτρολογήστε τον τίτλο και προαιρετικά μια περιγραφή.
         Κάντε κλικ στο 'Ανέβασμα αρχείου' για να ολοκληρωθεί η ενέργειά σας.</p>
         <p>Για να προσθέσετε ένα σύνδεσμο βίντεο κάντε κλικ στο 'Προσθήκη συνδέσμου βίντεο'.
         Πληκτρολογήστε το url του συνδέσμου, τον τίτλο και προαιρετικά μια περιγραφή.
         Κάντε κλικ στο 'προσθήκη' για να ολοκληρωθεί η ενέργειά σας.</p>
        <p>
        <ul>
        <li>Για να το αποθηκεύσετε κάντε κλικ στο <img src='$themeimg/save.png' width=16 height=16></li>
        <li>Για να αλλάξετε το ένα πολυμεσικό αρχείο κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16>.</li>
        <li>Για να διαγράψετε ένα πολυμεσικό αρχείο κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
        <li>Για να σας εμφανιστεί σε ξεχωριστό (αναδυόμενο) παράθυρο κάντε κλικ στο <img src='$themeimg/links_on.png' width=16 height=16></li>
        </ul>
        </p>";

$langVideo_studentContent = "<p>Εμφανίζονται όλα τα πολυμεσικά αρχεία που έχει ανεβάσει ο εκπαιδευτής του μαθήματος.
        <ul>
        <li>Για να αποθηκεύσετε ένα αρχείο κάντε κλικ στο <img src='$themeimg/save.png' width=16 height=16></li>
        <li>Για να σας εμφανιστεί σε ξεχωριστό (αναδυόμενο) παράθυρο κάντε κλικ στο <img src='$themeimg/links_on.png' width=16 height=16></li>
        </ul>
        </p>";

// course description
$langHCoursedescription = "Πληροφορίες Μαθήματος";
$langHCoursedescription_student = $langHCoursedescription ;
$langCoursedescriptionContent = "<p>Μπορείτε να προσθέσετε πληροφορίες κάνοντας κλικ στο 'Δημιουργία και Διόρθωση'.
        Επιλέξτε την κατηγορία (Βοηθήματα, Περιεχόμενο Μαθήματος κ.λπ.) και κάντε κλικ στο 'Προσθήκη'.

        <ul>
        <li>Για να την τροποποιήσετε κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16>.</li>
        <li>Για να τη διαγράψετε κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
        <li>Για να εμφανιστεί στην κεντρική σελίδα του μαθήματος κάντε κλικ στο εικονίδιο <img src='$themeimg/unpublish.png' width=16 height=16></li>
        </ul>
        </p>
<hr>
<p>
$langPHPMathPublisher";

$langCoursedescription_studentContent ="<p>Παρουσιάζονται διάφορες πληροφορίες σχετικά με το μάθημά σας.</p>";


// Scorm / Learning Path
$langHPath="Βοήθεια - Γραμμή Μάθησης";
$langHPath_student=$langHPath ;
$langPathContent="
<p>Το εργαλείο 'Γραμμή Μάθησης' υποστηρίζει τέσσερις βασικές λειτουργίες:</p>
<ul>
<li>Δημιουργία γραμμής μάθησης</li>
<li>Εισαγωγή γραμμής μάθησης από πρότυπο SCORM ή IMS</li>
<li>Εξαγωγή γραμμής μάθησης σε πρότυπο συμβατό με Scorm 2004 ή 1.2</li>
<li>Παρακολούθηση των εκπαιδευόμενων στις γραμμές μάθησης</li>
</ul>
<hr>
<p><b>Τί είναι η γραμμή μάθησης;</b></p>
<p>Η γραμμή μάθησης είναι μια ακολουθία από βήματα μάθησης που περιλαμβάνονται σε ενότητες.
Μπορεί να είναι είτε βασισμένη σε περιεχόμενo (μοιάζει με πίνακα περιεχομένων)
είτε βασισμένη σε ενέργειες, μοιάζοντας με ατζέντα ή πρόγραμμα που αναφέρει τις ενέργειες που χρειάζεται να κάνει
ο εκπαιδευόμενος για να κατανοήσει ή να εκπαιδευτεί σε μια συγκεκριμένη πηγή γνώσης.
Επιπροσθέτως του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει μια
συγκεκριμένη αλληλοδιαδοχή. Αυτό σημαίνει πως κάποια βήματα είναι προαπαιτούμενα για τα
αμέσως επόμενα αυτών βήματα (\"δεν μπορείτε να πάτε στο βήμα 2 πρίν το βήμα 1\").
Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική (τα βήματα εμφανίζονται το ένα μετά
το άλλο).</p>
<hr>
<p><b>Πώς δημιουργείτε τη δικιά σας γραμμή μάθησης;</b></p>
<p>Το πρώτο βήμα είναι να προσπελάσετε τον τομέα Λίστα Γραμμών Μάθησης. Στην κεντρική
οθόνη της λίστας γραμμών μάθησης, υπάρχει ένας ειδικός σύνδεσμος. Εκεί μπορείτε να
δημιουργήσετε όσες γραμμές μάθησης επιθυμείτε πατώντας στο σύνδεσμο
<i> 'Δημιουργία νέας γραμμής μάθησης '</i>. Δημιουργούνται με αυτόν τον τρόπο κενές
γραμμές μάθησης, μέχρι να τους προσθέσετε ενότητες και βήματα.</p>
<hr>
<p><b>Ποιά είναι τα βήματα για τις γραμμές αυτές ; (Ποιά είναι τα αντικείμενα που μπορούν να προστεθούν ;)</b></p>
<p>Κάποια από τα εργαλεία, τις ενέργειες και το περιεχόμενο του Open eClass που θεωρείτε
χρήσιμα και κατάλληλα για τη γραμμή σας μπορούν να προστεθούν:</p>
<ul>
<li>Ξεχωριστά έγγραφα (κείμενα, εικόνες, Έγγραφα τύπου Office, ...)</li>
<li>Ετικέτες</li>
<li>Σύνδεσμοι</li>
<li>Ασκήσεις του Open eClass</li>
<li>Περιγραφή μαθήματος</li>
</ul>
<hr>
<p><b>Άλλα χαρακτηριστικά της Γραμμής Μάθησης</b></p>
<p>Μπορεί να ζητηθεί από τους εκπαιδευόμενους να ακολουθήσουν (αναγνώσουν)
τη γραμμή σας με μια συγκεκριμένη σειρά. Αυτό σημαίνει για παράδειγμα ότι οι
εκπαιδευόμενοι δεν μπορούν να προσπελάσουν την Άσκηση 2 αν δεν έχουν διαβάσει
το Έγγραφο 1. Όλα τα αντικείμενα έχουν κατάσταση: ολοκληρωμένη ή μη ολοκληρωμένη,
επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του ειδικού
εργαλείου <i>Παρακολούθηση γραμμών μάθησης</i>.</p>
<p>Αν θέλετε να τροποποιήσετε τον αρχικό τίτλο ενός βήματος, ο νέος τίτλος
μπορεί να φαίνεται στη γραμμή, χωρίς να επηρεαστεί ο αρχικός. Επομένως, αν θέλετε
να εμφανίσετε το test8.doc ως 'Τελική Εξέταση' στη γραμμή, δε χρειάζεται να
μετονομάσετε το αρχείο, αλλά αρκεί να χρησιμοποιήσετε έναν άλλο τίτλο στη γραμμή.
Είναι επίσης προτεινόμενο να δίνετε νέους τίτλους στους συνδέσμους αν οι
τελευταίοι έχουν μεγάλο μήκος ονόματος.</p>
<br>
<hr>
<p><b>Τί είναι η γραμμή μάθησης κατά το πρότυπο Scorm ή IMS και πώς μπορείτε να το εισάγετε ;</b></p>
<p>Το εργαλείο γραμμή μάθησης σας επιτρέπει να ανεβάσετε και να εισάγετε
εκπαιδευτικό περιεχόμενο συμβατό με τα πρότυπα SCORM και IMS.</p>
<p>Το SCORM (<i>Sharable Content Object Reference Model</i>) είναι ένα διεθνές
πρότυπο, με το οποίο έχουν ταχθεί πολλοί κυρίαρχοι οργανισμοί που ασχολούνται
με την ασύγχρονη τηλεκπαίδευση (e-Learning), όπως οι: NETg, Macromedia,
Microsoft, Skillsoft, κλπ και το οποίο δρα σε τρείς τομείς:</p>
<ul>
<li><b>Οικονομία</b>: Το πρότυπο Scorm επιτρέπει σε ολόκληρα μαθήματα ή
μικρότερες ενότητες περιεχομένου να επαναχρησιμοποιηθούν σε διαφορετικές
πλατφόρμες τηλεκπαίδευσης (Learning Management Systems - LMS) μέσω του
διαχωρισμού του περιεχομένου και της δομής του,</li>
<li><b>Παιδαγωγική</b>: Το πρότυπο Scorm ενσωματώνει τις έννοιες των
προαπαιτούμενων ή της <i>αλληλοδιαδοχής</i> (<i>π.χ. </i>\"Δεν
μπορείτε να προσπελάσετε το κεφάλαιο 2 αν δεν ολοκληρώσετε επιτυχώς την Άσκηση 1\"),</li>
<li><b>Τεχνολογία</b>: Το πρότυπο Scorm συνθέτει έναν πίνακα περιεχομένων
ως ένα επιπλέον επίπεδο αφαιρετικότητας, ασχέτως περιεχομένου και πλατφόρμας
τηλεκπαίδευσης. Βοηθάει τις έννοιες του περιεχομένου και της πλατφόρμας
τηλεκπαίδευσης στο να επικοινωνούν μεταξύ τους. Η επικοινωνία αυτή αποτελείται
κυρίως από <i>δείκτες</i> (\"Πού ακριβώς βρίσκεται ο Γιάννης στο μάθημα ;\"),
<i>βαθμολογία</i> (\"Με τί βαθμό πέρασε ο Γιάννης την άσκηση ;\") και <i>χρόνο</i>
(\"Πόσο χρόνο ξόδεψε ο Γιάννης στο κεφάλαιο 1 ;\").</li>
</ul>
<hr>
<p><b>Πώς δημιουργείτε μια γραμμή μάθησης συμβατή με το πρότυπο SCORM ;</b></p>
<p>Η πιο φυσική μέθοδος είναι να χρησιμοποιήσετε το εργαλείο δημιουργίας γραμμής
μάθησης του Open eClass και στη συνέχεια να το εξάγετε κάνοντας κλικ στο κατάλληλο
εικονίδιο. Όμως, μπορεί να θέλετε να δημιουργήσετε εκπαιδευτικό περιεχόμενο
συμβατό με το πρότυπο Scorm τοπικά στον υπολογιστή σας και στη συνέχεια να το
εισάγετε στο εργαλείο γραμμή μάθησης του Open eClass. Σε αυτήν την περίπτωση, σας
προτείνουμε να χρησιμοποιήσετε κάποιο εξεζητημένο εργαλείο όπως το
Lectora&reg; ή το Reload&reg;</p>
<hr>
<p><b>Χρήσιμοι σύνδεσμοι</b></p>
<ul>
<li>Adlnet: ή υπεύθυνη αρχή για την κανονικοποίηση του προτύπου Scorm, <a
href=\"http://www.adlnet.org/\">http://www.adlnet.org</a></li>
<li>Reload: εργαλείο Ελεύθερου Λογισμικού/Λογισμικού Ανοικτού Κώδικα για σύνταξη και
ανάγνωση περιεχομένου Scorm, <a
href=\"http://www.reload.ac.uk/\">http://www.reload.ac.uk</a></li>
<li>Lectora: εργαλείο για σύνταξη και δημοσίευση περιεχομένου Scorm, <a
href=\"http://www.trivantis.com/\">http://www.trivantis.com</a></li>
</ul>
<p><b>Σημείωση:</b></p>
<p>Ο τομέας Λίστα γραμμών μάθησης εμφανίζει όλες τις γραμμές μάθησης
<i>που δημιουργήθηκαν μέσω του Open eClass</i> και όλες τις εισηγμένες
γραμμές μάθησης <i>συμβατές με το πρότυπο Scorm</i>.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την γραμμή μάθησης από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langPath_studentContent="<p>Η γραμμή μάθησης είναι μια ακολουθία από βήματα μάθησης χωρισμένα σε ενότητες.
        Μπορεί να είναι είτε βασισμένη σε περιεχόμενο (μοιάζει με πίνακα περιεχομένων)
        είτε βασισμένη σε ενέργειες( μοιάζει με ατζέντα) ή με πρόγραμμα το οποίο περιγράφει
        τις ενέργειες που χρειάζεται να κάνει ο εκπαιδευόμενος για να κατανοήσει μια συγκεκριμένη πηγή γνώσης.
        Εκτός του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει και μια συγκεκριμένη αλληλοδιαδοχή.
        Αυτό σημαίνει πως κάποια βήματα είναι <b>προαπαιτούμενα</b> για τα αμέσως επόμενα αυτών βήματα
        (δεν μπορείτε να πάτε στο βήμα 2 πριν το βήμα 1). Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική
        (τα βήματα εμφανίζονται το ένα μετά το άλλο). Όλα τα αντικείμενα της γραμμής μάθησης έχουν κατάσταση:
        ολοκληρωμένη ή μη ολοκληρωμένη, επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του
        ειδικού εργαλείου ‘Παρακολούθηση γραμμών μάθησης’. Για να παρακολουθήσετε ένα εκπαιδευτικό αντικείμενο
        μιας γραμμής μάθησης πατήστε επάνω στον τίτλο της. Στα εμφανιζόμενα αντικείμενα επιλέξτε πιο
        θα εξακολουθήσετε (προσοχή: σε ορισμένα παίζει ρόλο η σειρά). Ανάλογα των ενεργειών που
        λαμβάνουν χώρα (παρακολούθηση διαφανειών) ο μετρητής προόδου (δεξιά) αλλάζει τα ποσοστά του.
        Μέσω του κουμπιού <img src='$themeimg/monitor.png' width=16 height=16> μπορείτε να
                δείτε τα αναλυτικά τα Στοιχεία του Εκπαιδευτικού Αντικείμενου όπως: Τίτλος, Σχόλια,
                Τύπος ενότητας, σύνολο χρόνου κλπ.</p>";



// Dropbox
$langHDropbox="Ανταλλαγή Μηνυμάτων";
$langHDropbox_student=$langHDropbox ;
$langDropboxContent="<p>Μπορείτε να ανταλλάξετε μηνύματα με τους εκπαιδευόμενους ή με ομάδες χρηστών εκπαιδευόμενων. Για να στείλετε κάποιο μήνυμα κάντε κλικ στο
        'Νέο μήνυμα'. Πληκτρολογήστε τον τίτλο και μηνύμά σας. Αν θέλετε να επισυνάψετε κάποιο αρχείο κάντε κλικ στο 'Όνομα αρχείου'
        Επιλέξτε τον / τους παραλήπτες από το 'Αποστολή'. Αν θέλετε να ειδοποιηθούν οι παραλήπτες μέσω email, τσεκάρετε
        την αντίστοιχη επιλογή. Κάντε κλικ στο 'Αποστολή για να ολοκληρωθεί η διαδικασία.</p>
<p>Αρχικά στην οθόνη σας εμφανίζονται τα εισερχόμενα μηνύματα. Αν θέλετε να δείτε τα εξερχόμενα τότε κάντε κλικ στο 'Εξερχόμενα'.</p>
<p>Για να διαγράψετε ένα μήνυμα κάντε κλικ στο εικονίδιο <img src='$themeimg/delete.png' width=10 height=10>.</p>
<p>Τέλος κάνοντας κλικ στο 'Λοιπές αποστολές' σας εμφανίζονται τα μηνύματα που έχουν αποσταλεί μεταξύ άλλων εκπαιδευόμενων μαζί με τις σχετικές πληροφορίες.</p>";

$langDropbox_studentContent="<p>Μπορείτε να ανταλλάξετε μηνύματα με τους εκπαιδευτές (ή/και με τους εκπαιδευόμενους
αν σας έχει επιτραπεί από τους διαχειριστές της πλατφόρμας). Για να στείλετε κάποιο μήνυμα κάντε κλικ στο 'Νέο μήνυμα'. Πληκτρολογήστε τον τίτλο και το μήνυμά σας.
Αν θέλετε να επισυνάψετε κάποιο αρχείο κάντε κλικ στο 'Όνομα αρχείου'. Επιλέξτε τον / τους παραλήπτες από το 'Αποστολή'.
Αν θέλετε να ειδοποιηθούν οι παραλήπτες μέσω email, τσεκάρετε την αντίστοιχη επιλογή. Κάντε κλικ στο 'Αποστολή για να ολοκληρωθεί η διαδικασία.</p>
<p>Αρχικά στην οθόνη σας εμφανίζονται τα εισερχόμενα μηνύματα. Αν θέλετε να δείτε τα εξερχόμενα τότε κάντε κλικ στο 'Εξερχόμενα'.</p>
<p>Για να διαγράψετε ένα μήνυμα κάντε κλικ στο εικονίδιο <img src='$themeimg/delete.png' width=10 height=10>.</p>";

// Statistics
$langHUsage = "Στατιστικά Χρήσης";
$langUsageContent = "<p>Παρουσιάζονται διάφορα στατιστικά στοιχεία για το μάθημά σας. Αυτά είναι</p>
<p>
<ul>
<li><b>Προτίμηση υποσυστημάτων</b>. Παρουσιάζονται οι προτιμήσεις των χρηστών για τα διάφορα στοιχεία τις πλατφόρμας.
σύμφωνα με διάφορες παραμέτρους (Ημερομηνία Έναρξης, Ημερομηνία λήξης κ.λπ.).</li>
<li><b>Επισκέψεις χρηστών</b>. Εμφάνιζονται οι επισκέψεις των χρηστών στο μάθημα μαζί με διάφορες πληροφορίες.</li>
<li><b>Συμμετοχή χρηστών ανά μάθημα</b>. Εμφανίζεται η συμμετοχή των χρηστών στο μάθημα μαζί με διάφορες πληροφορίες.</li>
<li><b>Γραμμές μάθησης</b>. Εμφανίζεται η πρόοδος των εκπαιδευόμενων όπως έχει καταγραφεί στο υποσύστημα 'Γραμμή μάθησης' .</li>
<li><b>Στατιστικά ομάδων χρηστών</b>. Εμφανίζονται χρήσιμες πληροφορίες σχετικά με τις ομάδες χρηστών.</li>
</ul>
</p>";

$langHPersonalStats = 'Τα στατιστικά μου';
$langPersonalStatsContent = "<p>Εμφανίζονται οι επισκέψεις ανά μάθημα και η χρονική τους διάρκεια.</p>";

// create course
$langHCreateCourse = "Δημιουργία μαθήματος";
$langCreateCourseContent = "<p>Για να δημιουργήσετε ένα μάθημα πληκτρολογήστε τον τίτλο του μαθήματος,
        την σχολή-τμήμα στο οποίο ανήκει (επιλογή από λίστα), τον
εκπαιδευτή του μαθήματος, τον τύπο (προπτυχιακό – μεταπτυχιακό) και
τέλος την γλώσσα που θα εμφανίζεται το συγκεκριμένο μάθημα. Μετά κάντε κλικ στο 'Επόμενο βήμα'.</p>
<p>Προαιρετικά συμπληρώστε μία σύντομη περιγραφή του μαθήματος ή / και λέξεις κλειδιά. Μετά κάντε κλικ στο
'Επόμενο βήμα'.</p>
<p>Επιλέξτε τον τύπο πρόσβαση του μαθήματος.
$langCourseAccessHelp
<p>Επιλέξτε τα υποσυστήματα που θέλετε να ενεργοποιήσετε για το μάθημά σας.</p>
<p>Σημειώστε ότι όλα τα παραπάνω μπορείτε να τα αλλάξετε αργότερα από την 'Διαχείριση μαθήματος'.</p>";


// Wiki
$langWikiSyntaxHelp = "
<h4>Σύνταξη των εντολών</h4>
<p>Δημιουρία σελίδων wiki και συνδέσμων μεταξύ τους</p>
<p><strong>Λέξεις του wiki</strong>: Οι λέξεις του Wiki είναι λέξεις που είναι γραμμένες σαν <em>Λέξη</em>. Για να δημιουργήσετε μια σελίδα wiki ή ένα σύνδεσμο προς μια σελίδα wiki, διορθώστε μια υπάρχουσα και προσθέστε τον τίτλο της σελίδας σύμφωνα με την σύνταξη. Για παράδειγμα <em>Η σελίδα μου</em>, και ύστερα αποθηκεύστε την. Αυτόματα η λέξη <em>H σελίδα μου</em> θα αντικατασταθεί με ένα σύνδεσμο στη σελίδα Wiki <em>Η σελίδα μου</em>&nbsp;</p>
<p><strong>Σύνδεσμοι Wiki</strong>: Οι σύνδεσμοι Wiki είναι σαν τους υπερσυνδέσμους (βλέπε παρακάτω) εκτός του ότι δεν έχουν αναφορά σε κάποιο πρωτόκολλο (όπως π.χ. <em>http://</em> ή <em>ftp://</em>) και αυτόματα μετατρέπονται σε συνδέσμους σε σελίδες Wiki. Για να δημιουργήσουμε μια καινούρια σελίδα ή ένα σύνδεσμο σε μια υπάρχουσα, διορθώστε την σελίδα και προσθέστε <code>[τίτλο σελίδας]</code> ή <code>[όνομα συνδέσμου|τίτλο σελίδας]</code> προς το περιεχόμενο. Μπορείτε να χρησιμοποιήσετε την παρακάτω σύνταξη για να αλλάξετε το όνομα ενός συνδέσμου Wiki: <code>[όνομα συνδέσμου|λέξη]</code>.</p>
<ul>Υπερσύνδεσμοι
<li><code>[url]</code>, <code>[όνομα|url]</code>, <code>[όνομα|url|γλώσσα]</code> ή <code>[όνομα|url|γλώσσα|τίτλος]</code>.&nbsp;</li></ul>
<ul>Εισαγωγή Εικόνας
<li><code>((url|εναλλακτικό κείμενο))</code>, <code>((url|εναλλακτικό κείμενο|θέση))</code> ή <code>((url|εναλλακτικό κείμενο|θέση|περιγραφή))</code>. <br />Το όρισμα θέσης μπορεί να πάρει τις ακόλουθες τιμές: L (αριστερά), R (δεξιά) ή C (κέντρο).&nbsp;
Επίσης μπορείτε να χρησιμοποιήσετε την σύνταξη των υπερσυνδέσμων. Για παράδειγμα <code>[τίτλος|image.gif]</code>. Πλέον η σύνταξη τείνει να καταργηθεί οπότε καλύτερα να χρησιμοποιήτε την προηγούμενη &nbsp;</li></ul>
<ul>Σύνδεσμο σε εικόνα
<li>σαν τους υπερσυνδέσμου απλά βάλτε ένα 1 σαν πέμπτο όρισμα για να αποφύγετε το φόρτωμα της εικόνας οπότε θα πάρετε ένα υπερσύνδεσμο σε μια εικόνα. Για παράδειγμα <code>[εικόνα|image.gif||0]</code> θα παρουσιάσει ένα σύνδεσμο στην εικόνα image.gif αντί για την ίδια την εικόνα.</li></ul>
<p>Σελιδοποίηση</p>
<ul>
<li><strong>Πλάγια</strong>: περικλείστε το κείμενό σας με απλά εισαγωγικά <code>''κείμενο''</code>&nbsp;</li>
<li><strong>Έντονα</strong>: περικλείστε το κείμενό σας με τρία απλά εισαγωγικά <code>'''text'''</code>&nbsp;</li>
<li><strong>Υπογραμμισμένα</strong>: περικλείστε το κείμενό σας με 2 χαρακτήρες υπογράμμισης <code>__κείμενο__</code>&nbsp;</li>
<li><strong>Διαγραμμισμένα</strong>: περικλείστε το κείμενό σας με δύο παύλες <code>--κείμενο--</code>&nbsp;</li>
<li><strong>Τίτλος</strong>: <code>!!!</code>, <code>!!</code>, <code>!</code> για τίτλους, υπότιτλους, υπο-υπότιτλους αντίστοιχα&nbsp;</li>
<li>Λίστα</li>
Η γραμμή πρέπει να ξεκινάει με <code>*</code> (μη διατεταγμένη λίστα) ή <code>#</code> (διατεταγμένη λίστα). Μπορείτε να ανακατέψετε λίστες (<code>*#*</code>) για να δημιουργήσετε λίστες πολλών επιπέδων.&nbsp;
<li>Παράγραφος</li>
Χωρίστε τις παραγράφους με μία ή περισσότερες γραμμές&nbsp;
</ul>

<h4>Προχωρημένη σύνταξη</h4>
<ul>
<li>Υποσημείωση</li>
<code>$$ κείμενο υποσημείωσης$$</code>&nbsp;
<li>Κείμενο με έτοιμη μορφοποίηση</li>
Ξεκινήστε κάθε γραμμή με ένα κενό &nbsp;
<li>Μπλόκ αναφοράς</li>
<code>&gt;</code> ή <code>;:</code> πριν από κάθε γραμμή &nbsp;
<li>Οριζόντια γραμμή</li>
<code>----</code>&nbsp;
<li>Αναγκαστική αλλαγή γραμμής</li>
<code>%%%</code>&nbsp;
<li>Ακρωνύμιο</li>
<code>??ακρωνύμιο??</code> ή <code>??ακρωνύμιο|ορισμός??</code>&nbsp;
<li>Άμεση αναφορά</li>
<code>{{αναφορά}}</code>, <code>{{αναφορά|γλώσσα}}</code> ή <code>{{αναφορά|γλώσσα|url}}</code>&nbsp;
</ul>
</ul>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει το σύστημα Wiki από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";

$langHWiki = "Wiki";
$langHWiki_student = $langHWiki ;
$langWikiContent = "<p>Για να δημιουργήσετε ένα νέο Wiki πατήστε απλά στο σύνδεσμο 'Δημιουργήστε ένα νέο Wiki'.
        Στην εμφανιζόμενη οθόνη επιλέξτε τον τίτλο του Wiki,
        δώστε την περιγραφή του και πατήστε στα κουμπία 'Αποθήκευση' ή 'Ακύρωση'
        για την αντίστοιχη εργασία.</p>
<p>Μια σειρά ενεργειών είναι στην διάθεση σας σχετικά με το Wiki. Συγκεκριμένα: </p>
<ul>
<li><b>Πρόσφατες αλλαγές.</b> Μέσω αυτής της επιλογής σας δίνετε η δυνατότητα να παρακολουθήσετε τις πρόσφατες αλλαγές που έχουν πραγματοποιηθεί σε ένα Wiki. Ενέργειες όπως η <img src='$themeimg/wiki.png' align='absmiddle'> εμφάνιση της κύριας σελίδας του Wiki, <img src='$themeimg/book.png' align='absmiddle'> εμφάνιση όλων των σελίδων, <img src='$themeimg/list.png' align='absmiddle'> εμφάνιση της λίστας του Wiki είναι στην διάθεση σας μέσω του συγκριμένης υποκατηγορίας.</li>
<li><b>Αλλαγή ιδιοτήτων</b> <img src='$themeimg/edit.png' align='absmiddle'>. Μπορείτε να αλλάξετε τον τίτλο και την περιγραφή συγκεκριμένου Wiki μέσω αυτής της επιλογής. </li>
<li><b>Διαγραφή.</b> Για να διαγράψετε ένα Wiki κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
        </ul>

$langWikiSyntaxHelp";

$langWiki_studentContent = "Μπορείτε να συμμετάσχετε στο wiki που έχει δημιουργήσει ο εκπαιδευτής του μαθήματος/p>
<p>Μια σειρά ενεργειών είναι στην διάθεση σας σχετικά με το Wiki. Συγκεριμένα: </p>
<p><b>Πρόσφατες αλλαγές.</b> Μέσω αυτής της επιλογής σας δίνετε η δυνατότητα να παρακολουθήσετε
τις πρόσφατες αλλαγές που έχουν πραγματοποιηθεί σε ένα Wiki. Ενέργειες όπως η
<img src='$themeimg/wiki.png' align='absmiddle'> εμφάνιση της κύριας σελίδας του Wiki,
        <img src='$themeimg/book.png' align='absmiddle'> εμφάνιση όλων των σελίδων,
                <img src='$themeimg/list.png' align='absmiddle'>εμφάνιση της λίστας του Wiki
                        είναι στην διάθεση σας μέσω του συγκριμένης υποκατηγορίας.</p>
</p>

$langWikiSyntaxHelp";

// glossary
$langHGlossary = "Γλωσσάριο";
$langHGlossary_student = $langHGlossary;
$langGlossaryContent = "<p>
<ul>
  <li>Για να προσθέσετε ένα όρο γλωσσαρίου στο μάθημά σας κάντε κλικ στο 'Προσθήκη Όρου'. Στη φόρμα που σας θα εμφανιστεί πληκτρολογείστε
  τον όρο, τον αντίστοιχο ορισμό του και προαιρετικά ένα url ή /και επιπλέον σημειώσεις. Ολοκληρώστε τις ενέργειές σας
  κάνοντας κλικ στο 'Υποβολή'.</li>
  <li>Για να προσθέσετε μια κατηγορία κάντε κλικ στο 'προσθήκη κατηγορίας'. Στη φόρμα που σας θα εμφανιστεί πληκτρολογείστε το όνομα της
  κατηγορίας και μια προαιρετική περιγραφή.</li>
 <li>Επιπλέον ρυθμίσεις για το γλωσσάριο εμφανίζονται κάνοντας κλικ στο 'Ρυθμίσεις'.</li>
 <li>Κάνοντας κλικ στο 'Οροι σε μορφή csv' μπορείτε να κατεβάσετε τους όρους σε μορφή csv επιλέγοντας την κατάλληλη κωδικοποίηση.</li>
 </ul>
</p>
 <p>
 <ul>
 <li>Για να διορθώσετε έναν όρο κάντε κλικ στο <img src='$themeimg/edit.png' width=16 height=16></li>
 <li>Για να διαγράψετε έναν όρο του κάντε κλικ στο <img src='$themeimg/delete.png' width=16 height=16></li>
</ul>
</p>";
$langGlossary_studentContent = "<p>Εμφανίζονται το γλωσσάρι του μαθήματος σας που έχει οριστεί από τον εκπαιδευτή</p>";

// ebook
$langHEBook = "Ηλεκτρονικό Βιβλίο";
$langHEBook_student = $langHEBook;
$langEBookContent = "
<p>Το 'Hλεκτρονικό βιβλίο' είναι ένα σύνολο υπερκειμένων (hypertext) το οποίο 'προσομοιάζει' το έντυπο βιβλίο. Ουσιαστικά ένα ηλεκτρονικό βιβλίο είναι μια ευέλικτη δομή που εκτός από κείμενο σε ψηφιακή μορφή μπορεί επιπρόσθετα να είναι εμπλουτισμένο με στοιχεία πολυμέσων όπως: εικόνες, βίντεο, εξωτερικούς συνδέσμους (links), κλπ. Παράλληλα το συγκεριμένο υποσύστημα επιτρέπει τη διαμόρφωση των περιεχομένων σε ενότητες - υποενότητες. Η παρουσίαση των περιεχομένων γίνεται με λίστα επιλογής (list box).</p>
<hr>
<h2>&nbsp;&nbsp;Προετοιμασία (Βήμα 1)</h2>
<p>Για να δημιουργήσουμε ένα νέο 'Ηλεκτρονικό Βιβλίο' θα πρέπει να διενεργήσουμε ένα στάδιο προετοιμασίας το οποίο αφορά τη <b>δημιουργία </b> των σχετικών(html) αρχείων τα οποία θα αποτελέσουν το περιεχόμενο του Ηλ. Βιβλίου. Ειναι σημαντκό να τηρηθούν κάποιοι απλοί κανόνες (προδιαγραφές) οι οποίοι επηρρεάζουν άμεσα το οπτικό αποτέλεσμα και περιλαμβάνουν τα ακόλουθα:</p>
<ol>
  <li> Κάθε αρχείο (html) θα πρέπει να περιέχει μία υποενότητα του Ηλ. Βιβλίου (σχετίζεται με την εσωτερική πλοήγηση στο Ηλ. Βιβλίο).</li>
  <li>Η ετικέτα (title) κάθε αρχείου (html) θα πρέπει να διαθέτει τον ακριβή τίτλο της ενότητας που περιέχει (θα χρησιμοποιηθεί από το σύστημα για τη δημιουργία των αντίστοιχων συνδέσμων πλοήγησης στο Ηλ. Βιβλίο).</li>
  <li> Όλα τα αρχεία (html) μαζί με τα απαραίτητα αρχεία που τα συνοδεύουν (π.χ. εικόνες, css), θα πρέπει να είναι τοπικά αποθηκευμένα σε ένα συμπιεσμένο φάκελο (zip).</li>

</ol>
<hr>
<h2>&nbsp;&nbsp;Δημιουργία Hλ. Bιβλίου (Βήμα 2)</h2>

<ol>
  <li>Αρχικά θα πρέπει να εισέλθετε στην πλατφόρμα ως διαχειριστής του ηλεκτρονικού μαθήματος στο οποίο θα δημιουργηθεί το Ηλ. Βιβλίο. </li>
  <li>Επιλέξτε από την κύρια οθόνη του μαθήματος το υποσύστημα <strong>'Ηλεκτρονικό Βιβλίο'</strong></li>
  <li>Πατήστε στον σύνδεσμο <strong>'Δημιουργία'</strong> στην εμφανιζόμενη οθόνη
    <ul>

      <li>Εισάγετε τον <strong>Τίτλο</strong> του Ηλ. Βιβλίου και</li>
      <li>Καθορίστε τη θέση (τοπικά στον Η/Υ σας) που είναι αποθηκευμένα τα  αρχεία (html).</li>
    </ul>
  </li>
    <li>Πατήστε <strong>'Αποστολή'</strong>.</li>
  <li>Στη συνέχεια, <strong>ενεργοποιήσετε</strong> το υποσύστημα Ηλ. Βιβλίο (εάν δεν είναι ενεργοποιημένο) μέσω των 'Εργαλείων διαχείρισης'. <br />

  </li>
</ol>
<hr>
<h2>&nbsp;&nbsp;Δομή Ηλ. Βιβλίου (Βήμα 3)</h2>

<p>Το παραπάνω βήμα (Βήμα 2)εμφανίζει μια οθόνη με πολλαπλές επιλογές και έναν πίνακα με τα αρχεία (html) που ανεβάσατε. Μπορείτε να καθορίσετε τη δομή που επιθυμείτε για ένα βιβλίο, ως εξής:</p>

<ol>
  <li>Αρχικά ξεκινήσετε με τις <strong>Ενότητες</strong> του βιβλίου, προσθέτοντας όσες ενότητες χρειάζεστε. Δηλώστε τον <strong>αύξοντα αριθμό</strong> και το <strong>όνομα</strong> της κάθε ενότητας στα πεδία <strong>Α/Α</strong> και <strong>Τίτλος</strong> αντίστοιχα. </li>

  <li>Στη συνέχεια, διαμορφώστε τις <strong>Υποενότητες</strong> του βιβλίου. Για να γίνει αυτό θα πρέπει:
    <ul>
      <li>να <strong>αντιστοιχίσετε</strong> κάθε αρχείο που έχετε ανεβάσει με τις ενότητες που ορίσατε  παραπάνω.</li>
      <li> να ορίσετε στο πεδίο 'Υποενότητα' τον αύξοντα αριθμό που έχει η υποενότητα μέσα στην Ενότητα στην οποία ανήκει.  <br />

      <em><u>Σημείωση</u>:  η πλατφόρμα προτείνει αυτόματα ως τίτλους υποενοτήτων, τους τίτλους των αντίστοιχων  αρχείων (μπορείτε να τους αλλάξετε στη συνέχεια).</em></li>
    </ul>
</li>
  <li>Αφού ολοκληρωθεί η αντιστοίχιση των αρχείων με τις Ενότητες και τις Υποενότητες, πατάτε <strong>'Υποβολή'</strong>. </li>
  <li>Το σύστημα σας ενημερώνει για την επιτυχή αλλαγή των στοιχείων και το 'Ηλεκτρονικό Βιβλίο' είναι πλέον διαθέσιμο στη μορφή που εσείς ορίσατε.</li>
</ol>

<hr>
<h2>&nbsp;&nbsp;Πλοήγηση σε Hλ. Bιβλίο</h2>

<p>Επιλέξτε από το κεντρικό μενού (αριστερά) το υποσύστημα 'Ηλεκτρονικό Βιβλίο' και από τη λίστα κάνετε κλικ στο όνομα του Ηλ. βιβλίου που επιθυμειτε να πλοηγηθείτε.</p>

<hr>

<h2>&nbsp;&nbsp;Αλλαγή - Διαγραφή Ηλ. Βιβλίου</h2>
<p>Αν επιθυμείτε  να τροποποιήσετε κάποιο Ηλ. Βιβλίο, από το κεντρικό μενού (αριστερά) θα πρέπει να επιλέξετε το υποσύστημα 'Ηλεκτρονικό Βιβλίο' για να εμφανιστεί η λίστα με τα διαθέσιμα Ηλεκτρονικά Βιβλία του μαθήματος. Εκεί πρέπει πατήστε το αντίστοιχο εικονίδιο<strong>'Αλλαγή'</strong>. <br />
<br />
Για να <strong>διαγράψετε</strong> ένα Ηλ. Βιβλίο θα πρέπει όμοια από το κεντρικό μενού (αριστερά) να επιλέξετε το υποσύστημα 'Ηλεκτρονικό Βιβλίο' για να εμφανιστεί η λίστα με τα διαθέσιμα Ηλεκτρονικά Βιβλία του μαθήματος και να πατήσετε στο αντίστοιχο εικονίδιο <strong>'Διαγραφή'</strong>.</p>
<hr>
<h2>&nbsp;&nbsp;Διαχείριση αρχείων (html)</h2>
<p>Αν επιθυμείτε να διαχειριστείτε τα αρχεία (html) που έχετε ανεβάσει σε ένα συγκεκριμένο Ηλ. Βιβλίο, θα πρέπει  </p>
<ul>
  <li>από το κεντρικό μενού (αριστερά) να κάνετε κλικ στο υποσύστημα Ηλεκτρονικό Βιβλίο και από τη λίστα να πατήσετε το αντίστοιχο εικονίδιο για <strong>'Αλλαγή'</strong>,</li>
  <li>επιλέξτε <strong>'Διαχείριση Αρχείων'</strong>, όπου θα εμφανιστεί μία σελίδα όπου θα φαίνεται ο κατάλογος με τα αρχεία html που έχετε ανεβάσει για το ηλεκτρονικό βιβλίο,</li>
  <li>μπορείτε να διαχειριστείτε τον κατάλογο αυτό και τα αρχεία που περιέχει όπως ακριβώς και τα έγγραφα του μαθήματος.</li>
</ul>
<hr>
<h2>&nbsp;&nbsp;Σύνδεση με Θεμ. Ενότητες</h2>
<p>Μπορείτε να συνδέσετε σε μία θεματική ενότητα του μαθήματος σας, την αντίστοιχη <strong>ενότητα</strong> του <strong>ηλεκτρονικού βιβλίου</strong>. Για να το κάνετε αυτό, μπείτε στην ενότητα του μαθήματος στην οποία θέλετε να συνδέσετε το ηλεκτρονικό βιβλίο και από τη γραμμή με τα διαθέσιμα εργαλεία, επιλέξτε <strong>'Προσθήκη Ηλεκτρονικού Βιβλίου'</strong>. Θα εμφανιστεί μία σελίδα στην οποία θα πρέπει να επιλέξετε την ενότητα του ηλεκτρονικού βιβλίου που θέλετε να συνδέσετε. Στη συνέχεια πατήστε <strong>'Προσθήκη Επιλεγμένων'</strong>.</p>";
$langEBook_studentContent = "<p>Το 'Ηλεκτρονικό βιβλίο' είναι ένα σύνολο <b>υπερκειμένων</b> (hypertext) το οποίο 'προσομοιάζει' το έντυπο βιβλίο. Ουσιαστικά ένα ηλεκτρονικό βιβλίο είναι μια ευέλικτη δομή που εκτός από κείμενο σε ψηφιακή μορφή μπορεί επιπρόσθετα να είναι εμπλουτισμένο με στοιχεία πολυμέσων όπως: εικόνες, βίντεο, εξωτερικούς συνδέσμους (links), κλπ. Παράλληλα το συγκεκριμένο υποσύστημα επιτρέπει τη διαμόρφωση των περιεχομένων σε ενότητες - υποενότητες. Η παρουσίαση των περιεχομένων γίνεται με λίστα επιλογής (list box).Η πλοήγηση μέσα στο ηλεκτρονικό βιβλίο πραγματοποιείται με φιλικό τρόπο καθώς υπάρχουν ελεγκτήρια χειρισμού διαφόρων ενεργειών  πχ.  εμπρός-πίσω.</p>";

$langHAddCourseUnits = 'Προσθήκη περιεχομένου θεματικής ενότητας';
$langAddCourseUnitsContent = '<p>Στις θεματικές ενότητες μπορείτε να προσθέσετε εκπαιδευτικό περιεχόμενο ή εκπαιδευτικούς πόρους οι οποίοι βρίσκονται αποθηκευμένοι στα διάφορα εργαλεία του μαθήματος. Τα είδη των διαθέσιμων πόρων που μπορείτε να προσθέσετε βρίσκονται στο μενού «Προσθήκη». Κάντε κλικ στον τύπο του πόρου που θέλετε να προσθέσετε και επιλέξτε από τη λίστα των πόρων (πχ. έγγραφα) αυτούς που σας ενδιαφέρουν. Αμέσως δημιουργείτε μία σελίδα με όλους τους πόρους που επιλέξατε ακολουθούμενη από διάφορα εργαλεία όπως αλλαγή, διαγραφή. Αν στο μάθημα σας έχετε δημιουργήσει πολλές θεματικές ενότητες τότε δημιουργείτε αυτόματα μηχανισμός πλοήγησης επόμενη – προηγούμενη. Επίσης υπάρχει κατάλογος με όλες τις διαθέσιμες θεματικές ενότητες του μαθήματος για απευθείας πρόσβαση.</p>';

$langHBBB = "Τηλεσυνεργασία";
$langHBBB_student = $langHBBB;
$langBBBContent = "<p>Για να προγραμματίσετε μία νέα τηλεδιάσκεψη για το μάθημά σας κάντε κλικ στο 'Προγραμματισμός νέας τηλεδιάσκεψης'.
        Στο πεδίο \"Τίτλος\" συμπληρώστε ένα σύντομο και αντιπροσωπευτικό τίτλο για το περιεχόμενο της τηλεδιάσκεψης ενώ στο πεδίο \"Περιγραφή\" μπορείτε να συμπληρώσετε την ατζέντα συζήτησης/παρουσίασης.
        <br /><br />Τα υπόλοιπα πεδία συμπληρώστε/επιλέξτε τα ως εξής:</p>
        <p>
        <ul>
        <li><strong>Έναρξη τηλεδιάσκεψης</strong>. Ορίστε την ημερομηνία και ώρα προκαθορισμένης έναρξης</li>
        <li><strong>Είδος τηλεδιάσκεψης</strong>. Δημόσια προς τρίτους: Όλοι οι εγγεγραμμένοι χρήστες της πλατφόρμας EClass θα μπορούν να συνδεθούν στην τηλεδιάσκεψη ανεξάρτητα από τα αν είναι εγγεγραμμένοι στο μάθημα ή όχι -  Ιδιωτική: Η τηλεδιάσκεψη θα είναι προσβάσιμη μόνο από τους εκπαιδευόμενους του μαθήματός σας.</li>
        <li><strong>Κατάσταση</strong>. Ορατή: Η τηλεδιάσκεψη θα εμφανίζεται στους εκπαιδευόμενους του μαθήματος - Μη ορατή: Η τηλεδιάσκεψη θα εμφανίζεται μόνο στους εκπαιδευτές. Χρησιμοποιείστε την επιλογή αυτή αν θέλετε να προγραμματίσετε την τηλεδιάσκεψη αλλά να την εμφανίσετε ως διαθέσιμη σε μεταγενέστερο χρόνο.</li>
        <li><strong>Ενεργοποίηση συμμετοχής</strong>: Επιλέξτε πόση ώρα (σε λεπτά) πριν από την προγραμματισμένη έναρξη θα μπορούν να συνδεθούν στην τηλεδιάσκεψη οι συμμετέχοντες.</li>
        <li><strong>Ειδοποίηση εξωτερικών συμμετεχόντων</strong>: Συμπληρώστε ένα σύνολο email παραληπτών οι οποίοι θα λάβουν μέσω email πρόσκληση συμμετοχής στην τηλεδιάσκεψη (π.χ. επισκέπτες, erasmus, καθηγητές ξένων πανεπιστήμιων που δε διαθέτουν πρόσβαση στην πλατφόρμα, κ.ά).</li>
        <li><strong>Ειδοποίηση εκπαιδευόμενων για τον προγραμματισμό της τηλεδιάσκεψης</strong>: Επιλέγοντας τη συγκεκριμένη αποστολή, κατά την αποθήκευση της τηλεδιάσκεψης θα αποσταλεί ενημερωτικό email σε όλους τους συμμετέχοντες.</li>
        </ul>
        </p>";

$langBBB_studentContent = "<p>Εμφανίζονται όλες οι προγραμματισμένες τηλεδιασκέψεις του μαθήματος.
        <ul>
        <li>Για να συνδεθείτε σε κάποια τηλεδιάσκεψη κάντε κλικ στη στήλη \"Ενέργειες\" στο σύνδεσμο με όνομα \"Σύνδεση\"</li>
        <li>Ο σύνδεσμος \"Σύνδεση\" γίνεται διαθέσιμος σε προκαθορισμένο χρόνο πριν την προγραμματισμένη έναρξη. Ο χρόνος αυτός καθορίζεται από τον εκπαιδευτή του μαθήματος</li>
        </ul>
        </p>";

  $langHProgress = "Progress";
  $langHProgress_student = $langHProgress;
  $langProgressContent = "<p>...θα συμπληρωθεί στο τέλος της ανάπτυξης</p>";

  $langProgress_studentContent = "<p>...θα συμπληρωθεί στο τέλος της ανάπτυξης</p>";
