<?php 

/* * ******************************************
  Messages for collaboration platform
 * ***************************************** */

$langCollaboration = "Συνεργασία";
$langSmCollaboration = "συνεργασία";
$langOfCollaboration = "Συνεργασίας";
$langOfSmCollaboration = "συνεργασίας";
$langCollaborationPlatform = "Πλατφόρμα συνεργασίας";
$langEnableCollaboration = "Ενεργοποίηση πλατφόρμας συνεργασίας";
$langAlwaysEnabledCollaboration = "Μόνιμα ενεργοποιημένη";
$langCollaborationCreate = "Δημιουργία συνεργασίας";
$langLogoutFromCollaboration = "πλατφόρμα συνεργασίας";
$langCollaborationPlatformInfo = "Η πλατφόρμα συνεργασίας περιγράφει αναλυτικά την λειτουργικότητα και τεχνική/τεχνολογική 
προσέγγιση για την ψηφιακή πλατφόρμα επικοινωνίας και του περιβάλλοντος συνεργασίας των 
μελών των διαφόρων κοινοτήτων (στελέχη των συνεργαζόμενων φορέων).</br> Τα εργαλεία που ενσωματώνει εξασφαλίζουν τις απαιτούμενες ηλεκτρονικές 
υποδομές για την υποστήριξη συνεργασίας μέσω Διαδικτύου (π.χ. forums, ανταλλαγή 
μηνυμάτων, ανταλλαγή αρχείων, ψηφοφορίες, κλπ.) στο πλαίσιο του έργου.";
$langOpenCoursesTeacherConfirm = "Δήλωση Συντονιστή - Το Διαθέσιμο Συνεργασιακό Υλικό καλύπτει το 100% της Διδακτέας Ύλης";
$langOpenCoursesTeacherConfirmVideo = "Δήλωση Συντονιστή - Οι Βιντεοσκοπημένες Διαλέξεις καλύπτουν το 80% της Διδακτέας Ύλης";
$langCMeta['instructorGroup'] = "Συντονιστες";
$langTutorDefinition = "Συντονιστής (δικαίωμα να επιβλέπει τις ομάδες χρηστών)";
$langTheTeacher = 'Ο συντονιστής';
$langCMeta['instructorGroup'] = "Συντονιστές";
$langTiiSViewReports = "Πρόσβαση χρηστών στην Αναφορά Ομοιότητας";
$langJustEdited = "Μόλις ενημερώσατε την συνεργασία με τίτλο ";
$langCreateCourseLeftForm = "Η δημιουργία συνεργασίας είναι η πιο σημαντική ενέργεια του χρήστη – συντονιστή στην πλατφόρμα.</br></br>
                             Πληκτρολογήστε έναν τίτλο για την συνεργασία σας.</br></br>
                             Πληκτρολογήστε μια σύντομη περιγραφή για το συνεργασία.</br></br>
                             Επιλέξτε το Τμήμα στα πλαίσια του οποίου προσφέρεται η συνεργασία ή την κατηγορία συνεργασιών στην οποία ανήκει.</br></br>
                             Επιλέξτε μία από τις διαθέσιμες μορφές συνεργασιών. </br></br>
                             Καθορίστε, προαιρετικά, την άδεια διάθεσης της συνεργασίας σας.</br></br>
                             Καθορίστε τον τύπο πρόσβασης στην συνεργασία σας. </br></br>
                             Για να ολοκληρωθεί η διαδικασία δημιουργίας της συνεργασίας, πατήστε το κουμπί με την ένδειξη «Δημιουργία Συνεργασίας».";
$langMonthlyReportInfo = "Παρουσιάζονται συγκεντρωτικά στοιχεία (συνεργασίες, χρήστες) των τελευταίων 12 μηνών.";
$langAddingDirectoryIndex = 'Προσθήκη αρχείων index.html στους υποκαταλόγους συνεργασιών';
$langAdministratorGroup = 'Διαχείριση Ομάδων Χρηστών';
$m['WorkToAllUsers'] = "Σε όλα τα $langsOfStudentss";
$m['WorkToUser'] = "Συγκεκριμένα $langsOfStudentss";
$langOpenCoursesShort = "Ανοικτές συνεργασίες";
$langTypeCollaboration = "Συνεργασία";

/* * ***********************************************************
 * Create course
 * ************************************************************ */
$langTeacher = "Χρήστης με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langOfTeacher = "Χρήστη με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langTeachers = "Χρήστες με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langOfTeachers = "Χρηστών με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";

$langsTeacher = "χρήστης με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langsOfTeacher = "χρήστη με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langsTeachers = "χρήστες με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";
$langsOfTeachers = "χρηστών με δικαιωμάτα δημιουργίας μαθήματος ή συνεργασίας";

$langEditor = "Βοηθός χρήστη με δικαιώματα δημιουργίας μαθήματος ή συνεργασίας";
$langOfEditor = "Βοηθού χρήστη με δικαιώματα δημιουργίας μαθήματος ή συνεργασίας";
$langsEditor = "βοηθός χρήστη με δικαιώματα δημιουργίας μαθήματος ή συνεργασίας";
$langsOfEditor = "βοηθού χρήστη με δικαιώματα δημιουργίας μαθήματος ή συνεργασίας";

$langStudent = "Χρήστης χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langOfStudent = "Χρήστη χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langStudents = "Χρήστες χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langOfStudents = "Χρηστών χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";

$langsStudent = "χρήστης χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langsOfStudent = "χρήστη χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langsStudents = "χρήστες χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langsOfStudents = "χρηστών χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langsOfStudentss = "χρήστες χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";
$langsstudent_acc = "χρήστη χωρίς δικαιώματα δημιουργίας μαθημάτων ή συνεργασιών";

$langCourse = "Μάθημα - Συνεργασία";
$langCourses = "Μαθήματα - Συνεργασίες";
$langOfCourses = "Μαθημάτων - Συνεργασιών";
$langOfCourse = "Μαθήματος - Συνεργασίας";

$langsCourse = "μάθημα - συνεργασία";
$langsCourses = "μαθήματα - συνεργασίες";
$langsOfCourse = "μαθήματος - συνεργασίας";
$langsOfCourses = "μαθημάτων - συνεργασιών";


/* * ***********************************************************
 * Create course
 * ************************************************************ */
$langTypeCourse = "μάθημα";
$langTypeCollaboration = "Συνεργασία";
$langDescrInfo = "Σύντομη περιγραφή";
$langOpenCourse = "Ανοικτή";
$langClosedCourse = "Κλειστή";
$langInactiveCourse = "Ανενεργή";
$langCourseInactive= "Πρόσβαση έχουν οι χρήστες με δικαιώματα δημιουργίας μαθήματος ή συνεργασίας";
$langClosedCourseShort = "Πρόσβαση έχουν οι χρήστες που βρίσκονται στη λίστα Χρηστών του μαθήματος ή της συνεργασίας";
$langCourseFormat = "Μορφή";
$langWithCourseUnits = "Μορφή με ενότητες";
$langCourseCreate = "Δημιουργία";



$langSumCollaborationEnrolled = "Συνεργασίες που συμμετέχω";