<?

unset($titreBloc);
unset($titreBlocNotEditable);
unset($questionPlan);
unset($info2Say);

$titreBloc[] = "Περιγραφή";  
$titreBlocNotEditable[] = FALSE;  
$questionPlan[] = "Σε τι αναφέρεται το μάθημα? Χρειάζονται τυχόν προαπαιτούμενα μαθήματα?";  
$info2Say[] = "Πληροφορίες σχετικά με το μάθημα θα δωθούν απο τον διδάσκοντα";  
$titreBloc[] = "Στόχοι";  
$titreBlocNotEditable[] = TRUE;  
$info2Say[] = "Οι στόχοι του μαθήματος θα ανακοινωθούν άμεσα";  
$questionPlan[] = "Ποιοί είναι οι στόχοι του μαθήματος?";  
$titreBloc[] = "Περιεχόμενο Μαθήματος";  
$titreBlocNotEditable[] = TRUE;  
$questionPlan[] = "Ποιο θα είναι η διδακτέα ύλη μαθήματος ?";  
$info2Say[] = "Η διδακτέα ύλη θα ανακοινωθεί σύντομα";  
$titreBloc[] = "Εκπαιδευτικές Δραστηριότητες";  
$titreBlocNotEditable[] = TRUE;  
$questionPlan[] = "Ποιες τυχόν εκπαιδευτικές δραστηριότητηες θα υπάρξουν για την εμπέδωση της διδακτέας ύλης του μαθήματος?";  
$info2Say[] = "Θα υπάρξουν αρκετές. Θα ανακοινωθούν πολύ σύντομα."; 
$titreBloc[] =" Βοηθήματα";  
$titreBlocNotEditable[] = TRUE;  
$questionPlan[] = "Υπάρχουν επιπλέον εκπαιδευτικά βοηθήματα για το μάθημα? Ειναι γενικά διαθέσιμα?";  
$info2Say[] = "Υπάρχουν αρκετά εκπαιδευτικά βοηθήματα για το μάθημα. θα υπάρξει πλήρης κατάλογος και πληροφορίες πρόσβασης.";  
$titreBloc[] = "Ανθρώπινο Δυναμικό";  
$titreBlocNotEditable[] = TRUE;  
$questionPlan[] = "Υπάρχει διαθέσιμο ανθρώπινο δυναμικό για βοήθεια στη διδασκαλία του μαθήματος?";  
$info2Say[] = "Υπάρχει διαθέσιμο ανθρώπινο δυναμικό καθώς και υλικοτεχνική υποδομή.";  
$titreBloc[] = "Τρόποι αξιολόγησης / εξέτασης";  
$titreBlocNotEditable[] = TRUE;  
$questionPlan[] = "Με ποιο τρόπο θα γίνει η εξέταση του μαθήματος?";  
$info2Say[] = "Η εξέταση θα γίνει με προφορικές και γραπτές εξετάσεις.";  

?>
