<?
$langCodeF="Κωδικός";

$langListFaculte="Κατάλογος Σχολών / Τμημάτων - Ενέργειες";
$langCodeFaculte1="Κωδικός Σχολής / Τμήματος";
$langCodeFaculte2="(με λατινικούς χαρακτήρες μόνο, π.χ. MATH)";
$langAddFaculte="Προσθήκη Σχολών / Τμημάτων";
$langFaculte1="Σχολή / Τμήμα";
$langFaculte2="(π.χ. Μαθηματικό)";
$langAddYes="Προσθήκη";

$langAddSuccess="Η εισαγωγή πραγματοποιήθηκε με επιτυχία !";
$langNoSuccess="Πρόβλημα κατά την εισαγωγή των στοιχείων !";

$langProErase="Υπάρχουν διδασκόμενα μαθήματα στο τμήμα αυτό !";
$langNoErase="Η διαγραφή του τμήματος δεν είναι δυνατή.";
$langErase="Το τμήμα διαγράφτηκε!";
$langBackToIndex="Επιστροφή";

$langFCodeExists= "Ο κωδικός που βάλατε υπάρχει ήδη! Δοκιμάστε ξανά επιλέγοντας διαφορετικό";
$langFaculteExists="Η σχολή / τμήμα που βάλατε υπάρχει ήδη! Δοκιμάστε ξανά επιλέγοντας διαφορετικό";
$langEmptyFaculte="Αφήσατε κάποιο από τα πεδία κενά! Δοκιμάστε ξανά";

$langGreekCode="Ο κωδικός που βάλατε περιέχει μη λατινικούς χαρακτήρες!. Δοκιμάστε ξανά επιλέγοντας διαφορετικό";

?>
