<?

$infoprof="Σύντομα θα σας σταλεί e-mail από την Ομάδα Διαχείρισης της Πλατφόρμας Ασύγχρονης Τηλεκπαίδευσης e-class, με τα στοιχεία του λογαριασμού σας.";

$profinfo="Η ηλεκτρονική πλατφρόρμα GUNET e-Class διαθέτει 2 εναλλακτικούς τρόπους εγγραφής διδασκόντων";
$userinfo="Η ηλεκτρονική πλατφόρμα GUNET e-Class διαθέτει 2 εναλλακτικούς τρόπους εγγραφής χρηστών:";
$regprofldap="Εγγραφή διδασκόντων που έχουν λογαριασμό στην Υπηρεσία Καταλόγου (LDAP Directory Service) του ιδρύματος που ανήκουν";
$regldap="Εγγραφή χρηστών που έχουν λογαριασμό στην Υπηρεσία Καταλόγου (LDAP Directory Service) του ιδρύματος που ανήκουν";
$regprofnoldap="Εγγραφή διδασκόντων που δεν έχουν λογαριασμό στην Υπηρεσία Καταλόγου του ιδρύματος που ανήκουν";
$regnoldap="Εγγραφή χρηστών που δεν έχουν λογαριασμό στην Υπηρεσία Καταλόγου του ιδρύματος που ανήκουν";

$mailbody1="\nΠανελλήνιο Ακαδημαϊκό Δίκτυο GUNet\n\n";
$mailbody2="Ο Χρήστης\n\n";
$mailbody3="επιθυμεί να έχει πρόσβαση ";
$mailbody4="στην υπηρεσία Ασύγχρονης Τηλεκπαίδευσης ";
$mailbody5="του GUNet ";
$mailbody6="σαν καθηγητής.";
$mailbody7="Σχολή / Τμήμα:";

$logo= "e-class Πλατφόρμα Ασύγχρονης Τηλεκπαίδευσης GUNet";
$introcontact = "Μπορείτε να επικοινωνείτε με την Ομάδα Υποστήριξης της Πλατφόρμας GUNet e-Class με τους παρακάτω τρόπους:";
$contact="<b>Ταχυδρομική Διεύθυνση:</b>";
$contact2="Ακαδημαϊκό Διαδίκτυο GUNet";
$contact3="Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών";
$contact4="Κέντρο Λειτουργίας και Διαχείρισης Δικτύου";
$contact5="Πανεπιστημιούπολη, Ιλίσια, 15784";
$contact6="<b>Τηλ:</b> +30 210 7275611";
$contact7="<b>Fax:</b> +30 210 7275601";
$contact8="teledu@gunet.gr";
$contact9="(Υπόψη Ομάδας Ασύγχρονης Τηλεκπαίδευσης)";

$gunet="Ομάδα Ασύγχρονης Τηλεκπαίδευσης GUNet";

$sendinfomail="Αποστολή ενημερωτικού e-mail στους καθηγητές του e-Class";
$infoabouteclass="Ενημερωτικό δελτίο πλατφόρμας e-Class";

?>
