<?php
/* ========================================================================
 * Open eClass 2.4
 * E-learning and Course Management System
 * ========================================================================
 * Copyright 2003-2011  Greek Universities Network - GUnet
 * A full copyright notice can be read in "/info/copyright.txt".
 * For a full list of contributors, see "credits.txt".
 *
 * Open eClass is an open platform distributed in the hope that it will
 * be useful (without any warranty), under the terms of the GNU (General
 * Public License) as published by the Free Software Foundation.
 * The full license can be read in "/info/license/license_gpl.txt".
 *
 * Contact address: GUnet Asynchronous eLearning Group,
 *                  Network Operations Center, University of Athens,
 *                  Panepistimiopolis Ilissia, 15784, Athens, Greece
 *                  e-mail: info@openeclass.org
 * ======================================================================== */


$langWindowClose="Κλείσιμο παραθύρου";

$langHDefault='Βοήθεια μη διαθέσιμη';
$langDefaultContent='<p>Δεν υπάρχει κείμενο βοήθειας για την περιοχή
της πλατφόρμας στην οποία βρίσκεστε.</p>';


// PHPMATHPUBLISHER: HELP
$langPHPMathPublisher="<p><b>Υποστήριξη μαθηματικών συμβόλων</b></p>

<p>Για την ενσωμάτωση μαθηματικών συμβόλων στα κείμενα σας, μπορείτε να χρησιμοποιείτε τις <a href=\"../../manuals/PhpMathPublisherHelp.pdf\" target=\"_blank\">εντολές</a> (συμβολισμούς) που παρέχει το PhpMathPublisher.
Πιο αναλυτικά, χρησιμοποιήστε τον συντάκτη κειμένου για να εισάγετε το περιεχόμενό σας. Αν στο περιεχόμενο που εισάγετε υπάρχουν μαθηματικά σύμβολα που επιθυμείτε να εμφανίσετε, τότε:</p>
<ol>
  <li>Κάντε κλικ στο εικονίδιο 'Μετάβαση σε κώδικα HTML'.</li>
  <li>Εισάγετε το μαθηματικά σύμβολα σας μεταξύ των tags &lt;m>.....&lt;/m></li>
</ol>
<p>Π.χ. για να εισαγάγετε την τετραγωνική ρίζα του a πληκτρολογήστε &lt;m>sqrt{a}&lt;/m></p>";


// ================== help_forums.php new ==================================
$langHFor="Περιοχές συζητήσεων";
$langHFor_student=$langHFor;
$langForContent="<p>Το υποσύστημα ‘Περιοχές Συζητήσεων’ επιτρέπει την ασύγχρονη γραπτή επικοινωνία μεταξύ εκπαιδευόμενων και εκπαιδευτών. Οι προαναφερόμενοι χρήστες μπορούν να ανοίξουν ένα νέο θέμα προς ζήτηση, να απαντήσουν σε ήδη υπάρχον θέμα  και να τροποποιήσουν ένα συγκεκριμένο θέμα. Με αυτό τον τρόπο πραγματοποιείται ένα είδος εκτεταμένης ανταλλαγής πληροφοριών πάνω στο γνωστικό αντικείμενο το οποίο πραγματεύεται το συγκεκριμένο μάθημα.</p>
<p>Για να δημιουργήσετε μια νέα περιοχή συζητήσεων πρέπει πρώτα να την εντάξετε σε μια κατηγορία. Μέσω του συνδέσμου ‘Προσθήκη κατηγορίας’ μπορείτε να εισάγετε μια νέα κατηγορία. Εν συνεχεία δίνετε τον τίτλο και πατώντας στον κουμπί προσθήκη η νέα κατηγορία είναι ενεργή. Για να εισάγετε μια νέα περιοχή συζητήσεων σε συγκριμένη κατηγορία επιλέξτε το κουμπί (<img src='$themeimg/add.png' width=16
 height=16>)το οποίο βρίσκεται δεξιά της επιλεγμένης κατηγορίας. Για την ολοκλήρωση της διαδικασίας δώστε τον τίτλο και μια περιγραφή για την περιοχή συζητήσεων  και πατήστε το κουμπί προσθήκη.</p>
<hr>
<p><b>Υποστηριζόμενες ενέργειες των περιοχών συζητήσεων</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα 'Περιοχές συζητήσεων' είναι οι εξής:
<ul>
  <li>Προσθήκη μιας νέας περιοχής συζητήσεων. Μέσω του κουμπιού  (<img src='$themeimg/add.png' width=16 height=16>)μπορείτε να εισάγεται μια νέα περιοχή συζητήσεων </li>
  <li>Αλλαγή μιας περιοχής συζητήσεων. Πατώντας το κουμπί <img src='$themeimg/edit.png' width=16 height=16> σας  δίνετε η δυνατότητα να τροποποιήσετε μια υπάρχουσα περιοχή συζητήσεων</li>
  <li>Διαγραφή μιας περιοχής συζητήσεων. Μέσω του κουμπιού (<img src='$themeimg/delete.png' width=16 height=16>) μπορείτε να διαγράψετε μια υπάρχουσα περιοχή συζητήσεων.</li>
  <li>Ειδοποίηση μέσω e-mail εάν σταλούν απαντήσεις. Πατώντας το κουμπί (<img src='$themeimg/email.png' width=16 height=16>) σας δίνετε η δυνατότητα της ειδοποίησης μέσω email για την ανάρτηση συζητήσεων της συγκριμένης κατηγορίας.</li> 
  </ul>
";
//=============================================================================




$langFor_studentContent= " 
<p>Το υποσύστημα ‘Περιοχές Συζητήσεων’ επιτρέπει την <b>ασύγχρονη</b> γραπτή επικοινωνία μεταξύ εκπαιδευόμενων και εκπαιδευτή. Σε ένα ήδη υπάρχον θέμα συζήτησης μπορείτε να δώσετε την απάντηση σας συμμετέχοντας με αυτό τον τρόπο στις συζητήσεις του μαθήματος. Για να γίνει αυτό πατήστε στην περιοχή συζητήσεων που επιθυμείτε. Εν συνεχεία πατήστε στο θέμα που σας ενδιαφέρει από την συγκεκριμένη ομάδα και έπειτα επιλέξτε το σύνδεσμο ‘Απάντηση’. Πληκτρολογήστε το κείμενο που θέλετε να εισαχθεί στην συγκεκριμένη συζήτηση και έπειτα πέστε το κουμπί ‘Υποβολή’.
</p>
<p>Για κάθε συζήτηση η πλατφόρμα σας παρέχει ένα σύνολο πληροφοριών όπως: το θέμα, ο αριθμός των αποστολών, η τελευταία χρονικά αποστολή. Μια χρήσιμη λειτουργία του συγκεκριμένου υποσυστήματος είναι η ειδοποίηση μέσω e-mail εάν σταλούν απαντήσεις. Πατώντας το κουμπί (<img src='$themeimg/email.png' width=16 height=16>) σας δίνετε η δυνατότητα της ειδοποίησης μέσω email για την ανάρτηση συζητήσεων της συγκριμένης κατηγορίας. </p>



" ;

$langHInit = "Αρχική Σελίδα";
$langInitContent = "<p class='helptopic'>Βρίσκεστε στην Αρχική Σελίδα της
πλατφόρμας Open eClass. Για να χρησιμοποιήσετε την πλατφόρμα πληκτρολογήστε το όνομα
χρήστη και το συνθηματικό σας. Αν δεν θυμάστε τα στοιχεία σας, κάντε κλικ στο
σύνδεσμο 'Ξεχάσατε το συνθηματικό σας' και στη φόρμα που θα σας εμφανιστεί,
συμπληρώστε την ηλεκτρονική σας διεύθυνση που δηλώσατε κατά την εγγραφή σας
στην πλατφόρμα για να σταλούν τα στοιχεία σας.</p>

<p class='helptopic'>Αν είστε φοιτητής και δεν έχετε λογαριασμό, κάντε κλικ στο
σύνδεσμο 'Εγγραφή Φοιτητή' για να αποκτήσετε. Αν θέλετε να αποκτήσετε
λογαριασμό με δικαιώματα 'εκπαιδευτή', κάντε κλικ στο σύνδεσμο 'Εγγραφή εκπαιδευτή'
για να συμπληρώσετε την 'Αίτηση Εγγραφής εκπαιδευτή'</p>

<p class='helptopic'>Για περισσότερες πληροφορίες σχετικά με τη λειτουργία της
πλατφόρμας διαβάστε τα σχετικά εγχειρίδια χρήσης.</p>";

$langHInit_student = $langHInit;
$langInit_studentContent = $langInitContent;

$langHPortfolio="Χαρτοφυλάκιο χρήστη";
$langPortfolioContent="<p>Σε αυτή τη σελίδα εμφανίζονται τα μαθήματα στα
οποία είστε εγγεγραμμένος (ως φοιτητής) ή έχετε δημιουργήσει (ως εκπαιδευτής).
Μπορείτε να παρακολούθησετε όποιο επιθυμείτε επιλέγοντας τον αντίστοιχο
τίτλο.</p>

<p>Μέσω των συνδέσμων του μενού, μπορείτε να εγγραφείτε σε άλλα μαθήματα ή
να απεγγραφείτε από αυτά που παρακολουθείτε, να αλλάξετε τα στοιχεία του
προφίλ σας όπως όνομα, συνθηματικό και προτιμώμενη γλώσσα, καθώς και
να δείτε συγκεντρωτικά τις ανακοινώσεις και το ημερολόγιο των μαθημάτων
σας.</p>
<p>Σε κάθε ενότητα, δίπλα σε κάθε μάθημα, στην στήλη ενέργειες, υπάρχει 
το εικονίδιο (<img style='border:0px;' src='template/classic/img/tools.png' width=16 height=16 align=basename></img>)
. Ανάλογα με τα προνόμια του χρήστη επιτρέπονται διαφορετικές λειτουργίες.
";
$langHPortfolio_student = $langHPortfolio;
$langPortfolio_studentContent = $langPortfolioContent;

$langHcourse_home='Κεντρική σελίδα μαθήματος';
$langHcourse_home_student=$langHcourse_home ;
$langcourse_home_studentContent='<p>Βρίσκεστε στην κεντρική σελίδα του
ηλεκτρονικού μαθήματος. Από τις επιλογές του μενού στο αριστερό μέρος της
οθόνης, μπορείτε να μεταβείτε στα υποσυστήματα που έχουν ενεργοποιηθεί από
τους διδάσκοντες του μαθήματος.</p>';

$langcourse_homeContent = '<p class="helptopic">Βρίσκεστε στην κεντρική σελίδα του ηλεκτρονικού μαθήματός σας. 
        Από τις επιλογές του μενού στο αριστερό μέρος της οθόνης, 
        μπορείτε να μεταβείτε στα υποσυστήματα του μαθήματος, στα οποία μπορείτε να προσθέσετε το εκπαιδευτικό 
        υλικό του μαθήματος. Τα ενεργά εργαλεία είναι διαθέσιμα και στους φοιτητές/επισκέπτες του μαθήματος, 
        ενώ τα ανενεργά εμφανίζονται μόνο στο διδάσκοντα.</p> <p class="helptopic">
        Από τα εργαλεία διαχείρισης μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε τα υποσυστήματα που επιθυμείτε, 
        να διαχειριστείτε τους εγγεγραμμένους χρήστες, να αλλάξετε διάφορες επιλογές του μαθήματος 
        (όπως τίτλο, έλεγχο πρόσβασης κτλ.) και να λάβετε στατιστικά χρήσης του μαθήματος.</p> 
        <p class="helptopic">Για να προσθέσουμε/αλλάξουμε τα στοιχεία του μαθήματος χρησιμοποιούμε 
        το εικονίδιο (<img src="$themeimg/edit.png" width=10 height=10 align=basename></img>) 
        και στη συνέχεια θα εμφανισθεί οθόνη για την εισαγωγή/αλλαγή των στοιχείων. 
        </p> <p class="helptopic"> Το μάθημα μπορεί να χωρισθεί σε θεματικές ενότητες 
        για την καλύτερη οργάνωση του μαθήματος. Για να δημιουργήσετε μια θεματική ενότητα 
        κάντε κλικ στον σύνδεσμο "Προσθήκη θεματικής ενότητας". Εάν έχουν προστεθεί ήδη 
        θεματικές ενότητες, τότε αυτές εμφανίζονται κάτω από τον τίτλο "Θεματικές ενότητες" 
        ενώ δίπλα τους υπάρχουν τα εικονίδια διόρθωσης, διαγραφής και αλλαγής ορατότητας (ορατό/αόρατο). 
        Αν οι θεματικές ενότητες είναι περισότερες από μία, τότε εμφανίζονται βελάκια για την αλλαγή της σειράς 
        εμφάνισής τους. Τα περιεχόμενα κάθε θεματικής ενότητας ορίζονται από ξεχωριστή οθόνη 
        που θα εμφανισθεί όταν επιλεγεί η κατάλληλη θεματική ενότητα.</p>';

// ==============  help_document updated =================
$langHDoc="Έγγραφα";
$langHDoc_student=$langHDoc;
$langDocContent="<p>Το υποσύστημα '‘Έγγραφα' είναι ένα σημαντικό εργαλείο το οποίο βοηθά τον εκπαιδευόμενο σημαντικά στην κατανόηση του γνωστικού αντικειμένου του  μαθήματος  μέσω  της παροχής του εκπαιδευτικού υλικού.
Μπορείτε να ανεβάσετε αρχεία οποιουδήποτε τύπου (HTML, Word, Powerpoint,
Excel, Acrobat, Flash, Quicktime, κ.λπ.). Ο μόνος σας περιορισμός είναι ότι οι
εκπαιδευόμενοι πρέπει να έχουν εγκατεστημένη στον υπολογιστή τους την αντίστοιχη
εφαρμογή για να τα διαβάσουν.</p>
<p>Μια σειρά βασικών ενεργειών παρέχονται από το υποσύστημα ‘ ‘Έγγραφα’.  </p>

<h4>Ανέβασμα ενός αρχείου</h4>
<ul>
  <li>Πατήστε στο σύνδεσμο 'Ανέβασμα αρχείου στον εξυπηρέτη'. Κατόπιν, στην φόρμα που θα σας εμφανιστεί, χρησιμοποιήστε το κουμπί 'Browse' για να επιλέξετε το αρχείο στον υπολογιστή σας
   </li>
<li>Ολοκληρώστε το ανέβασμα κάνοντας πατώντας στο κουμπί 'Ανέβασμα'.</li>
</ul>
<h4>Διαγραφή ενός αρχείου (ή καταλόγου)</h4>
<ul>
<li>Πατήστε στο εικονίδιο 'Διαγραφή' (<img src='$themeimg/delete.png' width=10 height=10>)</li>
</ul>
<h4>Κατέβασμα όλου του καταλόγου</h4>
<ul>
  <li>Εάν επιθυμείτε να αποθηκεύσετε στον υπολογιστή σας όλο τον κατάλογο των εγγράφων του μαθήματος μπορείτε να πατήσετε το κουμπί (<img src='$themeimg/save_s.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του αρχικού καταλόγου. Για να αποθηκεύσετε μόνο ένα συγκεκριμένο κατάλογο πατήστε τον ίδιο τύπο κουμπιού το οποίο όμως αυτή την φορά βρίσκεται δεξιά του καταλόγου που επιθυμείτε.</li>
  </ul>
  </ul>
<h4>Μετακίνηση ενός αρχείου (ή καταλόγου)</h4>
    <ul>
      <li>Πατήστε στο εικονίδιο 'Μετακίνηση' (<img src='$themeimg/move.png'
 width=10 height=10 align=basename>)
        </li>
      <li>Επιλέξτε τον κατάλογο μέσα στον οποίο θέλετε να μετακινήσετε το έγγραφο (ή το κατάλογο) (σημείωση: ο χαρακτηρισμός 'αρχικό κατάλογο' σημαίνει ότι δεν μπορείτε να πάτε πάνω από αυτό το επίπεδο στο δέντρο αρχείων του εξυπηρέτη).</li>
      <li>Επιβεβαιώστε το κάνοντας πατώντας 'Μετακίνηση'.</li>
    </ul> 

<h4>Μετονομασία ενός αρχείου (ή ένα κατάλογου)</h4>
<ul>
  <li>Πατήστε στο εικονίδιο 'Μετονομασία' (<img src='$themeimg/rename.png' width=16 height=16
>)</li>
  <li>Πληκτρολογήστε το καινούριο όνομα στο πεδίο (πάνω αριστερά)</li>
  <li>Επιβεβαιώστε το κάνοντας κλικ στο κουμπί 'Μετονομασία'</li>
</ul>
    <h4>Προσθήκη ή τροποποίηση σχολίου σε ένα αρχείο (ή σε ένα κατάλογο)</h4>
    <ul>
  <li>Πατήστε στο εικονίδιο 'Σχόλιο' (<img src='$themeimg/comment_edit.png' width=16
 height=16>)
    στη στήλη </li>
      <li>Πληκτρολογήστε καινούριο σχόλιο στο αντίστοιχο πεδίο (πάνω δεξιά).</li>
      </ul>
    <h4>Μετατροπή αρχείου (ή καταλόγου) σε αόρατο για τους εκπαιδευόμενους</h4>
    <ul>
  <li>Πατήστε στο εικονίδιο 'Ορατό/Αόρατο' (<img src='$themeimg/visible.png' width=10 height=10>)
</li>
   <li>Μετά την παραπάνω ενέργεια το αρχείου (ή κατάλογο) θα υπάρχει αλλά δεν θα είναι ορατό από τους εκπαιδευόενους.</li>
  <li>Για να το κάνετε αόρατο ξανά, κάντε κλικ στο εικονίδιο 'Ορατό/Αόρατο' (<img src='$themeimg/invisible.png' width=14 height=10>)
  </li>
    </ul>
    <hr>
    <h4><b>Δημιουργήστε ένα κατάλογο</b></h4>
	<p>Μπορείτε να οργανώσετε το περιεχόμενό σας σε καταλόγους. Για να δημιουργήσετε ένα κατάλογο: </p>
    <ul>
      <li>Πατήστε στο σύνδεσμο 'Δημιουργία ενός καταλόγου'</li>
      <li>Πληκτρολογήστε το όνομα του καινούριου σας καταλόγου στο αντίστοιχο πεδίο</li>
      <li>Μετά κάντε κλικ στην 'Δημιουργία καταλόγου.</li>
    </ul>
    <hr>    
    <h4><b>Επισκόπιση αποθηκευτικού χώρου</b></h4>
	<p>Μπορείτε να βλέπετε τον διαθέσιμο χώρο σας</p>
    <ul>
      <li>Πατήστε στο σύνδεσμο 'Επισκόπιση αποθηκευτικού χώρου'</li>
      <li>Εμφανίζεται πίνακας με τον χρησιμοποιούμενο χώρο, το ποσοστό χρήσης, και τον συνολικά διαθέσιμο χώρο.</li>
    </ul>    
      </p>
    <p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τα Έγγραφα από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langDoc_studentContent="<p>Το υποσύστημα 'Έγγραφα' είναι ένα σημαντικό εργαλείο το οποίο σας βοηθά στην <b>κατανόηση</b> του γνωστικού αντικειμένου του μαθήματος μέσω της παροχής εκπαιδευτικού υλικού. Μπορείτε να 'κατεβάσετε' αρχεία ή καταλόγους οποιασδήποτε μορφής (HTML, Word, Powerpoint, Excel, Acrobat, Flash, Quicktime, κ.λπ.). Ο μόνος σας <b>περιορισμός</b> είναι ότι πρέπει να έχετε εγκατεστημένη στον υπολογιστή σας την αντίστοιχη εφαρμογή για να μπορέσετε να τα διαβάσετε/αναπαραγάγετε τα αντίστοιχα αρχεία. Στο συγκεκριμένο υποσύστημα μπορείτε να ‘κατεβάσετε’ και τα αρχεία του υποσυστήματος ‘Τηλεσυνεργασία’ τα οποία είναι της μορφής π.χ chat.2011-11-24-573.txt και περιέχουν όλα τα ανταλλασσόμενα μηνύματα μεταξύ εκπαιδευτή και εκπαιδευόμενων. Η συγκεκριμένη λειτουργία θα πρέπει να έχει γίνει από τον εκπαιδευτή του μαθήματος και αποδεικνύεται αρκετά χρήσιμη στην περίπτωση κατά την οποία δεν μπορέσατε να συμμετάσχετε στην ‘Τηλεσυνεργασία΄ της αντίστοιχης ημερομηνίας.</p>
<h4>Κατέβασμα όλου του καταλόγου</h4>

<p>Εάν επιθυμείτε να αποθηκεύσετε στον υπολογιστή σας <b>όλο</b> τον κατάλογο των εγγράφων του μαθήματος μπορείτε να πατήσετε το κουμπί (<img src='$themeimg/save_s.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του αρχικού καταλόγου. Για να αποθηκεύσετε μόνο ένα συγκεκριμένο κατάλογο πατήστε τον ίδιο τύπο κουμπιού το οποίο όμως αυτή την φορά βρίσκεται δεξιά του καταλόγου που επιθυμείτε.</p>
  
 
" ;


// Help_user.php
$langHUser="Διαχείριση Χρηστών";
$langUserContent="
<p>Το συγκεκριμένο υποσύστημα επιτρέπει την <b>διαχείριση</b> όλων των εγγεγραμμένων χρηστών της πλατφόρμας. Επίσης παρέχει και ένα σύνολο πληροφοριών σχετικά με: τον συνολικό αριθμό των εγγεγραμμένων χρηστών στην πλατφόρμα, τον αριθμό των εκπαιδευτών, τον αριθμό των εκπαιδευομένων και τον αριθμό των επισκεπτών.</p>
<p>Μέσω του συνδέσμου ‘Προσθήκη’ έχετε στα χέρια σας ένα σύνολο επιλογών σχετικά με:</p>
<ul>
<li><b>Προσθήκη ενός χρήστη.</b> Μπορείτε να προσθέσετε ένα χρήστη δίνοντας το όνομα και το επώνυμο του ή το username του.</li>
<li><b>Προσθήκη πολλών χρηστών.</b>Μέσω της συγκεκριμένης επιλογής  μπορείτε να προσθέσετε  ‘μαζικά’  χρήστες.</li>
<li><b>Προσθήκη χρήστη επισκέπτη</b>. Εάν θέλετε να προσθέσετε ένα επισκέπτη χρήστη απλά δώστε το συνθηματικό το οποίο θα έχει ο επισκέπτης χρήστης του συστήματος.</li>
<li><b>Αναζήτηση Χρήστη</b>. Μπορείτε να αναζητήσετε ένα εγγεγραμμένο χρήστη εισάγοντας το όνομα και το επώνυμο  ή το username του.</li>
<li><b>Διαχείριση ομάδας χρηστών</b>.Ένα σύνολο ενεργειών (δημιουργία, διαγραφή, συμπλήρωση όλων, εκκαθάριση όλων) που αφορούν τις ομάδες χρηστών είναι στην διάθεση σας επιλέγοντας την συγκεκριμένη λειτουργία.</li>
</ul>
<hr>
<p><b>Διαχείριση ρόλων</b></p>
<p>Ένα σύνολο <b>δικαιωμάτων</b> παρέχονται από την πλατφόρμα σχετικά με την διαχείριση των χρηστών. Μεταξύ των άλλων:</p>
<ul>
 <li><img src='$themeimg/teacher_add.png' width=24 height=16> Προσθήκη δικαιώματος εκπαιδευτή. Ως εκπαιδευτής του μαθήματος μπορείτε να καθορίστε τα δικαιώματα των άλλων χρηστών καθώς και τις διάφορες παραμέτρους του μαθήματος.</li>
 <li><img src='$themeimg/assistant_add.png' width=24 height=16> Προσθήκη δικαιώματος βοηθού εκπαιδευτή. Κύρια αρμοδιότητα του είναι η ενεργοποίηση/απενεργοποίηση εργαλείων καθώς και το ‘ανέβασμα’ στο μάθημα όλων των απαραίτητων εγγράφων. Η παραχώρηση αυτού του δικαιώματος λειτουργεί υποστηρικτικά προς τον εκπαιδευτή του μαθήματος.  </li>
 <li><img src='$themeimg/group_manager.png' width=16 height=16> Προσθήκη δικαιώματος υπεύθυνου Ομάδας. Ως υπεύθυνος ομάδας μπορείτε να καθορίσετε τους χρήστες οι οποίοι θα απαρτίζουν την ομάδα καθώς και μια σειρά παραμέτρων οι οποίες σχετίζονται με αυτή.</li>
</ul> 
<hr>
<p>Το συγκεκριμένο υποσύστημα σας παρέχει την δυνατότητα να “Απεγγραφείτε” από ένα μάθημα. Για την διαδικασία της  “Απεγγραφής” από μάθημα πατήστε το κουμπί <img src='$themeimg/cunregister.png' width=16 height=16>.</p>
";

// Help guest user
$langHGuest = "Χρήστη Επισκέπτης";
$langGuestContent = "<p>Επιλέγοντας 'Προσθήκη χρήστη Επισκέπτη' σας δίνετε η δυνατότητα να δημιουργήσετε ένα χρήστη επισκέπτη, τα στοιχεία του οποίου θα γνωστοποιήσετε στους χρήστες οι οποίοι είναι εγγεγραμμένοι στο μάθημα (ή στην πλατφόρμα). Ένας χρήστης επισκέπτης, έχει τη δυνατότητα να βλέπει την αρχική σελίδα του μαθήματος στο οποίο είναι γραμμένος και όλα τα εργαλεία που είναι ενεργοποιημένα, αλλά δεν μπορεί να εκτελέσει λειτουργίες όπως να ανεβάσει εργασίες.</p>";

// ========= Help questionnaire updated ==========================
$langHQuestionnaire="Ερωτηματολόγιο";
$langHQuestionnaire_student=$langHQuestionnaire ;
$langQuestionnaireContent="<p>Το εργαλείο των Ερωτηματολογίων σας επιτρέπει
την <b>δημιουργία</b> τόσο ερωτήσεων 'Πολλαπλής επιλογής' όσο και ερωτήσεων 'Συμπλήρωσης κενού'.
Για να δημιουργήσετε ένα ερωτηματολόγιο πατήστε στο σύνδεσμο 'Δημιουργία Ερωτηματολογίου'. Στην οθόνη που εμφανίζεται συμπληρώστε τον τίτλο του και το χρονικό διάστημα για το οποίο θα είναι ενεργό το ερωτηματολόγιο σας. Εν συνεχεία επιλέξτε τον τύπο ερωτήσεων που επιθυμείτε πατώντας σε ένα από τους συνδέσμους 'Νέα ερώτηση πολλαπλής επιλογής' ή 'Νέα ερώτηση συμπλήρωσης κενού'. Η διαδικασία ολοκληρώνεται πατώντας 'Δημιουργία Ερωτηματολογίου'.</br>
<p><img src='$themeimg/warning.png' width=18 height=18> <b>Επισήμανση</b>: Εάν σε ένα ενεργό ερωτηματολόγιο έχει απαντηθεί  έστω και μια ερώτηση από έναν εκπαιδευόμενο η διαδικασία της διόρθωσης του συγκεκριμένου ερωτηματολογίου επιτυγχάνεται με την δημιουργία ενός “νέου” (του διορθωμένου). Αυτή η αυτόματη από την πλατφόρμα διαδικασία εξασφαλίζει την αξιοπιστία των αποτελεσμάτων των ερωτηματολογίων.</p>
</p>


<hr>
<p><b>Υποστηριζόμενες ενέργειες του υποσυστήματος 'Ερωτηματολόγιο'</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα 'Ερωτηματολόγιο'είναι οι εξής:
<ul>
  <li>Αλλαγή ενός ερωτηματολογίου. Για να τροποποιήσετε ένα ερωτηματολόγιο απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά του</li>
  <li>Διαγραφή ενός ερωτηματολογίου. Για να ένα ερωτηματολόγιο απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
  <li>Ορατό/Αόρατο. Για να είναι ή να μην είναι ορατό το ερωτηματολόγιό σας πατήστε στο κουμπί <img src='$themeimg/visible.png' width=16 height=16> το οποίο βρίσκεται δεξιά του. Η ενεργοποίηση της και πάλι γίνεται με την αντίστροφη διαδικασία.</li> 
  </ul>
  
";
//======================================================================


$langQuestionnaire_studentContent="<p>Το εργαλείο των Ερωτηματολογίων σας επιτρέπει την <b>υποβολή</b> απαντήσεων  τόσο σε ερωτήσεις  'Πολλαπλής επιλογής' όσο και σε ερωτήσεις 'Συμπλήρωσης κενού'. Για να απαντήσετε σε ένα ερωτηματολόγιο πατήστε επάνω στον τίτλο του. Στην οθόνη που εμφανίζεται παρουσιάζονται στοιχεία που αφορούν το συγκεκριμένο δραματολόγιο όπως: o τίτλος του, η ημερομηνία δημιουργίας, η έναρξη και λήξη του και το εάν έχετε συμμετάσχει σε αυτό η όχι. Απαντήστε σε όλες τις ερωτήσεις του ερωτηματολογίου και πατήστε το κουμπί ‘Υποβολή’ για την ολοκλήρωση της διαδικασίας.</br>
<img src='$themeimg/warning.png' width=18 height=18> Εάν σε ένα ενεργό ερωτηματολόγιο έχει απαντηθεί έστω και μια ερώτηση από έναν εκπαιδευόμενο η διαδικασία της διόρθωσης του συγκεκριμένου ερωτηματολογίου επιτυγχάνεται με την δημιουργία ενός “νέου” (του διορθωμένου). Αυτή η αυτόματη από την πλατφόρμα διαδικασία εξασφαλίζει την αξιοπιστία των αποτελεσμάτων των ερωτηματολογίων.
</p>" ;






//================  Help exercise new ==================================
$langHExercise="Ασκήσεις";
$langHExercise_student=$langHExercise ;
$langExerciseContent="<p>Το υποσύστημα των ασκήσεων βοήθα στην αυτοαξιολόγηση των εκπαιδευομένων σε μια σειρά ασκήσεων τις οποίες έχει δημιουργήσει ο εκπαιδευτής του μαθήματος. Στην αρχική σελίδα των ασκήσεων εμφανίζονται όλες οι ασκήσεις του μαθήματος και παρέχεται μια σειρά ενεργειών για την διαχείριση τους (Αλλαγή,Διαγραφή,Ορατή).<br>
<br>Οι τύποι των ερωτήσεων που μπορείτε να συμπεριλάβετε σε μια άσκηση είναι οι εξής:<br>
<ul>
  <li><a href='#syn7'>Πολλαπλής Επιλογής (Μοναδική Απάντηση)</a></li>
  <li><a href='#syn8'>Πολλαπλής Επιλογής (Πολλαπλές Απαντήσεις)</a></li>
  <li><a href='#syn9'>Ταίριασμα</a></li>
  <li><a href='#syn10'>Συμπλήρωμα κενών</a></li>
  <li><a href='#syn11'>Σωστό / Λάθος </a></li>
</ul>
<p>Για να δημιουργήσετε μια άσκηση αρχικά επιλέξτε το σύνδεσμο ‘Νέα άσκηση’. Εν συνεχεία πληκτρολογήστε τον τίτλο και την περιγραφή της άσκησης και καθορίστε μια σειρά παραμέτρων που σχετίζονται με την συγκεκριμένη άσκηση. Μεταξύ των άλλων μπορείτε να καθορίσετε τον τρόπο  που θα εμφανίζεται η άσκηση (σε μια σελίδα ή μια ερώτηση ανά σελίδα) αλλά και τον χρονικό περιορισμό στον οποίο υπόκειται (έναρξη – λήξη). Επίσης επιλέγετε τον αριθμό των επαναλήψεων που έχει στην διάθεση του ο εκπαιδευόμενος για να επαναλάβει την συγκεκριμένη άσκηση αλλά και το εάν μετά την ολοκλήρωση της άσκησης θα εμφανίζονται τόσο οι σωστές απαντήσεις όσο και η βαθμολογία του. Η διεργασία ολοκληρώνεται πατώντας στον σύνδεσμο ‘Δημιουργία’.</p>
<hr>
<p><b><a name='syn7'>Πολλαπλής Επιλογής (Μοναδική Απάντηση)</a></b><br><br>
Με την χρήση των ερωτήσεων 'Πολλαπλής επιλογής(Μοναδική Απάντηση)'
 ο εκπαιδευόμενος αναπτύσσει την ικανότητα της συνδυαστικής λογικής στην επίλυση προβλημάτων καθώς σειροθετεί και κατηγοριοποιεί τα αντικείμενα. Για την δημιουργία μιας ερώτησης ‘Πολλαπλής επιλογής (Μοναδική απάντηση)’ απλά πατήστε στο σύνδεσμο ‘Νέα ερώτηση’. Εν συνεχεία πληκτρολογήστε τον τίτλο και ένα σχόλιο σχετικά με την άσκηση. Η πλατφόρμα σας παρέχει την δυνατότητα να εισάγετε και φωτογραφίες μέσα στις ασκήσεις καθορίζοντας στην επιλογή ‘Προσθήκη εικόνας’ την τοποθεσία όπου βρίσκεται στον υπολογιστή σας (Browse). Επιλέξτε τον τύπο της άσκησης και πατήστε ‘Εντάξει’. Καθορίστε στην συνέχεια τις ερωτήσεις και προαιρετικά τον βαθμό (βάρος) της κάθε μιας. Τσεκάρετε την σωστή απάντηση και προσθέστε ή αφαιρέστε ερωτήσεις μέσω των ελεγκτηρίων +απ, -απ. Η διαδικασία ολοκληρώνεται πατώντας ‘Δημιουργία’. </p>
<hr>
<p><b><a name='syn8'>Πολλαπλής Επιλογής (Πολλαπλές Απαντήσεις)</a></b><br><br>
Με την χρήση των ερωτήσεων 'Πολλαπλής  επιλογής (Πολλαπλές  απαντήσεις)' ο εκπαιδευτής παρέχει στους εκπαιδευόμενους όλα εκείνα τα μέσα τα οποία απαιτούνται για να εργαστούν ‘μόνοι’ τους. Για την δημιουργία μιας ερώτησης 'Πολλαπλής επιλογής(Πολλαπλές απαντήσεις)' απλά πατήστε στο σύνδεσμο ‘Νέα ερώτηση’. Εν συνεχεία πληκτρολογήστε τον τίτλο και ένα σχόλιο σχετικά με την άσκηση. Η πλατφόρμα σας παρέχει την δυνατότητα να εισάγετε και φωτογραφίες μέσα στις ασκήσεις καθορίζοντας στην επιλογή ‘Προσθήκη εικόνας’ την τοποθεσία όπου βρίσκεται στον υπολογιστή σας (Browse). Επιλέξτε τον τύπο της άσκησης και πατήστε ‘Εντάξει’. Καθορίστε στην συνέχεια τις ερωτήσεις και προαιρετικά τον βαθμό (βάρος) της κάθε μιας. Τσεκάρετε τις σωστές απαντήσεις και προσθέστε η αφαιρέστε ερωτήσεις μέσω των ελεγκτηρίων +απ, -απ. Η διαδικασία ολοκληρώνεται πατώντας ‘Δημιουργία’. </p>
<hr>
<p><b><a name='syn9'>Ταίριασμα</a></b><br><br>
Στις ασκήσεις ταιριάσματος ο εκπαιδευόμενος μπορεί να συνδυάσει στοιχεία από δυο σύνολα (στήλη Α και στήλη Β) με βάση τα οποία θα προκύψει η σωστή απάντηση. Για την δημιουργία μιας ερώτησης πολλαπλής επιλογής απλά πατήστε στο σύνδεσμο ‘Νέα ερώτηση’. Εν συνεχεία πληκτρολογήστε τον τίτλο και ένα σχόλιο σχετικά με την άσκηση. Η πλατφόρμα σας παρέχει την δυνατότητα να εισάγετε και φωτογραφίες μέσα στις ασκήσεις καθορίζοντας στην επιλογή ‘Προσθήκη εικόνας’ την τοποθεσία όπου βρίσκεται στον υπολογιστή σας (Browse). Επιλέξτε στον τύπο άσκησης ‘Ταίριασμα’ και στην συνέχεια ‘Εντάξει’. Έπειτα καθορίστε τα στοιχεία της στήλης Α και της στήλης Β και στα πλαίσια λίστας τιμών επιλέξτε την αντιστοιχία της στήλης Α με την Β. Η προσθήκη η αφαίρεση ερωτήσεων επιτυγχάνεται μέσω των ελεγκτηρίων +απ, -απ. Η διαδικασία ολοκληρώνεται πατώντας ‘Δημιουργία’. </p>
<hr>
<p><b><a name='syn10'>Συμπλήρωμα κενών</a></b><br><br>
Οι ερωτήσεις αυτού του τύπου έχουν ως σκοπό να βρουν οι εκπαιδευόμενοι τις λέξεις που λείπουν μέσα σε ένα κείμενο. Για την δημιουργία μιας ερώτησης με κενά απλά πατήστε στο σύνδεσμο ‘Νέα ερώτηση’. Εν συνεχεία πληκτρολογήστε τον τίτλο και ένα σχόλιο σχετικά με την άσκηση. Η πλατφόρμα σας παρέχει την δυνατότητα να εισάγετε και φωτογραφίες μέσα στις ασκήσεις καθορίζοντας στην επιλογή ‘Προσθήκη εικόνας’ την τοποθεσία όπου βρίσκεται στον υπολογιστή σας (Browse). Επιλέξτε στον τύπο άσκησης ‘Κενά’ και στην συνέχεια ‘Εντάξει’. Γράψτε το κείμενο που επιθυμείτε και τις λέξεις οι οποίες θα πρέπει να συμπληρωθούν από τους εκπαιδευόμενους απλά συμπεριλάβετε αυτές μέσα σε [ ]. Η διαδικασία ολοκληρώνεται πατώντας ‘Επικύρωση’. </p>
<hr>
<p><b><a name='syn11'>Σωστό/Λάθος</a></b><br><br>
Σε αυτού του τύπου τις ερωτήσεις οι εκπαιδευόμενοι επιλέγουν μεταξύ δυο απαντήσεων σε μια συγκεκριμένη ερώτηση. Μια μόνο απάντηση είναι σωστή και η άλλη λάθος. Μέσω των ερωτήσεων ερωτήσεων 'Σωστό/Λάθος' ο εκπαιδευτής μπορεί μέσα από μια σύντομη διαδικασία να εξετάσει τις γνώσεις του εκπαιδευόμενου πάνω στο συγκεκριμένο γνωστικό αντικείμενο. Για την δημιουργία μιας ερώτησης 'Σωστό/Λάθος' απλά πατήστε στο σύνδεσμο ‘Νέα ερώτηση’. Εν συνεχεία πληκτρολογήστε την ερώτηση και προαιρετικά ένα σχόλιο σχετικά με αυτήν και πατήστε ‘Εντάξει’. Στην επόμενη οθόνη δώστε τις δυο απαντήσεις και τσεκάρετε το αντίστοιχο ελεγκτήριο με την σωστή απάντηση. Η διαδικασία ολοκληρώνεται πατώντας ‘Δημιουργία’.  </p>
<hr>
<p><b>Υποστηριζόμενες ενέργειες ασκήσεων</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα των ασκήσεων είναι οι εξής:
<ul>
  <li>Αλλαγή μιας άσκησης. Για να τροποποιήσετε μια άσκηση απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά της</li>
  <li>Διαγραφή μιας άσκησης. Για να διαγράψετε μια άσκηση απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά της</li>
  <li>Ορατή/Αόρατη. Για να είναι ή να μην είναι ορατή η άσκηση σας πατήστε στο κουμπί <img src='$themeimg/visible.png' width=16 height=16> το οποίο βρίσκεται δεξιά της. Η ενεργοποίηση της και πάλι γίνεται με την αντίστροφη διαδικασία.</li> 
  <li>Επαναχρησιμοποίηση ερώτησης από άλλη άσκηση. Μπορείτε να επαναχρησιμοποιήσετε την ερώτηση σε άλλη άσκηση πατώντας αρχικά στο σύνδεσμο 'Αλλαγή'  και έπειτα στον σύνδεσμο ‘Ερώτηση από άλλη άσκηση'</li>
  <li>Εμφάνιση ασκήσεων με τυχαία σειρά. Κατά τη διαδικασία δημιουργίας μιας άσκησης τσεκάρετε το ελεγκτήριο ελέγχου (checkbox) ‘τυχαία σειρά’  και καθορίστε τον αριθμό των ερωτήσεων που θα εμφανίζονται στην άσκηση. Αυτή η δυνατότητα προτείνεται για τις εξετάσεις του μαθήματος</li>
  </ul>
 <hr> 
 <p><b>Βαθμολόγηση Ασκήσεων</b><br><br>
 Δεξιά από κάθε δημιουργημένη ερώτηση υπάρχει ένα ‘βάρος’ το οποίο αντιστοιχεί στην βαθμολόγηση της συγκριμένης ερώτησης. Οι υποστηριζόμενες τιμές της πλατφόρμας για την βαθμολόγηση των ερωτήσεων είναι: θετική βαθμολόγηση, αρνητική βαθμολόγηση και μηδενική. Η αρνητική βαθμολόγηση έχει νόημα μόνο στις κατηγορίες ‘Πολλαπλής επιλογής (μοναδική απάντηση)’ και ‘Πολλαπλής επιλογής (πολλαπλές απαντήσεις)’. Το άθροισμα των εν δυνάμει σωστών  απαντήσεων (δηλαδή όλων των θετικών βαρών) μας δίνει το άριστα.
 
 </p>
  
";
$langExercise_studentContent="<p>Το υποσύστημα των ασκήσεων βοήθα στην αυτοαξιολόγηση σας σε μια σειρά ασκήσεων τις οποίες έχει δημιουργήσει ο εκπαιδευτής του μαθήματος. Στην αρχική σελίδα των ασκήσεων εμφανίζονται όλες οι ασκήσεις του μαθήματος και απαιτείται ιδιαίτερη προσοχή όσων αφορά: τις ημερομηνίες έναρξης και λήξης μιας άσκησης, τον χρονικό περιορισμό της καθώς και τον αριθμό των επαναλήψεων που μπορείτε να την εκτελέσετε. Για να εκτελέσετε μια άσκηση απλά <b>πατήστε</b> επάνω στο όνομά της.</br>
<br>Οι τύποι των ερωτήσεων που μπορείτε να εκτελέσετε σε μια άσκηση είναι οι εξής:<br>
<ul>
  <li><a href='#syn7'>Πολλαπλής Επιλογής (Μοναδική Απάντηση)</a></li>
  <li><a href='#syn8'>Πολλαπλής Επιλογής (Πολλαπλές Απαντήσεις)</a></li>
  <li><a href='#syn9'>Ταίριασμα</a></li>
  <li><a href='#syn10'>Συμπλήρωμα κενών</a></li>
  <li><a href='#syn11'>Σωστό / Λάθος </a></li>
</ul>
<hr>
<p><b><a name='syn8'>Πολλαπλής Επιλογής (Μοναδική Απάντηση)</a></b><br><br>
Με την χρήση των ερωτήσεων 'Πολλαπλής επιλογής(Μοναδική Απάντηση)' σας δίνεται η δυνατότητα της περεταίρω ανάπτυξης της συνδυαστικής λογικής στην επίλυση προβλημάτων καθώς πραγματοποιείται κατηγοριοποίηση των αντικείμενων. Επιλέξτε μια άσκηση και απαντήστε στις ερωτήσεις που περιέχει. Κάθε ερώτηση περιέχει <b>μια</b> μοναδική απάντηση. Για την μετάβαση από μια οθόνη ερωτήσεων σε άλλη πατήστε τον σύνδεσμο ‘Συνέχεια’ (ή ‘Ακύρωση’ αντίστοιχα). Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο ‘Τέλος’.
<hr>

<p><b><a name='syn8'>Πολλαπλής Επιλογής (Πολλαπλές Απαντήσεις)</a></b><br><br>
Με την χρήση των ερωτήσεων 'Πολλαπλής επιλογής (Πολλαπλές απαντήσεις)' ο εκπαιδευτής σας παρέχει όλα εκείνα τα μέσα τα οποία απαιτούνται για να εργαστείτε ‘μόνοι’ σας. Επιλέξτε μια άσκηση  και απαντήστε στις ερωτήσεις που περιέχει. Κάθε ερώτηση περιέχει <b>πολλαπλές</b> απαντήσεις. Για την μετάβαση από μια οθόνη ερωτήσεων σε άλλη πατήστε τον σύνδεσμο ‘Συνέχεια’ (ή ‘Ακύρωση’ αντίστοιχα). Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο ‘Τέλος’.

<hr>
<p><b><a name='syn9'>Ταίριασμα</a></b><br><br>
Στις ασκήσεις ταιριάσματος πρέπει να συνδυάσετε τα  στοιχεία από δυο σύνολα (στήλη Α και στήλη Β) με βάση τα οποία θα προκύψει η σωστή απάντηση. Για την μετάβαση από μια οθόνη ερωτήσεων σε άλλη πατήστε τον σύνδεσμο ‘Συνέχεια’ (ή ‘Ακύρωση’ αντίστοιχα). Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο ‘Τέλος’.
</p>

<hr>
<p><b><a name='syn10'>Συμπλήρωμα κενών</a></b><br><br>
Οι ερωτήσεις αυτού του τύπου έχουν ως σκοπό να βρείτε τις λέξεις που λείπουν μέσα στα κενά [ ] ενός κειμένου. Επιλέξτε μια άσκηση και συμπληρώστε τα κενά που περιέχει. Κάθε ερώτηση περιέχει πολλαπλές απαντήσεις. Για την μετάβαση από μια οθόνη ερωτήσεων σε άλλη πατήστε τον σύνδεσμο ‘Συνέχεια’ (ή ‘Ακύρωση’ αντίστοιχα). Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο ‘Τέλος’.</p>
<hr>

<p><b><a name='syn11'>Σωστό/Λάθος</a></b><br><br>
Σε αυτού του τύπου τις ερωτήσεις πρέπει να επιλέξετε μεταξύ δύο απαντήσεων σε μια συγκεκριμένη ερώτηση. Μια μόνο απάντηση είναι σωστή και η άλλη λάθος. Επιλέξτε μια άσκηση και σε κάθε ερώτηση δώστε απάντηση ‘Σωστό’ ή ‘Λάθος’.  Για την μετάβαση από μια οθόνη ερωτήσεων σε άλλη πατήστε τον σύνδεσμο ‘Συνέχεια’ (ή ‘Ακύρωση’ αντίστοιχα). Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο ‘Τέλος’.</p>

<hr> 
<p><b>Βαθμολόγηση Ασκήσεων</b><br><br>
Δεξιά από κάθε ερώτηση υπάρχει ένα ‘βάρος’ το οποίο αντιστοιχεί στην βαθμολόγηση της συγκριμένης ερώτησης. Οι υποστηριζόμενες τιμές της πλατφόρμας για την βαθμολόγηση των ερωτήσεων είναι: θετική βαθμολόγηση, αρνητική βαθμολόγηση και μηδενική. Η αρνητική βαθμολόγηση έχει νόημα μόνο στις κατηγορίες ‘Πολλαπλής επιλογής (μοναδική απάντηση)’ και ‘Πολλαπλής επιλογής (πολλαπλές απαντήσεις)’. Το άθροισμα των εν δυνάμει σωστών απαντήσεων (δηλαδή όλων των θετικών βαρών) μας δίνει το άριστα. 
</p>
" ;
//===============================================================================



//========= help work updated ======
$langHWork = "Εργασίες";
$langHWork_student = $langHWork ;
$langWorkContent = "<p>Το υποσύστημα 'Εργασίες' αποτελεί ένα ολοκληρωμένο σύστημα δημιουργίας και διαχείρισης εργασιών.</p>
<p>Ως εκπαιδευτής μπορείτε να δημιουργήσετε μια εργασία πατώντας στο σύνδεσμο <b>\"Δημιουργία Εργασίας\"</b>.
Συμπληρώστε τον τίλο της εργασίας και εν συνεχεία καθορίστε την ημερομηνία υποβολής. Προεραιτικά μπορείτε να προσθέστε και ένα
σχόλιο. Το συγκεκριμένο υποσύστημα περιέχει δυο τύπους εργασιών: ‘Ατομική’, ‘Ομαδική’. Εάν επιλέξετε ‘Ομαδική’ ως τύπο εργασίας θα πρέπει πρώτα να έχετε ενεργοποιήσει το υποσύστημα ‘Ομάδες Χρηστών’.</p>
<p>Όταν ολοκληρωθεί η δημιουργία της εργασίας, μην παραλείψετε να την ενεργοποιήσετε πατώντας 
στο εικονίδιο <img src=\"$themeimg/invisible.png\" border=\"0\" align=\"absmiddle\">. Η εργασία θα είναι ορατή και
προσβάσιμη από τους εκπαιδευόμενους μόνο όταν ενεργοποιηθεί. Μπορείτε ανά πάσα στιγμή να διορθώσετε την
εργασία πατώντας στο εικονίδιο <img src=\"$themeimg/edit.png\" border=\"0\" align=\"middle\"> ή να την
διαγράψετε πατώντας στο εικονίδιο (<img src=\"$themeimg/delete.png\" border=\"0\" align=\"middle\">).
Πατώντας πάνω στον τίτλο της εργασίας βλέπετε τις εργασίες που έχουν υποβληθεί από τους εκπαιδευόμενους.
Σε αυτό το σημείο είναι ορατά στοιχεία του εκπαιδευόμενου όπως: ο αριθμός μητρώου, η ημερομηνία υποβολής της εργασίας καθώς και το πηγαίο αρχείo της εργασίας. Μέσω της επιλογής \"Κατέβασμα όλων των εργασιών σε μορφή .zip \" σας δίνετε η δυνατότητα να \"κατεβάσετε\" όλα τα αρχεία της συγκεκριμένης εργασίας τα οποία έχουν
υποβάλλει οι εκπαιδευόμενοι.
Για να βαθμολογήσετε την εργασία συμπληρώστε τον αντίστοιχο βαθμό δίπλα στο όνομα του εκπαιδευόμενου και 
πατήστε στο σύνδεσμο <b>\"Υποβολή Βαθμολογίας\"</b>. Ο εκπαιδευόμενος έχει την δυνατότητα να δει τον βαθμό του πατώντας στον τίτλο της
εργασίας.</p>
<p>Όλες οι εργασίες του μαθήματος είναι ορατές μέσω του καταλόγου των εργασιών.
Ο συγκεκριμένος κατάλογος περιλαβάνει εκτός από τον τίτλο της εργασίας: την προθεσμία υποβολής,
την βαθμολογία από τον εκπαιδευτή και μια ένδειξη για το αν έχει στείλει εργασία ή όχι.
Για την υποβολή  της εργασίας πατήστε απλά πάνω στον τίτλο της.Σε περίπτωση που ο εκπαιδευόμενος έχει υποβάλει μια εργασία και θέλει να την διορθώσει θα πρέπει να ξαναυποβάλει την διορθωμένη εργασία. Έτσι η πλατφόρμα θα σβήσει αυτόματα την “παλιά” εργασία  και θα την αντικαταστήσει με την “καινούργια”.</br></br>
<img src='$themeimg/warning.png' width=18 height=18> Να σημειωθεί πως μετά την <b>λήξη</b> της ημερομηνίας  υποβολής  μιας εργασίας η υποβολή της  από τον εκπαιδευόμενο εκπρόθεσμα δεν είναι εφικτή.
</p>

<hr>
$langPHPMathPublisher";
$langWork_studentContent = "<p>Το υποσύστημα Εργασίες Μαθήματος αποτελεί ένα χρήσιμο εργαλείο του ηλεκτρονικού μαθήματος μιας και επιτρέπει την ηλεκτρονική <b>υποβολή</b> και <b>βαθμολόγηση</b> των εργασιών του μαθήματος. Ειδικότερα, επιτρέπει στους εκπαιδευόμενους να ανεβάσουν ηλεκτρονικά στην πλατφόρμα τις εργασίες τους  μέχρι την ημερομηνία υποβολής και στη συνέχεια αφού ο εκπαιδευτής τις βαθμολογήσει να δουν το βαθμό τους. Όλες οι εργασίες του μαθήματος είναι ορατές μέσω του καταλόγου των εργασιών. Ο συγκεκριμένος κατάλογος περιλαμβάνει εκτός από τον τίτλο της εργασίας: την προθεσμία υποβολής, την βαθμολογία από τον εκπαιδευτή και μια ένδειξη για το αν έχει στείλει εργασία ή όχι. Για την υποβολή της εργασίας πατήστε απλά πάνω στον τίτλο της. Σε περίπτωση που ο εκπαιδευόμενος έχει υποβάλει μια εργασία και θέλει να την διορθώσει θα πρέπει να ξαναυποβάλει την διορθωμένη εργασία.  Έτσι η πλατφόρμα θα σβήσει αυτόματα την “παλιά” εργασία και θα την αντικαταστήσει με την “καινούργια”. </p>
<p><img src='$themeimg/warning.png' width=18 height=18>Να σημειωθεί πως μετά την λήξη της ημερομηνίας υποβολής μιας εργασίας η υποβολή της από τον εκπαιδευόμενο εκπρόθεσμα δεν είναι εφικτή.</br>
&nbsp &nbsp Εάν μια εργασία είναι ομαδική θα πρέπει να εγγραφείτε σε μια ομάδα για να μπορέσετε να υποβάλετε την συγκεκριμένη  εργασία.
";



// ========= Help Group new =====================
$langHGroup="Ομάδες Χρηστών";
$langHGroup_student=$langHGroup;
$langGroupContent="<p>Το υποσύστημα ‘Ομάδες χρηστών’ επιτρέπει την συνεργασία και την αλληλεπίδραση των εκπαιδευόμενων μέσα από την οργάνωση τους σε ομάδες. Με αυτό τον τρόπο ενισχύεται η συνεργατική μάθηση, επιλύονται αρκετές απορίες και ανταλλάσσονται απόψεις για συγκριμένα θέματα του μαθήματος. Κατηγοριοποιώντας τις ενέργειες που μπορούν να λάβουν χώρα στο υποσύστημα ‘Ομάδες χρηστών’ μπορούμε να παραθέσουμε τις εξής:</p>
<ul>
  <li><a href='#syn1'>Βασικές λειτουργίες ομάδων χρηστών</a></li>
  <li><a href='#syn2'>Ρυθμίσεις ομάδων χρηστών</a></li>
  <li><a href='#syn3'>Μαζικές ρυθμίσεις ομάδων χρηστών</a></li>
  <li><a href='#syn4'>Διόρθωση ομάδας χρηστών</a></li>
</ul>
<hr noshade size=1>
<p><b><a name='syn1'>Βασικές λειτουργίες ομάδων χρηστών</a></b></p> 
<p>Οι βασικές λειτουργίες της ομάδας χρηστών είναι:</p>
<p><b>α) Δημιουργία ομάδας χρηστών.</b> Για την δημιουργία μιας ομάδας χρηστών εισάγετε τον  αριθμό  της ομάδας ή των ομάδων χρηστών που θα δημιουργηθούν καθώς και τον αριθμό των συμμετεχόντων σε αυτή. Εν συνεχεία πατήστε το κουμπί ‘Δημιουργία’.</p>
<p><b>β) Αλλαγή παραμέτρων μιας αμάδας χρηστών.</b> Για να τροποποιήσετε ορισμένες παραμέτρους μιας ομάδας χρηστών απλά πατήστε το κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά της. Μπορείτε να αλλάξετε τα στοιχεία της ομάδας όπως: το όνομα της, τον υπεύθυνο της ομάδας και τον μέγιστο αριθμό συμμετεχόντων. Η πιο όμως σημαντική λειτουργία είναι η μετακίνηση συμμετεχόντων μέσα και έξω από την ομάδα βάση των κουμπιών <img src='$themeimg/next.png' width=13 height=13> και <img src='$themeimg/back.png' width=13 height=13>.Η διαδικασία ολοκληρώνετε πατώντας το κουμπί ‘Αλλαγή’.</p>
<p> <b>γ) Διαγραφή μιας ομάδας χρηστών.</b> Για να διαγράψετε μια ομάδα χρηστών πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά της.</p>

<hr noshade size=1>
<p><b><a name='syn2'>Ρυθμίσεις ομάδων χρηστών</a></b></p> 
<p>Μια σειρά ρυθμίσεων του υποσυστήματος ‘Ομάδων χρηστών’ σας επιτρέπει να προσαρμόσετε την λειτουργία της ομάδας τόσο στις δίκες σας ανάγκες όσο και τις ανάγκες του μαθήματος. Μεταξύ των άλλων μπορείτε να ρυθμίσετε το εάν οι εκπαιδευόμενοι θα επιτρέπεται να <b>εγγραφούν</b> μόνοι τους στις ομάδες χρηστών ή θα χρειαστεί παρέμβαση από τον εκπαιδευτή. Απλά τσεκάρετε μια από τις δυο δυνατότητες στο ανάλογο πλαίσιο έλεγχου για να ενεργοποιήσετε την συγκριμένη ρύθμιση. Επίσης σας δίνετε η δυνατότητα της επιλογής σχετικά με το εάν η ομάδα θα διαθέτει <b>περιοχή συζητήσεων</b> ή όχι επιλέγοντας το συγκεκριμένο ελεγκτήριο ελέγχου. Εάν τώρα επιθυμείτε η πρόσβαση στην περιοχή συζητήσεων να είναι <b>κλειστή</b> (επιτρέπετε η συμμετοχή μόνο σε μέλη της ομάδας) ή να είναι <b>ανοικτή</b> (μπορεί κάθε εκπαιδευόμενος να διαβάσει και να γράψει μηνύματα) απλά δεν έχετε παρά να τσεκάρετε μια από τις δυο διαθέσιμες επιλογές του συγκεκριμένου υποσυστήματος. Τέλος είναι στην ευχέρεια σας εάν η συγκεκριμένη ομάδα χρηστών θα διαθέτει <b>έγγραφα</b> ή όχι επιλέγοντας το συγκεκριμένο ελεγκτήριο. Εδώ θα πρέπει να τονιστεί πως τα συγκεκριμένα έγγραφα αφορούν την συγκριμένη ομάδα χρηστών και <b>δεν</b> σχετίζονται με το γενικό σύστημα των ‘Εγγράφων’ της κύριας οθόνης  της πλατφόρμας.</p>
<hr noshade size=1>
<p><b><a name='syn3'>Μαζικές ρυθμίσεις ομάδων χρηστών</a></b></p>
<p>Το υποσύστημα των ομάδων χρηστών σας παρέχει μια σειρά από μαζικές λειτουργίες της οποίες μπορείτε να πραγματοποιήσετε στα πλαίσιο της ομάδας ή των ομάδων που έχετε δημιουργήσει. Συγκεκριμένα: </p>
<ul> 
<li><b>Διαγραφή </b>όλων των ομάδων χρηστών. Με μια μόνο κίνηση μπορείτε να διαγράψετε όλες τις ομάδες τις οποίες έχετε δημιουργήσει. Αυτή η λειτουργία μπορεί να φάνει πολύ χρήσιμη στο τέλος του ακαδημαϊκού έτους όπου θα έχει γίνει η ολοκλήρωση του χρονοδιαγράμματος του μαθήματος </li>                  
<li><b>Συμπλήρωση</b> όλων των ομάδων χρηστών. Με βάση τους εγγεγραμμένους στο μάθημα χρήστες το σύστημα δίνει την δυνατότητα μέσω της λειτουργίας ‘Συμπλήρωση όλων των ομάδων’ να αντιστοιχηθούν όλοι οι χρήστες τυχαία σε ομάδες</li>
<li><b>Εκκαθάριση</b> όλων των ομάδων. Βάση αυτής της λειτουργιάς μπορούν να διαγραφούν από όλες τις δημιουργημένες ομάδες οι εγγεγραμμένοι σε αυτές χρήστες</li>
</ul>

<hr noshade size=1>
<p><b><a name='syn4'>Διόρθωση ομάδας χρηστών</a></b></p>
<p>Για την διόρθωση της ομάδας χρηστών σας παρέχονται από το συγκεκριμένο υποσύστημα δυο βασικές λειτουργιές. Συγκριμένα: </p>
<p><b>α)Περιοχή για την ομάδα χρηστών.</b>Μια σειρά από χρήσιμες πληροφορίες (όνομα ομάδας χρηστών, υπεύθυνος ομάδας, μέλη ομάδας) σχετικά με την συγκειμένη ομάδα είναι στην διάθεση σας μέσω αυτού του υποσυστήματος. Εκτός από τις πληροφορίες η συγκειμένη λειτουργία παρέχει και μια σειρά συνδέσμων:  </p>
<ul>
<li>Διόρθωση της ομάδας χρηστών. Αποτελεί στην ουσία ένα σύνδεσμο για επιστροφή στην διαχείριση των στοιχείων της ομάδας. </li>
<li>Περιοχές συζητήσεων. Μπορείτε να δημιουργήσετε ένα νέο θέμα προς συζήτηση το οποίο θα αφορά την συγκριμένη ομάδα. Οι υποστηριζόμενες ενέργειες είναι: ‘νέο θέμα’, ‘διαγραφή θέματος’ καθώς και η ‘ειδοποίηση μέσω e-mail εάν σταλούν απαντήσεις’. Εδώ θα πρέπει να τονίσουμε πως η ανάρτηση ενός θέματος είναι ορατή και από το υποσύστημα ‘Περιοχές συζητήσεων’ της κύριας οθόνης της πλατφόρμας. </li>
<li>Έγγραφα ομάδας. Μπορείτε να προσθέστε ή να αφαιρέσετε μέσω των αντίστοιχων  συνδέσμων έγγραφα τα οποία θα αφορούν την συγκεκριμένη ομάδα. Εδώ και πάλι πρέπει να τονιστεί ότι τα “ανεβασμένα”  έγγραφα της ομάδας  αφορούν την συγκριμένη ομάδα και  δεν σχετίζονται με το υποσύστημα ‘Έγγραφα’ της κύριας οθόνης της πλατφόρμας. Επίσης μπορείτε να δημιουργήσετε καταλόγους μέσω των οποίων θα κατηγοριοποιήσετε τα «ανεβασμένα» έγγραφα της ομάδας από τον σύνδεσμο ‘Δημιουργία καταλόγου’. Μια πολύ χρήσιμη λειτουργία η οποία αφορά τον αποθηκευτικό χώρο που έχετε στην διάθεση σας είναι εφικτή μέσω του συνδέσμου ‘Επισκόπηση αποθηκευτικού χώρου’. </li>
</ul>
<p><b>β)Διαχείριση καταλόγου χρηστών.</b>Σε αυτό το υποσύστημα μπορείτε να διαχειριστείτε των κατάλογο των χρηστών του μαθήματος σας. Μπορείτε να προσθέσετε ένα χρήστη ή πολλούς χρήστες μέσω των συνδέσμων ‘Προσθήκη ενός χρήστη’ και ‘Προσθήκη πολλών χρηστών’. Επίσης σας παρέχετε η δυνατότητα πρόσθεσης ενός χρήστη επισκέπτη μέσω του συνδέσμου ‘προσθήκη χρήστη επισκέπτη’. Για την αναζήτηση ενός χρήστη πατήστε στο σύνδεσμο ‘αναζήτηση χρήστη’ και εισάγετε το όνομα και επώνυμο ή εναλλακτικά το user name του. Για την διαγραφή ενός χρήση απλά επιλέξτε το κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται στην δεξιά πλευρά των στοιχείων του χρήστη. </p>

";
$langGroup_studentContent="<p>Μια ομάδα χρηστών είναι μια <b>συλλογή</b> εγγεγραμμένων χρηστών του μαθήματος που μοιράζονται την ίδια περιοχή συζητήσεων καθώς και την ίδια περιοχή μεταφόρτωσης αρχείων και εργασιών. Το υποσύστημα ‘Ομάδες χρηστών’ επιτρέπει την συνεργασία και την αλληλεπίδραση των εκπαιδευόμενων μέσα από την οργάνωση τους σε ομάδες. Με αυτό τον τρόπο ενισχύεται η συνεργατική μάθηση, επιλύονται αρκετές απορίες και ανταλλάσσονται απόψεις για συγκριμένα θέματα του μαθήματος. Τα στοιχεία μιας ομάδας όπως: ο υπεύθυνος της ομάδας, ο αριθμός των εγγεγραμμένων χρηστών, ο μέγιστος αριθμός των επιτρεπόμενων χρηστών στην ομάδα είναι διαθέσιμα σε σας για την καλύτερη ενημέρωση σας σχετικά με την ομάδα.</p>";
//==================================================



// ============= Help Agenda new ==================== 
$langHAgenda = "Ατζέντα";
$langHAgenda_student = $langHAgenda ;
$langAgendaContent = "<p>Το υποσύστημα 'Ατζέντα' έχει ως στόχο την ενημέρωση και την οργάνωση του χρόνου εκπαιδευτών και εκπαιδευόμενων σχετικά με τις διεργασίες που λαμβάνουν χώρα στο συγκεκριμένο μάθημα. Ο καθορισμός των κεφαλαίων (ύλη μαθήματος), καθορισμός των ωρών που θα πραγματοποιηθούν οι παρουσιάσεις του μαθήματος, γνωστικά αντικείμενα τα οποία θα πραγματευτεί το συγκεκριμένο μάθημα είναι μερικές από τις χρήσεις του εν λόγο υποσυστήματος. Για την προσθήκη ενός γεγονότος στην ατζέντα του μαθήματος πατήστε στο σύνδεσμο ‘Προσθήκη ενός γεγονότος’. Καθορίστε τον τίτλο, την ημερομηνία και το χρονικό διάστημα που θα αναρτηθεί το συγκεκριμένο γεγονός καθώς και την περιγραφή του.Για να προσθέσετε μαθηματικά σύμβολα ακολουθήστε τις παρακάτω οδηγίες. Η διαδικασία ολοκληρώνεται πατώντας το σύνδεσμο ‘Προσθήκη /Αλλαγή ’. </p>
<p><b>Υποστηριζόμενες ενέργειες υποσυστήματος 'Ατζέντα'</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα 'Ατζέντα' είναι οι εξής:
<ul>
  <li>Αλλαγή ενός γεγονότος. Για να τροποποιήσετε ένα γεγονός απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά του</li>
  <li>Διαγραφή ενός γεγονότος. Για να διαγράψετε ένα γεγονός απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
  <li>Ορατό/Αόρατο. Για να είναι να μην είναι ορατό ένα γεγονός πατήστε στο κουμπί <img src='$themeimg/visible.png' width=16 height=16> το οποίο βρίσκεται δεξιά του. Η ενεργοποίηση της και πάλι γίνεται με την αντίστροφη διαδικασία.</li> 
  <li>Αντιστροφή της σειράς παρουσίασης των γεγονότων. Μπορείτε να αντιστρέψετε την σειρά εμφάνισης επιλέγοντας ανάμεσα από το πιο πρόσφατο στο πιο παλιό γεγονός και το αντίστροφο απλά πατώντας στο σύνδεσμο ‘Αντιστροφή της σειράς παρουσίασης’.</li>
</ul>
<hr noshade size=1>
<p> $langPHPMathPublisher </p>
";

$langAgenda_studentContent= " 
<p>
Το υποσύστημα 'Ατζέντα' έχει ως στόχο την <b>ενημέρωση</b> και την <b>οργάνωση</b> του χρόνου των εκπαιδευόμενων σχετικά με τις διεργασίες που λαμβάνουν χώρα στο συγκεκριμένο μάθημα. Ο καθορισμός των κεφαλαίων (ύλη μαθήματος), καθορισμός των ωρών που θα πραγματοποιηθούν οι παρουσιάσεις του μαθήματος, γνωστικά αντικείμενα τα οποία θα πραγματευτεί το συγκεκριμένο μάθημα είναι μερικές από τις χρήσεις του εν λόγο υποσυστήματος. Χρησιμοποιώντας την ‘μπάρα κύλισης’ στην δεξιά πλευρά του φυλλομετρητή  σας μπορείτε να δείτε τα διάφορα γεγονότα που λαμβάνουν χώρα στο συγκεκριμένο μάθημα. Είναι σημαντικό να αναφερθεί πως εκτός από την ημερομηνία διεξαγωγής ενός γεγονότος αναφέρεται και η ακριβής ώρα πραγματοποίησης του. Η χρησιμότητα του συγκριμένου υποσυστήματος είναι εμφανής ιδιαίτερα σε περιπτώσεις έκτακτων αναγκών ή αλλαγής ώρας πραγματοποίησης ενός μαθήματος.
</p>
" ;

$langHMyAgenda = "Το ημερολόγιό μου";
$langMyAgendaContent = '
<p>Το υποσύστημα ‘Το ημερολόγιό μου’ έχει ως στόχο την <b>ενημέρωση</b> και την 
<b>οργάνωση</b> του χρόνου σας σχετικά με τις διεργασίες που λαμβάνουν χώρα στο 
συγκεκριμένο μάθημα. Ο καθορισμός των ωρών που θα πραγματοποιηθούν οι 
παρουσιάσεις του μαθήματος, οι ώρες διεξαγωγής των  εξετάσεων αλλά και διάφορα 
σημαντικά γεγονότα τα οποία αφορούν το μάθημα είναι στην διάθεση σας μέσω του 
συγκριμένου υποσυστήματος. Με γραφικό τρόπο παρουσιάζονται  οι ημερομηνίες και 
το χρονικό διαστήματα των γεγονότων. Εδώ θα πρέπει να διευκρινίσουμε πως το 
περιγραφόμενο υποσύστημα σχετίζεται άμεσα με το υποσύστημα ‘Ατζέντα’.</p>
';

//======================================================






// ======= Help link new ========================================
$langHLink = "Σύνδεσμοι";
$langHLink_student = $langHLink;
$langLinkContent = "<p>Μέσω του υποσυστήματος ‘Σύνδεσμοι’ μπορείτε να συγκεντρώσετε όλους τους χρήσιμους με το μάθημα συνδέσμους. Η πλατφόρμα παρέχει την δυνατότητα κατηγοριοποίησης των συνδέσμων για ευκολότερη πρόσβαση. Οι δυνατότητες που σας μέσω του συγκεκριμένου υποσυστήματος είναι: </p>
<p> <b>α) Προσθήκη συνδέσμου.</b> Για να εισάγετε ένα νέο σύνδεσμο πατήστε απλά ‘Προσθήκη συνδέσμου’. Στην εμφανιζόμενη οθόνη συμπληρώστε την διεύθυνση του πόρου στον Παγκόσμιο Ιστό  (Uniform Resource Locator), το όνομα του, μια επιγραφή, καθώς και την κατηγορία στην οποία θα ανήκει. Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο προσθήκη.</p>
<p> <b>β) Προσθήκη κατηγορίας.</b> Για να δημιουργήσετε μια νέα κατηγορία πατήστε ‘Προσθήκη κατηγορίας’. Στην εμφανιζόμενη οθόνη συμπληρώστε το όνομα της κατηγορίας και μια περιγραφή της. Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο 'Προσθήκη'. </p>

<hr>
<p>Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα 'Σύνδεσμοι' είναι οι εξής:</p>
<ul>
  <li>Αλλαγή ενός συνδέσμου. Για να τροποποιήσετε ένα σύνδεσμο απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά του</li>
  <li>Διαγραφή ενός συνδέσμου. Για να διαγράψετε ένα σύνδεσμο απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
  <li>Μετακίνηση ενός συνδέσμου. Για την σειρά εμφάνισης των συνδέσμων ανά κατηγορία γίνεται χρήση των ελεγκτηρίων (<img src='$themeimg/up.png' width=16 height=16>) (<img src='$themeimg/down.png' width=16 height=16>) τα οποία  βρίσκονται  δεξιά του </li>  
 </ul>
";
$langLink_studentContent = "<p>Το υποσύστημα Σύνδεσμοι σάς δίνει τη δυνατότητα πρόσβασης σε χρήσιμες πηγές από το Διαδίκτυο ομαδοποιημένες σε κατηγορίες που αφορούν το μάθημα. Οι σύνδεσμοι αυτοί έχουν επιλεχτεί από τον υπεύθυνο εκπαιδευτή του μαθήματος. Κάθε σύνδεσμος διαθέτει έναν τίτλο, μια περιγραφή, με επιπλέον πληροφορίες. Η πλατφόρμα παρέχει τη δυνατότητα <b>κατηγοριοποίησης</b> των συνδέσμων για ευκολότερη πρόσβαση. </p>";
//===================================================================

// ====== Help announcements new ======
$langHAnnounce = "Ανακοινώσεις";
$langHAnnounce_student = $langHAnnounce ;
$langAnnounceContent = "<p>Μπορείτε να προσθέσετε ανακοινώσεις στη σελίδα του μαθήματος πατώντας στο σύνδεσμο 'Προσθήκη Ανακοίνωσης'. Στην εμφανιζόμενη φόρμα συμπληρώνετε τον τίτλο και το σώμα της ανακοίνωσης. Για να προσθέσετε στην ανακοίνωση μαθηματικά σύμβολα ακολουθήστε τις παρακάτω <a href='#syn6'>οδηγίες</a>. Εάν επιθυμείτε την αποστολή της συγκεκριμένης ανακοίνωσης μέσω μηνύματος ηλεκτρονικού ταχυδρομείου (email) σε όλους τους εγγεγραμμένους στο μάθημα χρήστες απλά επιλέξτε το αντίστοιχο πλαίσιο έλεγχου. Η διαδικασία ολοκληρώνεται πατώντας στο σύνδεσμο 'Προσθήκη'. </p>
<p> Μέσω των εικονιδίων <img src='$themeimg/edit.png' width=16 height=16>  (Αλλαγή) και (<img src='$themeimg/delete.png' width=16 height=16>) (Διαγραφή) μπορούν να επιτευχθούν οι αντίστοιχες λειτουργιές σχετικά με μια ανακοίνωση. Η απενεργοποίηση-ενεργοποίηση του υποσυστήματος των ανακοινώσεων επιτυχαίνεται μέσω των συνδέσμων ‘Απενεργοποίηση’ - ‘Ενεργοποίηση’ οι οποίοι βρίσκονται δεξιά από τον τίτλου του υποσυστήματος. </p>
<p>Το εικονίδιο <img src='$themeimg/feed.png' width=16 height=16> αφορά την δυνατότητα αυτόματης παραλαβής ανακοινώσεων του μαθήματος μέσω του RSS (Really Simple Syndication) τόσο από υπολογιστή όσο και από κινητό τηλέφωνο. Πατώντας απλά πάνω στο εικονίδιο και διαθέτοντας στον υπολογιστή ή το κινητό σας τηλέφωνο ένα RSS reader μπορείτε να επωφεληθείτε από τα πλεονεκτήματα της συγκεκριμένης υπηρεσίας.</p>    
<hr noshade size=1>
<p> $langPHPMathPublisher </p>
<p><a name='syn6'></a>
";
//$langPHPMathPublisher";
$langHAnnounce_student = $langHAnnounce;

$langAnnounce_studentContent = '<p>Το υποσύστημα ‘Ανακοινώσεις’ επιτρέπει την <b>ενημέρωση</b> των εκπαιδευόμενων σε θέματα που αφορούν το συγκεκριμένο μάθημα. Η πλατφόρμα υποστηρίζει την ενημέρωση σας για τις ανακοινώσεις του μαθήματος με τρεις τρόπους. Συγκεκριμένα:
</p>
<ol>
<li><b>Παρακολουθείτε</b> τακτικά το υποσύστημα ‘Ανακοινώσεις’ και παρακολουθείτε τις αναρτήσεις που έχουν γίνει από τον εκπαιδευτή του μαθήματος.</li>
<li>Έχοντας δηλώσει κατά την εγγραφή σας στο μάθημα μια <b>ενεργή</b> διεύθυνση ηλεκτρονικού ταχυδρομείου (e-mail) μπορείτε να δέχεστε τις αναρτήσεις του υποσυστήματος των ανακοινώσεων. Εάν δεν έχετε δηλώσει διεύθυνση κατά την εγγραφή σας στο μάθημα αυτό μπορεί να γίνει και μέσα από την αλλαγή στο προφίλ σας εισάγοντας μια έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου.</li>
<li><b>Ενημέρωση</b> για τις αναρτήσεις στον υπολογιστή ή κινητό τηλέφωνο σας μέσω της υπηρεσίας RSS <img src="$themeimg/feed.png" width=16 height=16> . Πρόκειται για την δυνατότητα αυτόματης παραλαβής ανακοινώσεων του μαθήματος μέσω του RSS (Really Simple Syndication) τόσο από υπολογιστή όσο και από κινητό τηλέφωνο. Πατώντας απλά πάνω στο εικονίδιο και διαθέτοντας στον υπολογιστή ή το κινητό σας τηλέφωνο ένα RSS reader μπορείτε να επωφεληθείτε από τα πλεονεκτήματα της συγκεκριμένης υπηρεσίας.</li>
</ol>
<p>
</p>'; 
//=============================================




// Help profile
$langHProfile = "Αλλαγή του Προφίλ μου";
$langProfileContent = "
<p>Μέσω του συγκεκριμένου υποσυστήματος μπορείτε να <b>αλλάξετε</b> τα στοιχεία 
ενός χρήστη της πλατφόρμας. Σας δίνετε η δυνατότητα να τροποποιήσετε το 
ονοματεπώνυμο του χρήστη αλλά και το username του. Επίσης μπορείτε να αλλάξετε 
την ηλεκτρονική διεύθυνση ενός χρήστη και να επιλέξετε εάν αυτή θα είναι 
ιδιωτική, θα εμφανίζεται σε όλους ή μόνο στους εκπαιδευτές. Ο αριθμός μητρώου 
καθώς και το τηλέφωνο μπορούν και αυτά να αλλάξουν και να καθοριστεί η εμφάνιση 
τους. Εάν δίνετε βάρος στην εμφάνιση του μαθήματος σας μπορείτε να καθορίστε το 
πώς θα εμφανίζεται επιλέγοντας ‘Αναλυτικό’ ή ‘Συνοπτικό’ τρόπο παρουσίασης. Εάν 
επιθυμείτε ή όχι να λαμβάνετε e-mails από τα μαθήματα σας απλά επιλέξτε το 
αντίστοιχο ελεγκτήριο. Ακόμη μπορείτε να  καθορίσετε την σχολή – τμήμα μέσα από 
μια λίστα τιμών. Για μια ολοκληρωμένη εικόνα του προφίλ μπορείτε να προσθέσετε 
μια εικόνα αλλά και μια σύντομη περιγραφή. Η διαδικασία ολοκληρώνεται μέσω του 
κουμπιού ‘Αλλαγή’.</p>
";


//Help import page
$langHImport = "Ανέβασμα ιστοσελίδας";
$langImportContent = "<p>Αν θέλετε μπορείτε να ανεβάσετε αρχείο σχετικό με το μάθημα σας. Το αρχείο αυτό θα αποθκευτεί στον εξυπηρετητή του Open eClass. Θα δημιουργηθεί σύνδεσμος προς αυτό στο αριστερό μενού του μαθήματος που θα ανοίγει σε νέο παράθυρο του φυλλομετρητή του χρήστη.</p>
<p>Για να το κάνετε αυτό πατήστε το πλήκτρο 'Browse', επιλέξτε το αρχείο που θέλετε να ανεβάσετε, δώστε ένα τίτλο στο πεδίο 'Τίτλος σελίδας' και πιέστε το πλήκτρο 'Προσθήκη'.</p>
<p>Ο σύνδεσμος του αρχείου που ανεβάζετε μπορεί να απενεργοποιηθεί και να διαγραφεί από το εργαλείο
'Διαχείριση εργαλείων'.</p>";


// Help external  module
$langHModule = "Προσθήκη εξωτερικού συνδέσμου";
$langModuleContent = "<p>Αν θέλετε να προσθέσετε συνδέσμους από την αρχική σελίδα του μαθήματος προς ιστοσελίδες
που υπάρχουν ήδη κάπου αλλού στο δίκτυο (ή ακόμα κάπου αλλού στον δικό σας δικτυακό τόπο) πληκτρολογήστε το
σύνδεσμο και τον τίτλο του συνδέσμου και στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'. Οι σελίδες που προσθέτετε εσείς στην αρχική σελίδα μπορούν να απενεργοποιηθούν και να διαγραφούν, ενώ τα ενσωματωμένα εργαλεία μπορούν να
απενεργοποιηθούν μόνο, αλλά όχι να διαγραφούν.</p>";


//tools management
$langHcourseTools = "Ενεργοποίηση εργαλείων";
$langcourseToolsContent = "
<p>Μέσω του συγκεκριμένου υποσυστήματος μπορείτε να <b>ενεργοποιήσετε</b> ή να <b>απενεργοποιήσετε</b> τα διάφορα υποσυστήματα του μαθήματος. Στις δύο στήλες παρουσιάζεται η κατάσταση του κάθε υποσυστήματος, δηλαδή αν είναι ενεργό ή όχι.<br>
Για να αλλάξετε την κατάσταση σε κάποιο υποσύστημα, επιλέξτε την στήλη στην οποία βρίσκεται και αντιστοιχεί στην κατάσταση ενεργό/ανενεργό και πατήστε το κουμπί (<img src='$themeimg/arrow.png' width=16 height=16>) για την μετάβαση στην άλλη κατάσταση (πχ. από ενεργό σε ανενεργό). Εάν επιθυμείτε να κάνετε μετακίνηση περισσοτέρων από ένα εργαλείων από μια στήλη στην άλλη πατήστε το πλήκτρο CTRL και επιλέξτε με το ποντίκι τα επιθυμητά υποσυστήματα. Εν συνεχεία πιέστε το κουμπί (<img src='$themeimg/arrow.png' width=16 height=16>). Όλες οι προαναφερόμενες διαδικασίες ολοκληρώνονται πατώντας το σύνδεσμο ‘Υποβολή αλλαγών’.</p>
<hr>
<p><b>Υποστηριζόμενες ενέργειες 'Ενεργοποίηση εργαλείων'</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα ενεργοποίησης εργαλείων είναι οι εξής:
<ul>
  <li><b>Ανέβασμα ιστοσελίδας</b>. Η συγκεκριμένη ενέργεια λειτούργει ως σύνδεσμος μιας σελίδας (σε μορφή HTML) την οποία έχετε κατασκευάσει και του συγκριμένου μαθήματος. Έτσι πλέον στα εργαλεία του μαθήματος εμφανίζεται και η συγκεκριμένη ιστοσελίδα. </li>
  <li><b>Προσθήκη εξωτερικού σύνδεσμου στο αριστερό μενού</b>. Εάν επιθυμείτε να εισάγετε ένα εξωτερικό σύνδεσμο δεν έχετε παρά να δώσετε την διεύθυνση του συνδέσμου και να πατήσετε το  κουμπί ‘Προσθήκη’.</li>
  </ul>
</p>";

$langCourseAccessHelp = "
<ul>
<li><b><img src='$themeimg/lock_open.png' width=16 height=16> Ανοικτό Μάθημα</b>.Η συγκεκριμένη μέθοδος πρόσβασης επιτρέπει την Ελεύθερη Πρόσβαση (χωρίς εγγραφή) από τη αρχική σελίδα του μαθήματος και μάλιστα χωρίς συνθηματικό. </li>
<li><b><img src='$themeimg/lock_registration.png' width=16 height=16> Απαιτείται εγγραφή</b>.Η συγκεκριμένη μέθοδος πρόσβασης Ελεύθερη Πρόσβαση (με εγγραφή) σε όσους διαθέτουν  είδη λογαριασμό στην πλατφόρμα. Εδώ καθορίζεται η δυνατότητα εισαγωγής ενός συνθηματικού η οποία όμως είναι προαιρετική.</li>
<li><b><img src='$themeimg/lock_closed.png' width=16 height=16> Κλειστό μάθημα</b>.Η συγκεκριμένη μέθοδος πρόσβασης  επιτρέπει την πρόσβαση στο μάθημα (για εγγραφή) να έχουν μόνο όσοι βρίσκονται στη Λίστα Χρηστών του μαθήματος.</li>
<li><b><img src='$themeimg/lock_inactive.png' width=16 height=16> Ανενεργό μάθημα</b>.Η συγκεκριμένη μέθοδος πρόσβασης  επιτρέπει την πρόσβαση στο μάθημα <b>μόνο</b> των εκπαιδευτών του μαθήματος.</li>
</ul>
";

// course info
$langHInfocours = "Διαχείριση Μαθήματος";
$langInfocoursContent = "
<p>Το υποσύστημα ‘Διαχείριση Μαθήματος’ σας επιτρέπει να τροποποιήσετε/επεξεργαστείτε μια σειρά παραμέτρων οι οποίες σχετίζονται με ένα συγκεκριμένο μάθημα. Κατηγοριοποιώντας τις ρυθμίσεις των προαναφερόμενων παραμέτρων έχουμε:</p>
<hr>
<p><b>Ταυτότητα Μαθήματος</b></p>
<p>Η συγκεριμένη κατηγορία αφορά τα στοιχεία ταυτότητας του μαθήματος. Εδώ μπορείτε να <b>εισάγετε</b> τον κωδικό και τον τίτλο ενός μαθήματος καθώς και τον εκπαιδευτή-εκπαιδευτές οι οποίοι θα διαχειρίζονται το μάθημα. Επίσης μέσα από μια λίστα επιλογής (List box) σας δίνετε η δυνατότητα να επιλέξετε την Σχολή-Τμήμα όπου ανήκει το συγκεκριμένο μάθημα αλλά και τον τύπο του μαθήματος πχ. μεταπτυχιακό μάθημα. Η συγκριμένη κατηγορία ολοκληρώνεται με την συμπλήρωση ορισμένων λέξεων-κλειδιών οι οποίες χρησιμοποιούνται προκειμένου οι εκπαιδευόμενοι να <b>εστιάσουν</b> περισσότερο στις αντίστοιχες έννοιες. </p>
<hr>
<p><b>Πρόσβαση στο μάθημα</b></p>
<p>Η συγκεκριμένη κατηγορία σχετίζεται με την πρόσβαση των χρηστών στο μάθημα. Η πλατφόρμα υποστηρίζει του παρακάτω  τρόπους <b>πρόσβασης</b> χρηστών:</p>
$langCourseAccessHelp
<hr>
<p><b>Γλώσσα</b></p>
<p>Αφορά την Γλώσσα εμφάνισης των μηνυμάτων του μαθήματος. Οι <b>υποστηριζόμενες</b> γλώσσες είναι: Ελληνικά, Αγγλικά και Γερμανικά.</p>
<hr>
<p><b>Υποστηριζόμενες ενέργειες υποσυστήματος ' Διαχείριση Μαθήματος'</b></p>
<p>Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα ' Διαχείριση Μαθήματος ' είναι οι εξής:</p>
<ul>
<li><b>Αντίγραφο ασφαλείας του μαθήματος:</b> Μπορείτε να δημιουργήσετε ένα αντίγραφο ασφαλείας του μαθήματος και να το αποθηκεύσετε τοπικά στον υπολογιστή σας. Σε περίπτωση που θέλετε να ανακτήσετε το περιεχόμενό του θα πρέπει να επικοινωνήσετε με τον διαχειριστή της πλατφόρμας.</li>
<li><b>Διαγραφή του μαθήματος:</b> Διαγράφοντας το μάθημα, διαγράφετε το περιεχόμενό του και οι χρήστες από αυτό. (σημειώστε ότι δεν διαγράφονται από την πλατφόρμα).</li>
<li><b>Ανανέωση μαθήματος:</b> Μπορείτε επιλεκτικά να διαγράψετε κάποια από τα δεδομένα του μαθήματος για να το προετοιμάσετε για την καινούρια ακαδημαϊκή χρονιά.</li>
</ul>
</p>";


//============= Help Conference new ===========
$langHConference = "Τηλεσυνεργασία";
$langHConference_student = $langHConference ;
$langConferenceContent = "<p>Το υποσύστημα ‘Τηλεσυνεργασία΄ στην απλή του μορφή επιτρέπει την ανταλλαγή απόψεων / επικοινωνία σε πραγματικό χρόνο στο πλαισιο του μαθληματος. Η επικοινωνία γίνεται μέσω απλού κειμένου (plaintext). Για να εισάγετε  ένα μήνυμα στην τηλεσυνεργασία πληκτρολογήστε απλά το μήνυμα σας και πατήστε το κουμπί (<img src='$themeimg/arrow.png' width=16 height=16>).</p>
<ul>
<li><b>Καθάρισμα</b>. Πατώντας στον συγκεκριμένο σύνδεσμο μπορείτε να <b>καθαρίσετε</b>  την περιοχή μηνυμάτων της  τηλεσυνεργασίας είτε όταν ο όγκος των μηνυμάτων είναι πολύ μεγαλος  είτε όταν αρχίζετε ένα νέο θέμα τηλεσυνεργασίας.</li>
<li><b>Αποθήκευση.</b>Πατώντας σε αυτό το σύνδεσμο μπορείτε να αποθηκεύεστε τα μηνύματα τα οποία έχουν λάβει χώρα  στην περιοχή της τηλεσυνεργασίας. Τα μηνύματα αποθηκεύονται στο menu ‘Έγγραφα’ (σε μορφή  .txt)  και είναι ορατά από τους εκπαιδευόμενους. Μπορείτε ένα επιθυμείτε ως εκπαιδευτής να τα κάνετε μη ορατά πατώντας στο κουμπί <img src='$themeimg/visible.png' width=16 height=16>.</li>
</ul>
";
//=================================



//$langHConference_stud = $langHConference;
$langConference_studentContent ="<p><p>Το υποσύστημα ‘Τηλεσυνεργασία’ στην απλή του μορφή επιτρέπει την ανταλλαγή απόψεων και την επικοινωνία σε πραγματικό χρόνο στο πλαίσιο του μαθήματος. Η επικοινωνία γίνεται μέσω απλού κειμένου (plaintext). Για να εισαγάγετε ένα μήνυμα στην τηλεσυνεργασία πληκτρολογήστε, απλώς πληκτρολογήστε το μήνυμά σας και πατήστε το κουμπί (<img src='$themeimg/arrow.png' width=16 height=16>).</p>
";


// ========= Help Video new ==========
$langHVideo = "Πολυμέσα";
$langHVideo_student = $langHVideo ;
$langVideoContent = "<p>
Μέρος του υλικού των μαθημάτων μπορεί να είναι και οπτικοακουστικό υλικό. 
Το υποσύστημα της πλατφόρμας ‘Πολυμέσα’ μπορεί να χρησιμοποιηθεί για να βελτιώσει 
την διδακτική και μαθησιακή διεργασία. Μέσα από την κινούμενη εικόνα και τον ήχο που προσφέρει 
ένα πολυμεσικό αρχείο ο εκπαιδευόμενος μπορεί να αναπτύξει δεξιότητες οι οποίες είναι δύσκολο 
να δημιουργηθούν μέσα από ένα έντυπο υλικό. Για την ανάρτηση ενός πολυμεσικού υλικού 
η πλατφόρμα χρησιμοποιεί δυο τρόπους:</p>
<p> <b>α)</b> Τον σύνδεσμο ‘προσθήκη πολυμεσικού υλικού’. Επιλέξτε ‘Προσθήκη πολυμεσικού υλικού’ και 
δώστε το μονοπάτι στο οποίο είναι αποθηκευμένο το αρχείο στον υπολογιστή σας μέσω της επιλογής ‘browse’. 
Συμπληρώστε τα πεδία τίτλος, περιγραφή, τον δημιουργό, τον εκδότη, την ημερομηνία και πατήστε 
το κουμπί ‘ανέβασμα αρχείου’ για την ολοκλήρωση της διαδικασίας. 
</br></br>
<b>β)</b> Τον σύνδεσμο ‘προσθήκη συνδέσμου βίντεο’. Επιλέξτε ‘Προσθήκη συνδέσμου βίντεο’ και δώστε το URL (Uniform Resource Locator) δηλαδή την διεύθυνση του πόρου σας στον παγκόσμιο ιστό ο οποίος στην προκειμένη περίπτωση είναι το βίντεο σας. Ένα παράδειγμα URL είναι το http://www.youtube.com/video1.wmv. Συμπληρώστε τα πεδία: τίτλος βίντεο, περιγραφή, τον δημιουργό, τον εκδότη, την ημερομηνία του βίντεο και πατήστε το κουμπί ‘Προσθήκη’ για την ολοκλήρωση της διαδικασίας.</p>
<hr>
<p><b>Υποστηριζόμενες ενέργειες υποσυστήματος 'Πολυμέσων'</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα 'Πολυμέσα' είναι οι εξής:
<ul>
  <li>Αλλαγή πληροφοριών. Για να τροποποιήσετε ορισμένες πληροφορίες σχετικά με το αρχείο πολυμέσων 
απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά του</li>
  <li>Διαγραφή. Για να διαγράψετε ένα πολυμεσικό αρχείο απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
  <li>Επισκόπηση αποθηκευτικού χώρου. Η δυνατότητα αυτή σας επιτρέπει να δείτε το χρησιμοποιούμενο χώρο σε σχέση με τον συνολικό διαθέσιμο </li> 
  </ul>
";
//=====================================




//$langHVideo_stud = $langHVideo;
$langVideo_studentContent = "<p>Μέρος του υλικού των μαθημάτων μπορεί να είναι και οπτικοακουστικό υλικό. 
Το υποσύστημα της πλατφόρμας ‘Πολυμέσα’ μπορεί να χρησιμοποιηθεί για να βελτιώσει την διδακτική 
και μαθησιακή διεργασία. Μέσα από την κινούμενη εικόνα και τον ήχο που προσφέρει ένα πολυμεσικό αρχείο αναπτύσσονται 
δεξιότητες οι οποίες είναι δύσκολο να δημιουργηθούν μέσα από ένα έντυπο υλικό. 
Για να αναπαράγετε ένα αρχείο πολυμέσων απλά πατήστε 'επάνω' του. 
Η αναπαραγωγή του επιτυγχάνεται <b>μέσα</b> από τον φυλλομετρητή (web browser) 
τον οποίο χρησιμοποιείτε για περιήγηση στο διαδίκτυο 
ή μέσω <b>εξωτερικού</b> συνδέσμου σε συγκεκριμένη ιστοσελίδα. 
Εάν επιθυμείτε να κατεβάσετε προς αποθήκευση στον υπολογιστή σας ένα πολυμεσικό αρχείο 
πατήστε στο κουμπί <img src='$themeimg/save_s.png' width=17 height=17> (αποθήκευση) 
το οποίο βρίσκετε δεξιά του. Τέτοια αρχεία χρησιμοποιούνται για να μεταφέρουν
οπτικοακουστικές πληροφορίες και να δημιουργούν αποτελεσματικές προϋποθέσεις 
αλληλεπίδρασης μεταξύ των εκπαιδευομένων και του περιεχομένου διδασκαλίας. 
Συνδυάζοντας το υποσύστημα ‘Πολυμέσα’ με το υποσύστημα ‘Έγγραφα’ παράγεται ένα <b>ενισχυμένο</b> 
“εργαλείο μάθησης” το οποίο είναι διαθέσιμο στον εκπαιδευόμενο.
</p>";



// === Help course description updated ==========
$langHCoursedescription = "Περιγραφή Μαθήματος";
$langHCoursedescription_student = $langHCoursedescription ;
$langCoursedescriptionContent = "<p>Μέσω του υποσυστήματος ‘Περιγραφή Μαθήματος’ σας δίνετε  η δυνατότητα να προσθέσετε πληροφορίες πατώντας στο σύνδεσμο  'Δημιουργία και Διόρθωση'. Κατηγοριοποιώντας τις διάφορες περιοχές που μπορείτε να διορθώσετε έχουμε:
<ul>
  <li>Βοηθήματα</li>
  <li>Περιεχόμενο Μαθήματος</li>
  <li>Εκπαιδευτικές Δραστηριότητες</li>
  <li>Βοηθήματα</li>
  <li>Ανθρώπινο Δυναμικό</li>
  <li>Τρόποι αξιολόγησης/εξέτασης</li>
  <li>Συμπληρωματικά Στοιχεία</li>
</ul>
<p>Μπορείτε να προσθέσετε μια κατηγορία επιλέγοντας την από την λίστα με τις υπάρχουσες κατηγορίες και εν συνεχεία πατώντας στο σύνδεσμο 'Προσθήκη'.
Δίνοντας την περιγραφή για την επιλεγμένη κατηγορία, μπορείτε να οριστικοποιήσετε ή να ακυρώσετε μια επιλογή σας μέσω των συνδέσμων ‘Προσθήκη’ και ‘Ακύρωση και επιστροφή’.  

<p><img src='$themeimg/warning.png' width=18 height=18> Στο συγκεκριμένο υποσύστημα πρέπει να ληφθούν υπόψη οι παρακάτω επισημάνσεις:
<ul>
  <li>Η περιγραφή του μαθήματος μπορεί να αλλάξει και από την αρχική σελίδα του μαθήματος μέσω του κουμπιού <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται κάτω από τον τίτλο του μαθήματος </li>
  <li>Οι κατηγορίες ‘Περιεχόμενο Μαθήματος’, ‘Εκπαιδευτικές Δραστηριότητες’, ‘Βοηθήματα’, ‘Ανθρώπινο Δυναμικό’, ‘Τρόποι αξιολόγησης/εξέτασης’ μπορούν να χρησιμοποιηθούν <b>μια</b> μόνο φορά στα πλαίσια του μαθήματος ενώ  η κατηγορία ‘Συμπληρωματικά Στοιχεία’, <b>πολλές</b> φορές</li>
  <li>Μέσω της διαδικασίας ‘Επιλογή και επιδιόρθωση’ και επιλέγοντας την κατηγορία ‘Συμπληρωματικά στοιχεία’ μπορείτε να αντικαταστήσετε τον τίτλο της συγκεκριμένης  κατηγορίας με δικό σας γεγονός το οποίο καθορίζει μια νέα δικιά σας κατηγορία. </li>
</ul>
</p>

<hr>
<p><b>Υποστηριζόμενες ενέργειες υποσυστήματος ‘Περιγραφή Μαθήματος’</b><br><br>
Οι εργασίες που υποστηρίζονται από την πλατφόρμα σχετικά με το υποσύστημα ‘Περιγραφή Μαθήματος’ είναι οι εξής:
<ul>
  <li>Διόρθωση. Για να τροποποιήσετε ορισμένες παραμέτρους στις προαναφερόμενες κατηγορίες απλά πατήστε στο κουμπί <img src='$themeimg/edit.png' width=16 height=16> το οποίο βρίσκεται δεξιά</li>
  <li>Διαγραφή. Για να διαγράψετε ορισμένες παραμέτρους στις προαναφερόμενες κατηγορίες απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
  <li>Προσθήκη στην κεντρική σελίδα του μαθήματος.Μπορείτε να προσθέσετε στην κεντρική σελίδα του μαθήματος μια από τις προαναφερόμενεσ κατηγορίες πατώντας στο κουμπί <img src='$themeimg/publish.png' width=16 height=16> </li> 
  </ul>
<hr>
<p>
$langPHPMathPublisher";

$langCoursedescription_studentContent ="<p>Αν ο υπεύθυνος εκπαιδευτής <b>δημιουργήσει</b> την περιγραφή του μαθήματος, τότε στο υποσύστημα αυτό θα μπορείτε να βρείτε χρήσιμες πληροφορίες που αφορούν την ταυτότητα το μαθήματος. Έτσι μέσω του υποσυστήματος ‘Περιγραφή Μαθήματος’ σας δίνετε η δυνατότητα να ενημερωθείτε για διάφορες περιοχές του μαθήματος. Κατηγοριοποιώντας αυτές τις περιοχές έχουμε: </p>
<ul>
  <li>Βοηθήματα</li>
  <li>Περιεχόμενο Μαθήματος</li>
  <li>Εκπαιδευτικές Δραστηριότητες</li>
  <li>Βοηθήματα</li>
  <li>Ανθρώπινο Δυναμικό</li>
  <li>Τρόποι αξιολόγησης/εξέτασης</li>
  <li>Συμπληρωματικά Στοιχεία</li>
</ul>
<p>Όλες οι παραπάνω περιοχές έχουν στόχο την καλύτερη ενημέρωση και οργάνωση σας στα μαθήματα τα οποία παρακολουθείτε.</p>
";
//===================================================



//========= Help Scorm / Learning Path updated ====================
$langHPath="Βοήθεια - Γραμμή Μάθησης";
$langHPath_student=$langHPath ;
$langPathContent="
<p>Το εργαλείο 'Γραμμή Μάθησης' υποστηρίζει τέσσερις βασικές λειτουργίες:</p>
<ul>
<li>Δημιουργία γραμμής μάθησης</li>
<li>Εισαγωγή γραμμής μάθησης από πρότυπο SCORM ή IMS</li>
<li>Εξαγωγή γραμμής μάθησης σε πρότυπο συμβατό με Scorm 2004 ή 1.2</li>
<li>Παρακολούθηση των εκπαιδευόμενων στις γραμμές μάθησης</li>
</ul>
<hr>
<p><b>Τί είναι η γραμμή μάθησης;</b></p>
<p>Η γραμμή μάθησης είναι μια ακολουθία από βήματα μάθησης που περιλαμβάνονται σε ενότητες.
Μπορεί να είναι είτε βασισμένη σε περιεχόμενo (μοιάζει με πίνακα περιεχομένων)
είτε βασισμένη σε ενέργειες, μοιάζοντας με ατζέντα ή πρόγραμμα που αναφέρει τις ενέργειες που χρειάζεται να κάνει
ο εκπαιδευόμενος για να κατανοήσει ή να εκπαιδευτεί σε μια συγκεκριμένη πηγή γνώσης.
Επιπροσθέτως του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει μια
συγκεκριμένη αλληλοδιαδοχή. Αυτό σημαίνει πως κάποια βήματα είναι προαπαιτούμενα για τα
αμέσως επόμενα αυτών βήματα (\"δεν μπορείτε να πάτε στο βήμα 2 πρίν το βήμα 1\").
Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική (τα βήματα εμφανίζονται το ένα μετά
το άλλο).</p>
<hr>
<p><b>Πώς δημιουργείτε τη δικιά σας γραμμή μάθησης;</b></p>
<p>Το πρώτο βήμα είναι να προσπελάσετε τον τομέα Λίστα Γραμμών Μάθησης. Στην κεντρική
οθόνη της λίστας γραμμών μάθησης, υπάρχει ένας ειδικός σύνδεσμος. Εκεί μπορείτε να
δημιουργήσετε όσες γραμμές μάθησης επιθυμείτε πατώντας στο σύνδεσμο 
<i> 'Δημιουργία νέας γραμμής μάθησης '</i>. Δημιουργούνται με αυτόν τον τρόπο κενές
γραμμές μάθησης, μέχρι να τους προσθέσετε ενότητες και βήματα.</p>
<hr>
<p><b>Ποιά είναι τα βήματα για τις γραμμές αυτές ; (Ποιά είναι τα αντικείμενα που μπορούν να προστεθούν ;)</b></p>
<p>Κάποια από τα εργαλεία, τις ενέργειες και το περιεχόμενο του Open eClass που θεωρείτε
χρήσιμα και κατάλληλα για τη γραμμή σας μπορούν να προστεθούν:</p>
<ul>
<li>Ξεχωριστά έγγραφα (κείμενα, εικόνες, Έγγραφα τύπου Office, ...)</li>
<li>Ετικέτες</li>
<li>Σύνδεσμοι</li>
<li>Ασκήσεις του Open eClass</li>
<li>Περιγραφή μαθήματος</li>
</ul>
<hr>
<p><b>Άλλα χαρακτηριστικά της Γραμμής Μάθησης</b></p>
<p>Μπορεί να ζητηθεί από τους εκπαιδευόμενους να ακολουθήσουν (αναγνώσουν)
τη γραμμή σας με μια συγκεκριμένη σειρά. Αυτό σημαίνει για παράδειγμα ότι οι
εκπαιδευόμενοι δεν μπορούν να προσπελάσουν την Άσκηση 2 αν δεν έχουν διαβάσει
το Έγγραφο 1. Όλα τα αντικείμενα έχουν κατάσταση: ολοκληρωμένη ή μη ολοκληρωμένη,
επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του ειδικού
εργαλείου <i>Παρακολούθηση γραμμών μάθησης</i>.</p>
<p>Αν θέλετε να τροποποιήσετε τον αρχικό τίτλο ενός βήματος, ο νέος τίτλος
μπορεί να φαίνεται στη γραμμή, χωρίς να επηρεαστεί ο αρχικός. Επομένως, αν θέλετε
να εμφανίσετε το test8.doc ως 'Τελική Εξέταση' στη γραμμή, δε χρειάζεται να
μετονομάσετε το αρχείο, αλλά αρκεί να χρησιμοποιήσετε έναν άλλο τίτλο στη γραμμή.
Είναι επίσης προτεινόμενο να δίνετε νέους τίτλους στους συνδέσμους αν οι
τελευταίοι έχουν μεγάλο μήκος ονόματος.</p>
<br>
<hr>
<p><b>Τί είναι η γραμμή μάθησης κατά το πρότυπο Scorm ή IMS και πώς μπορείτε να το εισάγετε ;</b></p>
<p>Το εργαλείο γραμμή μάθησης σας επιτρέπει να ανεβάσετε και να εισάγετε
εκπαιδευτικό περιεχόμενο συμβατό με τα πρότυπα SCORM και IMS.</p>
<p>Το SCORM (<i>Sharable Content Object Reference Model</i>) είναι ένα διεθνές
πρότυπο, με το οποίο έχουν ταχθεί πολλοί κυρίαρχοι οργανισμοί που ασχολούνται
με την ασύγχρονη τηλεκπαίδευση (e-Learning), όπως οι: NETg, Macromedia,
Microsoft, Skillsoft, κλπ και το οποίο δρα σε τρείς τομείς:</p>
<ul>
<li><b>Οικονομία</b>: Το πρότυπο Scorm επιτρέπει σε ολόκληρα μαθήματα ή
μικρότερες ενότητες περιεχομένου να επαναχρησιμοποιηθούν σε διαφορετικές
πλατφόρμες τηλεκπαίδευσης (Learning Management Systems - LMS) μέσω του
διαχωρισμού του περιεχομένου και της δομής του,</li>
<li><b>Παιδαγωγική</b>: Το πρότυπο Scorm ενσωματώνει τις έννοιες των
προαπαιτούμενων ή της <i>αλληλοδιαδοχής</i> (<i>π.χ. </i>\"Δεν
μπορείτε να προσπελάσετε το κεφάλαιο 2 αν δεν ολοκληρώσετε επιτυχώς την Άσκηση 1\"),</li>
<li><b>Τεχνολογία</b>: Το πρότυπο Scorm συνθέτει έναν πίνακα περιεχομένων
ως ένα επιπλέον επίπεδο αφαιρετικότητας, ασχέτως περιεχομένου και πλατφόρμας
τηλεκπαίδευσης. Βοηθάει τις έννοιες του περιεχομένου και της πλατφόρμας
τηλεκπαίδευσης στο να επικοινωνούν μεταξύ τους. Η επικοινωνία αυτή αποτελείται
κυρίως από <i>δείκτες</i> (\"Πού ακριβώς βρίσκεται ο Γιάννης στο μάθημα ;\"),
<i>βαθμολογία</i> (\"Με τί βαθμό πέρασε ο Γιάννης την άσκηση ;\") και <i>χρόνο</i>
(\"Πόσο χρόνο ξόδεψε ο Γιάννης στο κεφάλαιο 1 ;\").</li>
</ul>
<hr>
<p><b>Πώς δημιουργείτε μια γραμμή μάθησης συμβατή με το πρότυπο SCORM ;</b></p>
<p>Η πιο φυσική μέθοδος είναι να χρησιμοποιήσετε το εργαλείο δημιουργίας γραμμής
μάθησης του Open eClass και στη συνέχεια να το εξάγετε κάνοντας κλικ στο κατάλληλο
εικονίδιο. Όμως, μπορεί να θέλετε να δημιουργήσετε εκπαιδευτικό περιεχόμενο
συμβατό με το πρότυπο Scorm τοπικά στον υπολογιστή σας και στη συνέχεια να το
εισάγετε στο εργαλείο γραμμή μάθησης του Open eClass. Σε αυτήν την περίπτωση, σας
προτείνουμε να χρησιμοποιήσετε κάποιο εξεζητημένο εργαλείο όπως το
Lectora&reg; ή το Reload&reg;</p>
<hr>
<p><b>Χρήσιμοι σύνδεσμοι</b></p>
<ul>
<li>Adlnet: ή υπεύθυνη αρχή για την κανονικοποίηση του προτύπου Scorm, <a
href=\"http://www.adlnet.org/\">http://www.adlnet.org</a></li>
<li>Reload: εργαλείο Ελεύθερου Λογισμικού/Λογισμικού Ανοικτού Κώδικα για σύνταξη και
ανάγνωση περιεχομένου Scorm, <a
href=\"http://www.reload.ac.uk/\">http://www.reload.ac.uk</a></li>
<li>Lectora: εργαλείο για σύνταξη και δημοσίευση περιεχομένου Scorm, <a
href=\"http://www.trivantis.com/\">http://www.trivantis.com</a></li>
</ul>
<p><b>Σημείωση:</b></p>
<p>Ο τομέας Λίστα γραμμών μάθησης εμφανίζει όλες τις γραμμές μάθησης
<i>που δημιουργήθηκαν μέσω του Open eClass</i> και όλες τις εισηγμένες
γραμμές μάθησης <i>συμβατές με το πρότυπο Scorm</i>.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την γραμμή μάθησης από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langPath_studentContent="<p>Η γραμμή μάθησης είναι μια <b>ακολουθία</b> από βήματα μάθησης χωρισμένα σε ενότητες.  Μπορεί να είναι είτε βασισμένη σε περιεχόμενο (μοιάζει με πίνακα περιεχομένων) είτε βασισμένη σε ενέργειες( μοιάζει με ατζέντα) ή με πρόγραμμα το οποίο περιγράφει τις ενέργειες που χρειάζεται να κάνει ο εκπαιδευόμενος για να κατανοήσει μια συγκεκριμένη πηγή γνώσης.  Εκτός του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει και μια συγκεκριμένη αλληλοδιαδοχή. Αυτό σημαίνει πως κάποια βήματα είναι <b>προαπαιτούμενα</b> για τα αμέσως επόμενα αυτών βήματα (δεν μπορείτε να πάτε στο βήμα 2 πριν το βήμα 1). Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική (τα βήματα εμφανίζονται το ένα μετά το άλλο). Όλα τα αντικείμενα της γραμμής μάθησης έχουν κατάσταση: ολοκληρωμένη ή μη ολοκληρωμένη, επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του ειδικού εργαλείου ‘Παρακολούθηση γραμμών μάθησης’. Για να παρακολουθήσετε ένα εκπαιδευτικό αντικείμενο μιας γραμμής μάθησης πατήστε επάνω στον τίτλο της. Στα εμφανιζόμενα αντικείμενα επιλέξτε πιο θα εξακολουθήσετε (προσοχή: σε ορισμένα παίζει ρόλο η σειρά). Ανάλογα των ενεργειών που λαμβάνουν χώρα (παρακολούθηση διαφανειών) ο μετρητής προόδου (δεξιά) αλλάζει τα ποσοστά του. Μέσω του κουμπιού <img src='$themeimg/monitor.png' width=16 height=16> μπορείτε να δείτε τα αναλυτικά τα Στοιχεία του Εκπαιδευτικού Αντικείμενου όπως: Τίτλος, Σχόλια, Τύπος ενότητας, σύνολο χρόνου κλπ.</p>";
//========================================================


//=============== Help Dropbox new =======================
$langHDropbox="Χώρος Ανταλλαγής Αρχείων";
$langHDropbox_student=$langHDropbox ;
$langDropboxContent="<p> Το υποσύστημα 'Χώρος Ανταλλαγής Αρχείων' αποτελεί ένα εργαλείο ανταλλαγής αρχείων μεταξύ εκπαιδευτή και εκπαιδευόμενου. Μπορείτε να ανταλλάξετε οποιοδήποτε τύπο γνωστών αρχείων (doc,docx,odt,pdf κλπ).</p>
<p>Το υποσύστημα περιλαμβάνει δύο καταλόγους Ανταλλαγής Αρχείων: </p>
<p><b><u>Εισερχόμενα Αρχεία</u></b>. Στον συγκεκριμένο κατάλογο εμφανίζονται όλα τα αρχεία που έχετε παραλάβει από τους εκπαιδευόμενους με κάποιες επιπλέον πληροφορίες που αφορούν το αρχείο όπως: το όνομα του χρήστη, το μέγεθος του αρχείου και την ημερομηνία που το έστειλε. Για να διαγράψετε ένα εισερχόμενο αρχείο απλά πατήστε στο εικονίδιο (<img src='$themeimg/delete.png' width=10 height=10>) το οποίο βρίσκεται στην ίδια σειρά με το αρχείο προς διαγράφη. </p>
<p><b><u>Απεσταλμένα Αρχεία</u></b>. Στον συγκεκριμένο κατάλογο εμφανίζονται τα αρχεία που έχετε στείλει σε όλους τους εγγεγραμμένους στο μάθημα χρήστες (εκπαιδευόμενους,εκπαιδευτές) της πλατφόρμας μαζί με τις  αντίστοιχες πληροφορίες. Για να στείλετε ένα αρχείο σε κάποιον χρήστη αρχικά επιλέξτε το σύνδεσμο 'Ανέβασμα αρχείου'. Εδώ πρέπει να καθορίσετε την θέση που βρίσκεται το αρχείο στον υπολογιστή σας μέσω της επιλογής  'Browse'  και εν συνεχεία να καθορήσετε τους παραλήπτες του συγκεκριμένου αρχείου. Η επιλογή ‘Σύντομη Περιγραφή’ είναι προαιρετική και μπορείτε εάν θέλετε να την παραλείψετε. Επίσης μέσω του πλαισίου ελέγχου ‘Να ειδοποιηθούν οι χρήστες μέσω e-mail’ σας δίνεται η δυνατότητα να ενημερώνεται μέσω e-mail επιλεγμένους χρήστες για την αποστολή του συγκεκριμένου αρχείου.
<p><img src='$themeimg/warning.png' width=18 height=18> Στο συγκεκριμένο υποσύστημα πρέπει να ληφθούν υπόψη οι παρακάτω επισημάνσεις:
<ul>
  <li>Ο συνολικός αποθηκευτικός χώρος και για τους δυο καταλόγους είναι συγκεκριμένος και μπορεί να αλλάξει μόνο από τον διαχειριστή</li>
  <li>Για λόγους ασφαλείας εκτελέσιμα αρχεία  της μορφής *.exe δεν “Ανεβαίνουν” στην πλατφόρμα</li>
  <li>Όταν διαγράφετε ένα αρχείο δεν διαγράφεται από τη βάση δεδομένων της πλατφόρμας πάρα μόνο από τον συγκεκριμένο κατάλογο</li> 
</ul>
</p>
";
//===========================================================


$langDropbox_studentContent='<p>Ο Χώρος ‘Ανταλλαγής Αρχείων’ αποτελεί ένα εργαλείο ανταλλαγής ψηφιακού υλικού μεταξύ των Εκπαιδευομένων και Εκπαιδευτή. Μπορείτε να ανταλλάξετε οποιοδήποτε τύπο γνωστών αρχείων (doc,docx,odt,pdf κλπ).</p><p>Το υποσύστημα περιλαμβάνει δύο καταλόγους Ανταλλαγής Αρχείων:</p>
<p><b><u>Εισερχόμενα Αρχεία.</u></b> Στον συγκεκριμένο κατάλογο εμφανίζονται όλα τα αρχεία που έχετε παραλάβει από τον εκπαιδευτή ή άλλον εκπαιδευόμενο του μαθήματος. Πληροφορίες που αφορούν τα αρχεία όπως: το όνομα του χρήστη, το μέγεθος του αρχείου και την ημερομηνία αποστολής είναι στοιχεία τα οποία είναι αρκετά χρήσιμα για την πληροφόρηση σας. Για να διαγράψετε ένα εισερχόμενο αρχείο απλά πατήστε στο εικονίδιο (<img src="$themeimg/delete.png" width=10 height=10>) το οποίο βρίσκεται στην ίδια σειρά με το αρχείο προς διαγράφη. </p>
<p><b><u>Απεσταλμένα Αρχεία.</u></b> Στον συγκεκριμένο κατάλογο εμφανίζονται τα αρχεία που έχετε στείλει σε όλους τους εγγεγραμμένους στο μάθημα χρήστες (εκπαιδευόμενους, εκπαιδευτές) της πλατφόρμας μαζί με τις αντίστοιχες πληροφορίες. Για να στείλετε ένα αρχείο σε κάποιον χρήστη αρχικά επιλέξτε το σύνδεσμο "Ανέβασμα αρχείου". Εδώ πρέπει να καθορίσετε την θέση που βρίσκεται το αρχείο στον υπολογιστή σας μέσω της επιλογής "Browse" και εν συνεχεία να καθορήσετε τους παραλήπτες του συγκεκριμένου αρχείου. Η επιλογή ‘Σύντομη Περιγραφή’ είναι προαιρετική και μπορείτε εάν θέλετε να την παραλείψετε. Επίσης μέσω του πλαισίου ελέγχου ‘Να ειδοποιηθούν οι χρήστες μέσω e-mail’ σας δίνεται η δυνατότητα να ενημερώνεται μέσω e-mail επιλεγμένους χρήστες για την αποστολή του συγκεκριμένου αρχείου.</p>
<p><img src="$themeimg/warning.png" width=18 height=18> Στο συγκεκριμένο υποσύστημα πρέπει να ληφθούν υπόψη οι παρακάτω επισημάνσεις:
<ul>
  <li>Ο συνολικός αποθηκευτικός χώρος και για τους δυο καταλόγους είναι συγκεκριμένος και μπορεί να αλλάξει μόνο από τον διαχειριστή</li>
  <li>Για λόγους ασφαλείας εκτελέσιμα αρχεία  της μορφής *.exe δεν “Ανεβαίνουν” στην πλατφόρμα</li>
  <li>Όταν διαγράφετε ένα αρχείο δεν διαγράφεται από τη βάση δεδομένων της πλατφόρμας πάρα μόνο από τον συγκεκριμένο κατάλογο</li> 
</ul>
</p>
</p>';

$langHUsage = "Στατιστικά Χρήσης";
$langUsageContent = "<p> Το συγκεκριμένο υποσύστημα παρέχει την δυνατότητα εμφάνισης στατιστικών στοιχείων τα οποία αφορούν τόσο τα μαθήματα όσο και τους χρήστες. Μέσα από γραφικές παραστάσεις και λίστες τιμών έχετε στην διάθεση σας αρκετά <b>χρήσιμα</b> στοιχεία για την εξαγωγή συμπερασμάτων τα οποία αφορούν το μάθημα σας. Ενέργειες όπως η ‘Επίσκεψη χρηστών ανά μάθημα’ μπορεί να αποδεδειχθούν πολύ χρήσιμες για τον σχηματισμό γνώμης σχετικά με το ενδιαφέρον που προκαλεί το συγκεκριμένο μάθημα στους εκπαιδευόμενους.</p>
<p>Οι επιμέρους <b>κατηγορίες</b> στατιστικών στοιχείων τις οποίες υποστηρίζει η πλατφόρμα είναι οι εξής:</p>
<ul>
<li><b>Προτίμηση υποσυστημάτων</b>. Σύμφωνα με αυτή την λειτουργία περιγράφονται οι προτιμήσεις των χρηστών για τα διάφορα στοιχεία τις πλατφόρμας. Ο καθορισμός των παραμέτρων (Ημερομηνία Έναρξης, Ημερομηνία λήξης κλπ) που θα χρησιμοποιηθούν για να την αναζήτηση περιγράφεται αναλυτικά στην ενότητα ‘Προτίμηση Υποσυστημάτων’.</li>
<li><b>Επισκέψεις χρηστών στο μάθημα</b>. Η λειτουργία αυτή επιτρέπει την εμφάνιση των στοιχείων των χρηστών που έχουν πρόσβαση στο μάθημα. Παρουσιάζονται μεταξύ των άλλων το username του χρήστη, η διεύθυνσή του(ip address), καθώς  και η ημερομηνία εισόδου του.</li>
<li><b>Συμμετοχή χρηστών ανά μάθημα</b>. Μέσω της συγκριμένης επιλογής επιτρέπετε η  εμφάνιση  στοιχείων των εκπαιδευόμενων  οι οποίοι ανήκουν σε μια ομάδα μαθήματος. Παρουσιάζονται μεταξύ των άλλων το ονοματεπώνυμο του χρήστη, ο αριθμός μητρώου του (αφορά τους εκπαιδευόμενους),  η ομάδα χρηστών στην οποία ανήκει ο συγκεκριμένος χρήστης καθώς και διάρκεια περιήγησης του στο σύστημα.</li>
<li><b>Γραμμές μάθησης</b>. Μέσω της συγκριμένης λειτουργίας μπορείτε να δείτε την πρόοδο ενός εκπαιδευόμενου σχετικά με τις γραμμές μάθησης. Στοιχεία όπως: όνομα εκπαιδευόμενου, αριθμός μητρώου, ομάδα χρηστών στην οποία ανήκει καθώς και η παρουσίαση της προόδου του (κλίμακα %) είναι στην διάθεση σας για την εξαγωγή συμπερασμάτων.</li>
<li><b>Στατιστικά ομάδων χρηστών</b>. Χρήσιμες πληροφορίες σχετικά με τις ομάδες αναφέρονται στην συγκεκριμένη ενότητα. Τα όνομα της ομάδας, ο υπεύθυνος  αυτής, ο αριθμός των εγγεγραμμένων χρηστών αλλά και ο μέγιστος επιτρεπόμενος αριθμός χρηστών σε αυτή είναι στοιχεία τα οποία βοηθούν στην καλύτερη οργάνωση των ομάδων του μαθήματος σας.</li>
</ul>
<hr>
<p><b>Προτίμηση Υποσυστημάτων</b></p>
<p>Η προτίμηση υποσυστημάτων είναι  μια λειτουργία που  περιλαμβάνετε σε όλες τις παραπάνω κατηγορίες στατιστικών  και η οποία επιτρέπει τον καθορισμό των παραμέτρων οι οποίες  θα χρησιμοποιηθούν στην αναζήτηση των στατιστικών στοιχείων. Μπορείτε να καθορίσετε αρχικά το είδος των στατιστικών ανάλογα με των ‘Αριθμό των επισκέψεων’ ή  την ‘Διάρκεια’. Εν συνεχεία καθορίστε την ημερομηνία έναρξης και λήξης των  προς εμφάνιση στατιστικών στοιχείων. Αν θέλετε για συγκεκριμένο χρήστη αναζήτηση πατήστε το αρχικό γράμμα του επωνύμου του διαφορετικά επιλέξτε ‘Όλοι οι χρήστες’ από την λίστα τιμών. Η διαδικασία ολοκληρώνεται  πατώντας το κουμπί ‘ Υποβολή’.</p>
";

$langHPersonalStats = 'Τα στατιστικά μου';
$langPersonalStatsContent = '
<p>Το συγκεκριμένο υποσύστημα <b>παρουσιάζει</b> μια σειρά από χρήσιμα
στοιχεία σχετικά με τα μαθήματα. Εμφανίζονται σε μορφή γραφήματος οι επισκέψεις 
ανά μάθημα, οι πίνακες με τις συνολικές επισκέψεις (χρονική διάρκεια και χρόνος 
συμμετοχής) ανά μάθημα,
και οι επισκέψεις σας στην πλατφόρμα (ημερομηνία και ώρα εισόδου και 
εξόδου).</p>';

//Help Create Course Wizard
$langHCreateCourse = "Δημιουργία μαθήματος";
$langCreateCourseContent = "
<p>Το συγκεκριμένο υποσύστημα αποτελεί πολύ σημαντικό εργαλείο της πλατφόρμας, 
αφού μέσω αυτού ο εκπαιδευτής μπορεί να δημιουργεί νέα μαθήματα. Η ολοκλήρωση 
της διαδικασίας δημιουργίας αποτελείται από 3 βήματα, συγκριμένα:</p>
<p><b>Βήμα 1:</b> Αρχικά εισάγετε τα βασικά στοιχεία και τις πληροφορίες του 
μαθήματος. Αυτά αφορούν τον τίτλο του μαθήματος, την σχολή-τμήμα στο 
οποίο ανήκει (επιλογή από λίστα) το συγκεκριμένο μάθημα, τον 
εκπαιδευτή του μαθήματος, τον τύπο (προπτυχιακό – μεταπτυχιακό) και 
τέλος την γλώσσα που θα εμφανίζεται το συγκεκριμένο μάθημα.<br><br>
<img src='$themeimg/warning.png' width=18 height=18>
<b>Σημείωση:</b> Εάν αφήσετε κάποια πεδία κενά ενημερώνεστε από το σύστημα 
για το συγκεκριμένο θέμα και δεν μπορείτε να προχωρήσετε στο επόμενο 
βήμα.</p>
<p><b>Βήμα 2:</b> Στο βήμα αυτό εισάγετε συμπληρωματικές πληροφορίες μαθήματος. 
Οι πληροφορίες αυτές περιέχουν μια σύντομη περιγραφή του μαθήματος 
καθώς και κάποιες λέξεις κλειδιά οι οποίες θα βοηθήσουν στην καλύτερη 
κατανόηση των όρων που πραγματεύεται το συγκεκριμένο μάθημα.</p>
<p><b>Βήμα 3:</b> Πρόσβαση στο μάθημα και ενεργοποίηση εργαλείων. Σας δίνεται η 
δυνατότητα να καθορίσετε τον τρόπο πρόσβασης των χρηστών στο μάθημα. 
Η πλατφόρμα υποστηρίζει τους παρακάτω τρόπους πρόσβασης χρηστών:</p>
$langCourseAccessHelp
";

// ===== Wiki Help updated =============

$langWikiSyntaxHelp = "
<h4>Σύνταξη των εντολών</h4>
<p>Δημιουρία σελίδων wiki και συνδέσμων μεταξύ τους</p>
<p><strong>Λέξεις του wiki</strong>: Οι λέξεις του Wiki είναι λέξεις που είναι γραμμένες σαν <em>Λέξη</em>. Για να δημιουργήσετε μια σελίδα wiki ή ένα σύνδεσμο προς μια σελίδα wiki, διορθώστε μια υπάρχουσα και προσθέστε τον τίτλο της σελίδας σύμφωνα με την σύνταξη. Για παράδειγμα <em>Η σελίδα μου</em>, και ύστερα αποθηκεύστε την. Αυτόματα η λέξη <em>H σελίδα μου</em> θα αντικατασταθεί με ένα σύνδεσμο στη σελίδα Wiki <em>Η σελίδα μου</em>&nbsp;</p>
<p><strong>Σύνδεσμοι Wiki</strong>: Οι σύνδεσμοι Wiki είναι σαν τους υπερσυνδέσμους (βλέπε παρακάτω) εκτός του ότι δεν έχουν αναφορά σε κάποιο πρωτόκολλο (όπως π.χ. <em>http://</em> ή <em>ftp://</em>) και αυτόματα μετατρέπονται σε συνδέσμους σε σελίδες Wiki. Για να δημιουργήσουμε μια καινούρια σελίδα ή ένα σύνδεσμο σε μια υπάρχουσα, διορθώστε την σελίδα και προσθέστε <code>[τίτλο σελίδας]</code> ή <code>[όνομα συνδέσμου|τίτλο σελίδας]</code> προς το περιεχόμενο. Μπορείτε να χρησιμοποιήσετε την παρακάτω σύνταξη για να αλλάξετε το όνομα ενός συνδέσμου Wiki: <code>[όνομα συνδέσμου|λέξη]</code>.</p>
<ul>Υπερσύνδεσμοι
<li><code>[url]</code>, <code>[όνομα|url]</code>, <code>[όνομα|url|γλώσσα]</code> ή <code>[όνομα|url|γλώσσα|τίτλος]</code>.&nbsp;</li></ul>
<ul>Εισαγωγή Εικόνας
<li><code>((url|εναλλακτικό κείμενο))</code>, <code>((url|εναλλακτικό κείμενο|θέση))</code> ή <code>((url|εναλλακτικό κείμενο|θέση|περιγραφή))</code>. <br />Το όρισμα θέσης μπορεί να πάρει τις ακόλουθες τιμές: L (αριστερά), R (δεξιά) ή C (κέντρο).&nbsp;
Επίσης μπορείτε να χρησιμοποιήσετε την σύνταξη των υπερσυνδέσμων. Για παράδειγμα <code>[τίτλος|image.gif]</code>. Πλέον η σύνταξη τείνει να καταργηθεί οπότε καλύτερα να χρησιμοποιήτε την προηγούμενη &nbsp;</li></ul>
<ul>Σύνδεσμο σε εικόνα
<li>σαν τους υπερσυνδέσμου απλά βάλτε ένα 1 σαν πέμπτο όρισμα για να αποφύγετε το φόρτωμα της εικόνας οπότε θα πάρετε ένα υπερσύνδεσμο σε μια εικόνα. Για παράδειγμα <code>[εικόνα|image.gif||0]</code> θα παρουσιάσει ένα σύνδεσμο στην εικόνα image.gif αντί για την ίδια την εικόνα.</li></ul>
<p>Σελιδοποίηση</p>
<ul>
<li><strong>Πλάγια</strong>: περικλείστε το κείμενό σας με απλά εισαγωγικά <code>''κείμενο''</code>&nbsp;</li>
<li><strong>Έντονα</strong>: περικλείστε το κείμενό σας με τρία απλά εισαγωγικά <code>'''text'''</code>&nbsp;</li>
<li><strong>Υπογραμμισμένα</strong>: περικλείστε το κείμενό σας με 2 χαρακτήρες υπογράμμισης <code>__κείμενο__</code>&nbsp;</li>
<li><strong>Διαγραμμισμένα</strong>: περικλείστε το κείμενό σας με δύο παύλες <code>--κείμενο--</code>&nbsp;</li>
<li><strong>Τίτλος</strong>: <code>!!!</code>, <code>!!</code>, <code>!</code> για τίτλους, υπότιτλους, υπο-υπότιτλους αντίστοιχα&nbsp;</li>
<li>Λίστα</li>
Η γραμμή πρέπει να ξεκινάει με <code>*</code> (μη διατεταγμένη λίστα) ή <code>#</code> (διατεταγμένη λίστα). Μπορείτε να ανακατέψετε λίστες (<code>*#*</code>) για να δημιουργήσετε λίστες πολλών επιπέδων.&nbsp;
<li>Παράγραφος</li>
Χωρίστε τις παραγράφους με μία ή περισσότερες γραμμές&nbsp;
</ul>

<h4>Προχωρημένη σύνταξη</h4>
<ul>
<li>Υποσημείωση</li>
<code>$$ κείμενο υποσημείωσης$$</code>&nbsp;
<li>Κείμενο με έτοιμη μορφοποίηση</li>
Ξεκινήστε κάθε γραμμή με ένα κενό &nbsp;
<li>Μπλόκ αναφοράς</li>
<code>&gt;</code> ή <code>;:</code> πριν από κάθε γραμμή &nbsp;
<li>Οριζόντια γραμμή</li>
<code>----</code>&nbsp;
<li>Αναγκαστική αλλαγή γραμμής</li>
<code>%%%</code>&nbsp;
<li>Ακρωνύμιο</li>
<code>??ακρωνύμιο??</code> ή <code>??ακρωνύμιο|ορισμός??</code>&nbsp;
<li>Άμεση αναφορά</li>
<code>{{αναφορά}}</code>, <code>{{αναφορά|γλώσσα}}</code> ή <code>{{αναφορά|γλώσσα|url}}</code>&nbsp;
</ul>
</ul>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει το σύστημα Wiki από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";

$langHWiki = "Wiki";
$langHWiki_student = $langHWiki ;
$langWikiContent = "<p>Μέσω του υποσυστήματος <b>Wiki</b> δίνεται η δυνατότητα σε εκπαιδευόμενους και εκπαιδευτές να δημιουργούν συνεργατικά κείμενα. Αυτό επιτυγχάνεται με τη χρήση ενός απλού φυλλομετρητή (browser). Για το λόγο αυτό, τα <b>Wikis</b> είναι ένα χρήσιμο εργαλείο για τη συνεργασία ομάδων εκπαιδευόμενων στο πλαίσιο του μαθήματος. </p>
<p>Για να δημιουργήσετε ένα νέο <b>Wiki</b> πατήστε απλά στο σύνδεσμο 'Δημιουργήστε ένα νέο Wiki'. Στην εμφανιζόμενη οθόνη επιλέξτε τον τίτλο του Wiki, δώστε την περιγραφή του και πατήστε στα κουμπία 'Αποθήκευση' ή 'Ακύρωση' για την αντίστοιχη εργασία.</p>
<p>Μια σειρά ενεργειών είναι στην διάθεση σας σχετικά με το Wiki. Συγκεριμένα: </p>

<ul>
<li><b>Πρόσφατες αλλαγές.</b> Μέσω αυτής της επιλογής σας δίνετε η δυνατότητα να παρακολουθήσετε τις πρόσφατες αλλαγές που έχουν πραγματοποιηθεί σε ένα Wiki. Ενέργειες όπως η <img src='$themeimg/wiki.png' align='absmiddle'> εμφάνιση της κύριας σελίδας του Wiki, <img src='$themeimg/book.png' align='absmiddle'> εμφάνιση όλων των σελίδων, <img src='$themeimg/list.png' align='absmiddle'> εμφάνιση της λίστας του Wiki είναι στην διάθεση σας μέσω του συγκριμένης υποκατηγορίας.</li>
<li><b>Αλλαγή ιδιοτήτων</b> <img src='$themeimg/edit.png' align='absmiddle'>. Μπορείτε να αλλάξετε τον τίτλο και την περιγραφή συγκεκριμένου Wiki μέσω αυτής της επιλογής. </li>
<li><b>Διαγραφή.</b> Για να διαγράψετε ένα Wiki απλά πατήστε στο κουμπί (<img src='$themeimg/delete.png' width=16 height=16>) το οποίο βρίσκεται δεξιά του</li>
</ul>

$langWikiSyntaxHelp";

$langWiki_studentContent = "
<p>Μέσω του υποσυστήματος <b>Wiki</b> δίνεται η δυνατότητα σε εκπαιδευόμενους και εκπαιδευτές να δημιουργούν συνεργατικά κείμενα. Αυτό επιτυγχάνεται με τη χρήση ενός απλού φυλλομετρητή (browser). Για το λόγο αυτό, τα <b>Wikis</b> είναι ένα χρήσιμο εργαλείο για τη συνεργασία ομάδων εκπαιδευόμενων στο πλαίσιο του μαθήματος. </p>
<p>Μια σειρά ενεργειών είναι στην διάθεση σας σχετικά με το Wiki. Συγκεριμένα: </p>


<p><b>Πρόσφατες αλλαγές.</b> Μέσω αυτής της επιλογής σας δίνετε η δυνατότητα να παρακολουθήσετε τις πρόσφατες αλλαγές που έχουν πραγματοποιηθεί σε ένα Wiki. Ενέργειες όπως η  <img src='$themeimg/wiki.png' align='absmiddle'> εμφάνιση της κύριας σελίδας του Wiki, <img src='$themeimg/book.png' align='absmiddle'> εμφάνιση όλων των σελίδων, <img src='$themeimg/list.png' align='absmiddle'>εμφάνιση της λίστας του Wiki είναι στην διάθεση σας μέσω του συγκριμένης υποκατηγορίας.</p>
</p>

$langWikiSyntaxHelp";

// Help Course Units
$langHAddCourseUnits = "Προσθήκη/Διόρθωση θεματικής ενότητας";
$langAddCourseUnitsContent = "<p class='helptopic'>Για να προσθέσετε μια νέα θεματική ενότητα εισάγετε ένα τίτλο και μια σύντομη περιγραφή της ενότητας. Μόλις ολοκληρώσετε κάντε κλικ στο πλήκτρο 'Προσθήκη' για να προστεθεί μια νέα θεματική ενότητα.</p>";

$langHAddCourseUnitscontent = "Προσθήκη περιεχομένου θεματικής ενότητας";
$langAddCourseUnitscontentContent = "<p class='helptopic'>Σε αυτή την οθόνη προστίθεται περιεχόμενο ή πόροι στην επιλεγμένη θεματική ενότητα. Το είδος των πόρων που μπορούν να προστεθούν αναφέρονται δίπλα από την λέξη 'Προσθήκη:'. Κάνοντας κλικ στο 'Προσθήκη' εμφανίζονται οι διαθέσιμοι πόροι του μαθήματος που αντιστοιχούν στον επιλεγμένο τύπο. Επιλέξτε τους πόρους που επιθυμείται και μετά κάντε κλικ στο 'Προσθήκη επιλεγμένων'. Κάθε πόρος που προστίθεται, εμφανίζεται σε λίστα ενώ δεξιά του εμφανίζονται τα εικονίδια διόρθωσης και διαγραφής. Σημειώστε ότι στην περίπτωση που υπάρχουν περισσότερες από μία θεματικές ενότητες σε ένα μάθημα, εμφανίζεται σύνδεσμοι προς την επόμενη ή την προηγούμενη ενότητα. Εναλλακτικά μπορεί να χρησιμοποιηθεί και ο κατάλογος επιλογών που εμφανίζεται στο κάτω μέρος της σελίδας, για να μπορεί να γίνει μετάβαση απ' ευθείας σε κάποια ενότητα.</p>";

// ======= Help Gloggary updated ===============
$langHGlossary = "Γλωσσάριο";
$langHGlossary_student = $langHGlossary;
$langGlossaryContent = "
<p>Ο εκπαιδευτής του μαθήματος έχει την δυνατότητα της προσθήκης και διαχείρισης των όρων που θα περιλαμβάνονται στο γλωσσάριο του μαθήματος. Αφού εισέρθετε στο μενού του μαθήματος, επιλέγετε το σύνδεσμο «Γλωσσάριο» που βρίσκεται στο αριστερό μέρος της σελίδας. Μπορείτε να επιλέξετε αν επιθυμείτε την εμφάνιση των ορισμών στις σελίδες του μαθήματος,  πατώντας «Ρυθμίσεις» στο δεξιό μέροςτου γλωσσαρίου και στη συνέχεια επιλέγοντας το πεδίο με την ένδειξη  «Εμφάνιση ορισμών στις σελίδες του μαθήματος».  Επιλέγετε «Υποβολή» και η διαδικασία έχει ολοκληρωθεί επιτυχώς. Στην οθόνη εμφανίζεται το σχετικό ενημερωτικό μήνυμα.</p>
<p>Μια σειρά ενεργειών είναι διαθέσιμες για το υποσύστημα ‘Γλωσσάριo'.</p>
<hr>
<p><strong>Εισαγωγή όρου στο Γλωσσάριο</strong></br>
Για να εισάγετε ένα νέο όρο στο Γλωσσάριο:
<ul>
  <li>Επιλέγετε το σύνδεσμο «Προσθήκη Όρου» που βρίσκεται στο δεξιό μέρος της σελίδας. Η επιλογή  του συνδέσμου σας παραπέμπει στην κενή φόρμα όπου μπορείτε να εισάγετε τον όρο  και τον ορισμό του </li>
  <li>Συμπληρώνετε τον όρο την επεξήγηση αλλά και το URL ορισμού στα αντίστοιχα πεδία </li>
  <li>Επιλέγετε «Υποβολή» για την καταχώρησή του </li>
</ul>
<hr> 
  <p><strong>Διαχείριση όρων γλωσσάριου</strong><br />
  Μετά την προσθήκη, σας δίνεται η δυνατότητα είτε να επέμβετε  στον ορισμό για πιθανές διορθώσεις ή ακόμα και να τον διαγράψετε από τη λίστα.  Η επιλογή μπορεί να γίνει από τους αντίστοιχους συνδέσμους που βρίσκονται στο  υπομενού «Ενέργειες».</p><br />
<hr>
  <p><strong>Διαγραφή όρου</strong><br />
  Η διαγραφή ενός όρου επιτυγχάνεται με το πάτημα του κουμπιού (<img src='$themeimg/delete.png' width=16 height=16>) και την εμφάνιση ενός παραθύρου για την επιβεβαίωση της διαγραφής.  Πατώντας «ΟΚ» ο όρος διαγράφεται επιτυχώς και στην οθόνη  εμφανίζεται το σχετικό ενημερωτικό μήνυμα.</p>
  <br/>
  <hr> 
  <p><strong>Λήψη όρων γλωσσάριου σε μορφή csv </strong></br>
  Ο διαχειριστής ηλεκτρονικού μαθήματος έχει επίσης τη δυνατότητα να κατεβάσει όλους τους όρους που συμπεριλαμβάνονται στο γλωσσάριο  του ηλεκτρονικού μαθήματος σε μορφή comma-separated values  (csv). 
  Ο όρος comma-separated values αφορά σε ένα σύνολο από μορφές αρχείων που χρησιμοποιούνται για την αποθήκευση δεδομένων σε πίνακα στον  οποίο οι διάφοροι αριθμοί και το κείμενο αποθηκεύονται σε μορφή απλού κειμένου  η οποία μπορεί να διαβαστεί από ένα πρόγραμμα επεξεργασίας κειμένου. Οι γραμμές  στο αρχείο κειμένου αντιπροσωπεύουν γραμμές ενός πίνακα, και τα κόμματα σε μια  γραμμή ξεχωρίζουν τα πεδία στις γραμμές του πίνακα.
  Προκειμένου να πραγματοποιήσετε τη λήψη των όρων του γλωσσάριου σε μορφή csv ορίζετε την επιθυμητή κωδικοποίηση επιλέγοντας μεταξύ UTF8 και Windows 1253.  Με την επιλογή αυτή, το πρόγραμμα πλοήγησης που χρησιμοποιείτε θα σας εμφανίσει  ένα μήνυμα με το οποίο θα σας καλεί είτε να ανοίξετε απευθείας το σχετικό  αρχείο, ή να ορίσετε την ακριβή τοποθεσία που επιθυμείτε να το αποθηκεύσετε.</p>
";
//=================================================



$langGlossary_studentContent = "
<p>Πρόκειται για ένα υποσύστημα παρουσίασης <b>ορισμών</b> για όρους – λέξεις οι οποίοι  χρησιμοποιούνται στο ηλεκτρονικό μάθημα. Το γλωσσάρι είναι ένα πολύ σημαντικό εκπαιδευτικό εργαλείο, που δημιουργήθηκε με σκοπό να βοηθήσει κυρίως τους εκπαιδευόμενους να έχουν μια ευκολότερη προσαρμογή στο γνωστικό αντικείμενο του μαθήματος. Οι όροι του γλωσσαρίου και η επεξήγηση τους εμφανίζονται σε <b>λίστα</b> η οποία είναι ταξινομημένη με αλφαβητική σειρά. Το συγκεκριμένο υποσύστημα επιτρέπει (εφόσον έχει ενεργοποιήσει αυτή την δυνατότητα ο υπεύθυνος του μαθήματος) την εμφάνιση των όρων του λεξικού <b>μέσα</b> στα κείμενα του μαθήματος και μάλιστα με διαφορετική μορφοποίηση από αυτά για ευκολότερη ανάγνωση. Με αυτό τον τρόπο μπορείτε εύκολα να βλέπετε τις επεξηγήσεις των αντίστοιχων όρων περνώντας απλά τον δείκτη του ποντικιού σας πάνω από τον όρο. Επίσης εάν η επεξήγηση ενός όρου περιλαμβάνει κάποιο ενεργό σύνδεσμο (link) από το διαδίκτυο πατώντας πάνω στο σύνδεσμο μεταφέρεστε στην αντίστοιχη σελίδα η οποία για παράδειγμα θα μπορούσε να περιέχει ένα πλήρη ορισμό για τον συγκριμένο όρο.</p>
</p>";
//=======================================================================




//========  Help eBook updated ============= 
$langHEBook = "Ηλεκτρονικό Βιβλίο";
$langHEBook_student = $langHEBook;
$langEBookContent = "
<p>Το 'Hλεκτρονικό βιβλίο' είναι ένα σύνολο υπερκειμένων (hypertext) το οποίο 'προσομοιάζει' το έντυπο βιβλίο. Ουσιαστικά ένα ηλεκτρονικό βιβλίο είναι μια ευέλικτη δομή που εκτός από κείμενο σε ψηφιακή μορφή μπορεί επιπρόσθετα να είναι εμπλουτισμένο με στοιχεία πολυμέσων όπως: εικόνες, βίντεο, εξωτερικούς συνδέσμους (links), κλπ. Παράλληλα το συγκεριμένο υποσύστημα επιτρέπει τη διαμόρφωση των περιεχομένων σε ενότητες - υποενότητες. Η παρουσίαση των περιεχομένων γίνεται με λίστα επιλογής (list box).</p>
<hr>
<h2>&nbsp;&nbsp;Προετοιμασία (Βήμα 1)</h2>
<p>Για να δημιουργήσουμε ένα νέο 'Ηλεκτρονικό Βιβλίο' θα πρέπει να διενεργήσουμε ένα στάδιο προετοιμασίας το οποίο αφορά τη <b>δημιουργία </b> των σχετικών(html) αρχείων τα οποία θα αποτελέσουν το περιεχόμενο του Ηλ. Βιβλίου. Ειναι σημαντκό να τηρηθούν κάποιοι απλοί κανόνες (προδιαγραφές) οι οποίοι επηρρεάζουν άμεσα το οπτικό αποτέλεσμα και περιλαμβάνουν τα ακόλουθα:</p>
<ol>
  <li> Κάθε αρχείο (html) θα πρέπει να περιέχει μία υποενότητα του Ηλ. Βιβλίου (σχετίζεται με την εσωτερική πλοήγηση στο Ηλ. Βιβλίο).</li>
  <li>Η ετικέτα (title) κάθε αρχείου (html) θα πρέπει να διαθέτει τον ακριβή τίτλο της ενότητας που περιέχει (θα χρησιμοποιηθεί από το σύστημα για τη δημιουργία των αντίστοιχων συνδέσμων πλοήγησης στο Ηλ. Βιβλίο).</li>
  <li> Όλα τα αρχεία (html) μαζί με τα απαραίτητα αρχεία που τα συνοδεύουν (π.χ. εικόνες, css), θα πρέπει να είναι τοπικά αποθηκευμένα σε ένα συμπιεσμένο φάκελο (zip).</li>

</ol>
<hr>
<h2>&nbsp;&nbsp;Δημιουργία Hλ. Bιβλίου (Βήμα 2)</h2>

<ol>
  <li>Αρχικά θα πρέπει να εισέλθετε στην πλατφόρμα ως διαχειριστής του ηλεκτρονικού μαθήματος στο οποίο θα δημιουργηθεί το Ηλ. Βιβλίο. </li>
  <li>Επιλέξτε από την κύρια οθόνη του μαθήματος το υποσύστημα <strong>'Ηλεκτρονικό Βιβλίο'</strong></li>
  <li>Πατήστε στον σύνδεσμο <strong>'Δημιουργία'</strong> στην εμφανιζόμενη οθόνη  
    <ul>

      <li>Εισάγετε τον <strong>Τίτλο</strong> του Ηλ. Βιβλίου και</li>
      <li>Καθορίστε τη θέση (τοπικά στον Η/Υ σας) που είναι αποθηκευμένα τα  αρχεία (html).</li>
    </ul>
  </li>
    <li>Πατήστε <strong>'Αποστολή'</strong>.</li>
  <li>Στη συνέχεια, <strong>ενεργοποιήσετε</strong> το υποσύστημα Ηλ. Βιβλίο (εάν δεν είναι ενεργοποιημένο) μέσω των 'Εργαλείων διαχείρισης'. <br />

  </li>
</ol>
<hr>
<h2>&nbsp;&nbsp;Δομή Ηλ. Βιβλίου (Βήμα 3)</h2>

<p>Το παραπάνω βήμα (Βήμα 2)εμφανίζει μια οθόνη με πολλαπλές επιλογές και έναν πίνακα με τα αρχεία (html) που ανεβάσατε. Μπορείτε να καθορίσετε τη δομή που επιθυμείτε για ένα βιβλίο, ως εξής:</p>

<ol>
  <li>Αρχικά ξεκινήσετε με τις <strong>Ενότητες</strong> του βιβλίου, προσθέτοντας όσες ενότητες χρειάζεστε. Δηλώστε τον <strong>αύξοντα αριθμό</strong> και το <strong>όνομα</strong> της κάθε ενότητας στα πεδία <strong>Α/Α</strong> και <strong>Τίτλος</strong> αντίστοιχα. </li>

  <li>Στη συνέχεια, διαμορφώστε τις <strong>Υποενότητες</strong> του βιβλίου. Για να γίνει αυτό θα πρέπει:
    <ul>
      <li>να <strong>αντιστοιχίσετε</strong> κάθε αρχείο που έχετε ανεβάσει με τις ενότητες που ορίσατε  παραπάνω.</li>
      <li> να ορίσετε στο πεδίο 'Υποενότητα' τον αύξοντα αριθμό που έχει η υποενότητα μέσα στην Ενότητα στην οποία ανήκει.  <br />

      <em><u>Σημείωση</u>:  η πλατφόρμα προτείνει αυτόματα ως τίτλους υποενοτήτων, τους τίτλους των αντίστοιχων  αρχείων (μπορείτε να τους αλλάξετε στη συνέχεια).</em></li>
    </ul>  
</li>
  <li>Αφού ολοκληρωθεί η αντιστοίχιση των αρχείων με τις Ενότητες και τις Υποενότητες, πατάτε <strong>'Υποβολή'</strong>. </li>
  <li>Το σύστημα σας ενημερώνει για την επιτυχή αλλαγή των στοιχείων και το 'Ηλεκτρονικό Βιβλίο' είναι πλέον διαθέσιμο στη μορφή που εσείς ορίσατε.</li>
</ol>

<hr>
<h2>&nbsp;&nbsp;Πλοήγηση σε Hλ. Bιβλίο</h2>

<p>Επιλέξτε από το κεντρικό μενού (αριστερά) το υποσύστημα 'Ηλεκτρονικό Βιβλίο' και από τη λίστα κάνετε κλικ στο όνομα του Ηλ. βιβλίου που επιθυμειτε να πλοηγηθείτε.</p> 

<hr>

<h2>&nbsp;&nbsp;Αλλαγή - Διαγραφή Ηλ. Βιβλίου</h2>
<p>Αν επιθυμείτε  να τροποποιήσετε κάποιο Ηλ. Βιβλίο, από το κεντρικό μενού (αριστερά) θα πρέπει να επιλέξετε το υποσύστημα 'Ηλεκτρονικό Βιβλίο' για να εμφανιστεί η λίστα με τα διαθέσιμα Ηλεκτρονικά Βιβλία του μαθήματος. Εκεί πρέπει πατήστε το αντίστοιχο εικονίδιο<strong>'Αλλαγή'</strong>. <br />
<br />
Για να <strong>διαγράψετε</strong> ένα Ηλ. Βιβλίο θα πρέπει όμοια από το κεντρικό μενού (αριστερά) να επιλέξετε το υποσύστημα 'Ηλεκτρονικό Βιβλίο' για να εμφανιστεί η λίστα με τα διαθέσιμα Ηλεκτρονικά Βιβλία του μαθήματος και να πατήσετε στο αντίστοιχο εικονίδιο <strong>'Διαγραφή'</strong>.</p>
<hr>
<h2>&nbsp;&nbsp;Διαχείριση αρχείων (html)</h2>
<p>Αν επιθυμείτε να διαχειριστείτε τα αρχεία (html) που έχετε ανεβάσει σε ένα συγκεκριμένο Ηλ. Βιβλίο, θα πρέπει  </p>
<ul>
  <li>από το κεντρικό μενού (αριστερά) να κάνετε κλικ στο υποσύστημα Ηλεκτρονικό Βιβλίο και από τη λίστα να πατήσετε το αντίστοιχο εικονίδιο για <strong>'Αλλαγή'</strong>,</li>
  <li>επιλέξτε <strong>'Διαχείριση Αρχείων'</strong>, όπου θα εμφανιστεί μία σελίδα όπου θα φαίνεται ο κατάλογος με τα αρχεία html που έχετε ανεβάσει για το ηλεκτρονικό βιβλίο,</li>
  <li>μπορείτε να διαχειριστείτε τον κατάλογο αυτό και τα αρχεία που περιέχει όπως ακριβώς και τα έγγραφα του μαθήματος.</li>
</ul>
<hr>


<h2>&nbsp;&nbsp;Σύνδεση με Θεμ. Ενότητες</h2>
<p>Μπορείτε να συνδέσετε σε μία θεματική ενότητα του μαθήματος σας, την αντίστοιχη <strong>ενότητα</strong> του <strong>ηλεκτρονικού βιβλίου</strong>. Για να το κάνετε αυτό, μπείτε στην ενότητα του μαθήματος στην οποία θέλετε να συνδέσετε το ηλεκτρονικό βιβλίο και από τη γραμμή με τα διαθέσιμα εργαλεία, επιλέξτε <strong>'Προσθήκη Ηλεκτρονικού Βιβλίου'</strong>. Θα εμφανιστεί μία σελίδα στην οποία θα πρέπει να επιλέξετε την ενότητα του ηλεκτρονικού βιβλίου που θέλετε να συνδέσετε. Στη συνέχεια πατήστε <strong>'Προσθήκη Επιλεγμένων'</strong>. </p>
";
$langEBook_studentContent = "
<p>Το 'Ηλεκτρονικό βιβλίο' είναι ένα σύνολο <b>υπερκειμένων</b> (hypertext) το οποίο 'προσομοιάζει' το έντυπο βιβλίο. Ουσιαστικά ένα ηλεκτρονικό βιβλίο είναι μια ευέλικτη δομή που εκτός από κείμενο σε ψηφιακή μορφή μπορεί επιπρόσθετα να είναι εμπλουτισμένο με στοιχεία πολυμέσων όπως: εικόνες, βίντεο, εξωτερικούς συνδέσμους (links), κλπ. Παράλληλα το συγκεκριμένο υποσύστημα επιτρέπει τη διαμόρφωση των περιεχομένων σε ενότητες - υποενότητες. Η παρουσίαση των περιεχομένων γίνεται με λίστα επιλογής (list box).Η πλοήγηση μέσα στο ηλεκτρονικό βιβλίο πραγματοποιείται με φιλικό τρόπο καθώς υπάρχουν ελεγκτήρια χειρισμού διαφόρων ενεργειών  πχ.  εμπρός-πίσω.</p> 

";
