<?
/*========================================================================
*   Open eClass 2.3
*   E-learning and Course Management System
* ========================================================================
*  Copyright(c) 2003-2010  Greek Universities Network - GUnet
*  A full copyright notice can be read in "/info/copyright.txt".
*
*  Developers Group:	Costas Tsibanis <k.tsibanis@noc.uoa.gr>
*			Yannis Exidaridis <jexi@noc.uoa.gr>
*			Alexandros Diamantidis <adia@noc.uoa.gr>
*			Tilemachos Raptis <traptis@noc.uoa.gr>
*
*  For a full list of contributors, see "credits.txt".
*
*  Open eClass is an open platform distributed in the hope that it will
*  be useful (without any warranty), under the terms of the GNU (General
*  Public License) as published by the Free Software Foundation.
*  The full license can be read in "/info/license/license_gpl.txt".
*
*  Contact address: 	GUnet Asynchronous eLearning Group,
*  			Network Operations Center, University of Athens,
*  			Panepistimiopolis Ilissia, 15784, Athens, Greece
*  			eMail: info@openeclass.org
* =========================================================================*/

$langWindowClose="Κλείσιμο παραθύρου";

$langHDefault='Βοήθεια μη διαθέσιμη';
$langDefaultContent='<p>Δεν υπάρχει κείμενο βοήθειας για την περιοχή
της πλατφόρμας στην οποία βρίσκεστε.</p>';

// PHPMATHPUBLISHER : HELP
$langPHPMathPublisher="<p><u>Υποστήριξη μαθηματικών συμβόλων:</u>
<br />
Για την ενσωμάτωση μαθηματικών συμβόλων στα κείμενα σας, μπορείτε να χρησιμοποιείτε τις <a href=\"../../manuals/PhpMathPublisherHelp.pdf\" target=\"_Blanc\">εντολές</a> (συμβολισμούς) που παρέχει το PhpMathPublisher. <br />
Πιο αναλυτικά, χρησιμοποιήστε τον συντάκτη κειμένου για να εισάγετε το περιεχόμενό σας. Αν στο περιεχόμενο που εισάγετε υπάρχουν μαθηματικά σύμβολα που επιθυμείτε να εμφανίσετε, τότε:
<ol>
  <li>Κάντε κλικ στο εικονίδιο 'Μετάβαση σε κώδικα HTML'.</li>
  <li>Εισάγετε το μαθηματικά σύμβολα σας μεταξύ των tags &lt;m>.....&lt;/m></li>
</ol>
<p>Για την εύρεση των εντολών που αντιστοιχούν στα συγκεκριμένα σύμβολα που επιθυμείτε να εισάγετε, συμβουλευθείτε (<a href=\"../../manuals/PhpMathPublisherHelp.pdf\" target=\"_Blanc\">εδώ</a>).<br />
Π.χ. για να εισάγετε την τετραγωνική ρίζα του a πληκτρολογήστε &lt;m>sqrt{a}&lt;/m></p>";


// help_forums.php
$langHFor="Περιοχές συζητήσεων";
$langHFor_student=$langHFor;
$langForContent="<p>Οι περιοχές συζητήσεων είναι ένα εργαλείο για ασύγχρονη
γραπτή επικοινωνία. Ενώ το ηλεκτρονικό ταχυδρομείο επιτρέπει το διάλογο ανάμεσα
σε δύο μόνο άτομα, οι περιοχές συζητήσεων επιτρέπουν δημόσιες συζητήσεις. Από
τεχνική άποψη, για τη χρήση μιας περιοχής συζητήσεων απαιτείται μόνο ένα
πρόγραμμα browser.</p>
<p>Για την οργάνωση των περιοχών συζητήσεων, κάντε κλικ στο «Διαχείριση». Οι
συζητήσεις είναι οργανωμένες σε σύνολα και υποσύνολα ως εξής:</p>
<p><b>Κατηγορία > Περιοχή > Θέμα > Απαντήσεις</b></p>

<p>Για να έχετε τακτοποιημένες τις συζητήσεις των φοιτητών σας, είναι
απαραίτητο να οργανώσετε κατηγορίες και περιοχές από πριν, και να αφήσετε τη
δημιουργία των θεμάτων και των απαντήσεων σε αυτούς. Οι περιοχές συζητήσεων του
Open eClass έχουν μια περιοχή συζήτησης και ένα θέμα ως δείγματα.</p>

<p>Το πρώτο πράγμα που πρέπει να κάνετε είναι να διαγράψετε το δοκιμαστικό θέμα
και να μετονομάσετε την περιοχή συζήτησης. Στη συνέχεια, μπορείτε να
δημιουργήσετε και άλλες περιοχές, κατά ομάδες ή κατά θέματα, που να ταιριάζουν
στις εκπαιδευτικές σας ανάγκες.</p> <p>Μην ανακατεύετε τις κατηγορίες και τις
περιοχές συζητήσεων, και μην ξεχνάτε ότι μια κενή κατηγορία (χωρίς περιοχές)
δεν εμφανίζεται στις σελίδες που βλέπουν οι φοιτητές.</p>

<p>Η περιγραφή κάποιας περιοχής μπορεί να περιλαμβάνει τον κατάλογο των μελών
της, το σκοπό της, κάποιο έργο ή θέμα, κλπ.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τις περιοχές συζητήσεων από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";

$langForContent_student= "<p>Η πλατφόρμα παρέχει τη δυνατότητα δημιουργίας περιοχών συζητήσεων επιτρέποντας τη συμμετοχή σε όλους τους εγγεγραμμένους στο μάθημα χρήστες (εκπαιδευτές και εκπαιδευόμενους).
</p>" ;

$langHInit = "Αρχική Σελίδα";
$langInitContent = "<p class='helptopic'>Βρίσκεστε στην Αρχική Σελίδα της
πλατφόρμας Open eClass. Για να χρησιμοποιήσετε την πλατφόρμα πληκτρολογήστε το όνομα
χρήστη και το συνθηματικό σας. Αν δεν θυμάστε τα στοιχεία σας, κάντε κλικ στο
σύνδεσμο 'Ξεχάσατε το συνθηματικό σας' και στην φόρμα που θα σας εμφανιστεί,
συμπληρώστε την ηλεκτρονική σας διεύθυνση που δηλώσατε κατά την εγγραφή σας
στην πλατφόρμα για να σταλούν τα στοιχεία σας.</p>

<p class='helptopic'>Αν είστε φοιτητής και δεν έχετε λογαριασμό, κάντε κλικ στο
σύνδεσμο 'Εγγραφή Φοιτητή' για να αποκτήσετε. Αν θέλετε να αποκτήσετε
λογαριασμό με δικαιώματα 'καθηγητή', κάντε κλικ στο σύνδεσμο 'Εγγραφή καθηγητή'
για να συμπληρώσετε την 'Αίτηση Εγγραφής Καθηγητή'</p>

<p class='helptopic'>Για περισσότερες πληροφορίες σχετικά με τη λειτουργία της
πλατφόρμας διαβάστε τα σχετικά εγχειρίδια χρήσης.</p>";

$langHInit_student = $langHInit;
$langInit_studentContent = $langInitContent;

$langHPortfolio="Χαρτοφυλάκιο χρήστη";
$langPortfolioContent="<p>Σε αυτή τη σελίδα εμφανίζονται τα μαθήματα στα
οποία είστε εγγεγραμμένος (ως φοιτητής) ή έχετε δημιουργήσει (ως καθηγητής).
Μπορείτε να παρακολούθησετε όποιο επιθυμείτε επιλέγοντας τον αντίστοιχο
τίτλο.</p>

<p>Μέσω των συνδέσμων του μενού, μπορείτε να εγγραφείτε σε άλλα μαθήματα ή
να απεγγραφείτε από αυτά που παρακολουθείτε, να αλλάξετε τα στοιχεία του
προφίλ σας όπως όνομα, συνθηματικό και προτιμώμενη γλώσσα, καθώς και
να δείτε συγκεντρωτικά τις ανακοινώσεις και το ημερολόγιο των μαθημάτων
σας.</p>
<p>Σε κάθε ενότητα, δίπλα σε κάθε μάθημα, στην στήλη ενέργειες, υπάρχει 
το εικονίδιο (<img style='border:0px;' src='template/classic/img/referencement.gif' width=10 height=10 align=basename border='0'></img>)
. Ανάλογα με τα προνόμια του χρήστη επιτρέπονται διαφορετικές λειτουργίες.
";
$langHPortfolio_student = $langHPortfolio;
$langPortfolio_studentContent = $langPortfolioContent;

$langHcourse_home='Κεντρική σελίδα μαθήματος';
$langHcourse_home_student=$langHcourse_home ;
$langcourse_home_studentContent='<p>Βρίσκεστε στην κεντρική σελίδα του
ηλεκτρονικού μαθήματος. Από τις επιλογές του μενού στο αριστερό μέρος της
οθόνης, μπορείτε να μεταβείτε στα υποσυστήματα που έχουν ενεργοποιηθεί από
τους διδάσκοντες του μαθήματος.</p>';

$langcourse_homeContent='<p class="helptopic">Βρίσκεστε στην κεντρική σελίδα του
ηλεκτρονικού μαθήματός σας. Από τις επιλογές του μενού στο αριστερό μέρος της
οθόνης, μπορείτε να μεταβείτε στα υποσυστήματα του μαθήματος, στα οποία
μπορείτε να προσθέσετε το εκπαιδευτικό υλικό του μαθήματος. Τα
ενεργά εργαλεία είναι διαθέσιμα και στους φοιτητές/επισκέπτες του μαθήματος,
ενώ τα ανενεργά εμφανίζονται μόνο στο διδάσκοντα.</p>
<p class="helptopic">Από τα εργαλεία διαχείρισης μπορείτε να ενεργοποιήσετε ή να
απενεργοποιήσετε τα υποσυστήματα που επιθυμείτε, να διαχειριστείτε
τους εγγεγραμμένους χρήστες, να αλλάξετε διάφορες επιλογές του μαθήματος
(όπως τίτλο, έλεγχο πρόσβασης κλπ.), και να λάβετε στατιστικά χρήσης
του μαθήματος.</p>
<p class="helptopic">Για να προσθέσουμε/αλλάξουμε τα στοιχεία του μαθήματος 
χρησιμοποιούμε το εικονίδιο (<img src="../../template/classic/img/edit.gif" width=10 height=10 align=basename></img>)
και στην συνέχεια θα εμφανισθεί οθόνη για την εισαγωγή/αλλαγή των στοιχείων. </p>
<p class="helptopic">
Το μάθημα μπορεί να χωρισθεί σε θεματικές ενότητες, για την καλύτερη οργάνωση του μαθήματος. Για να δημιουργήσετε μια θεματική ενότητα κάντε κλικ στο σύνδεσμο "Προσθήκη θεματικής ενότητας". Εάν έχουν προστεθεί ήδη θεματικές ενότητες, τότε αυτές εμφανίζονται κάτω από τον τίτλο "Θεματικές ενότητες" ενώ δίπλα τους υπάρχουν τα εικονίδια διόρθωσης, διαγραφής και αλλαγής ορατότητας (ορατό/αόρατο). Αν οι θεματικές ενότητες είναι περισότερες από μία, τότε εμφανίζονται βελάκια για την αλλαγή της σειράς εμφάνισης τους. Τα περιεχόμενα κάθε θεματικής ενότητας, ορίζονται από ξεχωριστή οθόνη, που θα εμφανισθεί όταν επιλεγεί η κατάλληλη θεματική ενότητα.</p>
';

// help_document
$langHDoc="Έγγραφα";
$langHDoc_student=$langHDoc;
$langDocContent="<p>Το υποσύστημα 'Έγγραφα' είναι παρόμοιο σε λειτουργία με τον
Διαχειριστή Αρχείων του προσωπικού σας υπολογιστή.</p>
<p>Μπορείτε να ανεβάσετε αρχεία οποιουδήποτε τύπου (HTML, Word, Powerpoint,
Excel, Acrobat, Flash, Quicktime, κ.λπ.). Ο μόνος σας περιορισμός είναι ότι οι
φοιτητές πρέπει να έχουν εγκατεστημένη στον υπολογιστή τους την αντίστοιχη
εφαρμογή για να τα διαβάσουν. Μερικοί τύποι αρχείων μπορεί να περιέχουν ιούς,
έτσι είναι δική σας ευθύνη να μην ανεβάζετε μολυσμένα αρχεία. Συνίσταται να
ελέγχετε τα έγγραφα σας με ένα αντιβιοτικό πρόγραμμα πριν τα ανεβάσετε.</p>

<p>Τα έγγραφα παρουσιάζονται με αλφαβητική σειρά.
<br><b>Συμβουλή:</b> Αν θέλετε να τα παρουσιάσετε με διαφορετική σειρά,
αριθμήστε τα: 01, 02, 03...</p>

<p>Μπορεί να γίνει:</p>
<h4>Ανέβασμα ενός αρχείου</h4>
<ul>
  <li>Κάντε κλικ στο σύνδεσμο 'Ανέβασμα αρχείου στον εξυπηρέτη'. Κατόπιν, στην φόρμα που θα σας εμφανιστεί, χρησιμοποιήστε το κουμπί 'Browse' για να επιλέξετε το αρχείο στον υπολογιστή σας
    στο δεξί μέρος της οθόνης σας.</li>
<li>Ολοκληρώστε το ανέβασμα κάνοντας κλικ στο κουμπί 'Ανέβασμα'.</li>
</ul>
<h4>Διαγραφή ενός αρχείου (ή καταλόγου)</h4>
<ul>
<li>Κάντε κλικ στο εικονίδιο 'Διαγραφή' (<img src='../../template/classic/img/delete.gif' width=10 height=10 align=baseline>)</li>
</ul>
<h4>Μετακίνηση ενός αρχείου (ή καταλόγου)</h4>
    <ul>
      <li>Κάντε κλικ στο εικονίδιο 'Μετακίνηση' (<img src='../../template/classic/img/move_doc.gif'
 width=10 height=10 align=basename>)
        </li>
      <li>Επιλέξτε τον κατάλογο μέσα στον οποίο θέλετε να μετακινήσετε το έγγραφο (ή το κατάλογο) (σημείωση: ο χαρακτηρισμός 'αρχικό κατάλογο' σημαίνει ότι δεν μπορείτε να πάτε πάνω από αυτό το επίπεδο στο δέντρο αρχείων του εξυπηρέτη).</li>
      <li>Επιβεβαιώστε το κάνοντας κλικ στο 'Μετακίνηση'.</li>
    </ul> 

<h4>Μετονομασία ενός αρχείου (ή ένα κατάλογου)</h4>
<ul>
  <li>κάντε κλικ στο εικονίδιο 'Μετονομασία' (<img src='../../template/classic/img/edit.gif' width=10 height=10
 align=baseline>)</li>
  <li>Πληκτρολογήστε το καινούριο όνομα στο πεδίο (πάνω αριστερά)</li>
  <li>Επιβεβαιώστε το κάνοντας κλικ στο κουμπί 'Μετονομασία'</li>
</ul>
    <h4>Προσθήκη ή τροποποίηση σχολίου σε ένα αρχείο (ή σε ένα κατάλογο)</h4>
    <ul>
  <li>Κάντε κλικ στο εικονίδιο 'Σχόλιο' (<img src='../../template/classic/img/information.gif' width=10
 height=10 align=baseline>)
    στη στήλη </li>
      <li>Πληκτρολογήστε καινούριο σχόλιο στο αντίστοιχο πεδίο (πάνω δεξιά).</li>
      </ul>

    <h4>Μετατροπή  αρχείου (ή καταλόγου) σε αόρατο για τους φοιτητές</h4>
    <ul>
  <li>Κάντε κλικ στο εικονίδιο 'Ορατό/Αόρατο' (<img src='../../template/classic/img/visible.gif' width=10 height=10 align=baseline>)
</li>
   <li>Μετά την παραπάνω ενέργεια το αρχείου (ή κατάλογο) θα υπάρχει αλλά δεν θα είναι ορατό από τους φοιτητές.</li>
  <li>Γα να το κάνετε αόρατο ξανά, κάντε κλικ στο εικονίδιο 'Ορατό/Αόρατο' (<img src='../../template/classic/img/invisible.gif' width=14 height=10 align=baseline>
  </li>
    </ul>
    <hr>
    <p>Μπορείτε να οργανώσετε το περιεχόμενό σας σε καταλόγους. Για το σκοπό αυτό:</p>
    <h4><b>Δημιουργήστε ένα κατάλογο</b></h4>
    <ul>
      <li>Κάντε κλικ στο σύνδεσμο 'Δημιουργία ενός καταλόγου'</li>
      <li>Πληκτρολογήστε το όνομα του καινούριου σας καταλόγου στο αντίστοιχο πεδίο</li>
      <li>Μετά κάντε κλικ στην 'Δημιουργία καταλόγου.</li>
    </ul>
    <hr>
    <p>Μπορείτε να βλέπετε τον διαθέσιμο χώρο σας</p>
    <h4><b>Επισκόπιση αποθηκευτικού χώρου</b></h4>
    <ul>
      <li>Κάντε κλικ στο σύνδεσμο 'Επισκόπιση αποθηκευτικού χώρου'</li>
      <li>Εμφανίζεται πίνακας με τον χρησιμοποιούμενο χώρο, το ποσοστό χρήσης, και τον συνολικά διαθέσιμο χώρο.</li>
    </ul>    
      </p>
    <p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τα Έγγραφα από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langDoc_studentContent="<p>Τα Έγγραφα αποτελούν το χώρο όπου αποθηκεύεται, οργανώνεται και παρουσιάζεται το εκπαιδευτικό υλικό του μαθήματος. Στο υποσύστημα αυτό μπορείτε να βρείτε διαθέσιμα κείμενα, σημειώσεις, παρουσιάσεις, εικόνες, διαγράμματα, κλπ που αφορούν το μάθημα μέσα από ένα σύστημα καταλόγων και υποκαταλόγων.</p>" ;


// Help_user.php
$langHUser="Διαχείριση Χρηστών";
$langUserContent="<p><b>Ρόλοι</b></p>
<p>Οι ρόλοι των χρηστών στην πλατφόρμα δεν
σχετίζονται καθόλου με τον υπολογιστή στον οποίο τρέχει η πλατφόρμα. Αυτό
σημαίνει ότι δεν δίνουν κανένα δικαίωμα πάνω στο λειτουργικό σύστημα. </p>
<hr>
<p><b>Δικαιώματα Διαχειριστή</b></p>
<p>Τα δικαιώματα διαχειριστή, από την άλλη, ανταποκρίνονται στην τεχνική εξουσιοδότηση να αλλάξετε τα περιεχόμενα και την οργάνωση του μαθήματος.</p>
<p>Για να επιτρέψετε σε ένα βοηθό σας, για παράδειγμα, να συν-διαχειριστεί το
μάθημα, αρκεί να τον εγγράψετε στο μάθημα. Μετά, κάντε κλικ στο 'Προσθήκη' (κάτω από τα 'Δικαιώματα
Διαχειριστή').</p><hr>
<p><b>Προσθήκη ενός χρήστη</b></p>
<p>Για να προσθέσετε ένα χρήστη στο μάθημά σας, κάντε κλικ στο σύνδεσμο 'Προσθήκη ενός χρήστη', συμπληρώστε τα πεδία που θα σας εμφανιστούν και κάντε κλικ στο 'Αναζήτηση'. Αφού βρεθεί ο χρήστης στην πλατφόρμα κάντε κλικ στο σύνδεσμο 'Εγγραφή χρήστη στο μάθημα'.</p>";

// Help guest user
$langHGuest = "Χρήστη Επισκέπτης";
$langGuestContent = "<p>Επιλέγοντας 'Προσθήκη χρήστη Επισκέπτη' σας δίνετε η δυνατότητα να δημιουργήσετε ένα χρήστη επισκέπτη, τα στοιχεία του οποίου θα γνωστοποιήσετε στους χρήστες οι οποίοι είναι εγγεγραμμένοι στο μάθημα (ή στην πλατφόρμα). Ένας χρήστης επισκέπτης, έχει τη δυνατότητα να βλέπει την αρχική σελίδα του μαθήματος στο οποίο είναι γραμμένος και όλα τα εργαλεία που είναι ενεργοποιημένα, αλλά δεν μπορεί να εκτελέσει λειτουργίες όπως να ανεβάσει εργασίες.</p>";

// Help questionnaire
$langHQuestionnaire="Ερωτηματολόγιο";
$langHQuestionnaire_student=$langHQuestionnaire ;
$langQuestionnaireContent="<p>Το εργαλείο των Ερωτηματολογίων σας επιτρέπει
την δημιουργία και διαχείριση Ερωτηματολογίων.</p>
<p>Για να δημουργήσετε ένα ερωτηματολόγιο κάντε κλικ στο σύνδεσμο 'Δημιουργία Ερωτηματολογίου'. Στην φόρμα που θα σσς εμφανιστεί συμπληρώστε τον τίτλο του και το χρονικο διάστημα για το οποίο θα είναι ενεργό. Επιλέξτε τον τύπο ερωτήσεων που θέλετε κάνοντας κλικ στα αντίστοιχα κουμπιά ('Νέα ερώτηση πολλαπλής επιλογής' και 'Νέα ερώτηση συμπλήρωσης κενού'). Αφού ολοκληρώσετε τις ερωτήσεις και τις αντίστοιχες απαντήσεις τους κάντε κλικ στο 'Δημιουργία Ερωτηματολογίου'.
</p>
<p>Τα αποτελέσματα μπορείτε να τα δείτε στην σελίδα
διαχείρισης των ερωτηματολογίων.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τα ερωτηματολόγια από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";
$langQuestionnaire_studentContent="<p>Το υποσύστημα αυτό παρέχει τη δυνατότητα συμμετοχής σε ερωτηματολόγια – δημοσκοπήσεις που έχει δημιουργήσει ο υπεύθυνος καθηγητής του μαθήματος.</p><p>Για την συμμετοχή σε κάποιο ερωτηματολόγιο αρκεί να επιλέξετε τον σύνδεσμο «Συμμετοχή».</p>" ;


// Help exercice
$langHExercise="Ασκήσεις";
$langHExercise_student=$langHExercise ;
$langExerciseContent="<p>Το εργαλείο των ασκήσεων σας επιτρέπει να δημιουργήσετε ασκήσεις
που θα περιέχουν όσες ερωτήσεις θέλετε.<br>
<br>Υπάρχουν διάφοροι τύποι απαντήσεων για τις ερωτήσεις σας:<br>
<ul>
  <li>Πολλαπλής επιλογής (Μοναδική απάντηση)</li>
  <li>Πολλαπλής επιλογής (πολλαπλές απαντήσεις)</li>
  <li>Ταίριασμα</li>
  <li>Συμπλήρωμα κενών</li>
</ul></p>
<p>Μια άσκηση περιλαμβάνει ένα μόνο κοινό τύπο ερωτήσεων</p>
<hr>
<p><b>Δημιουργία Aσκησης</b><br><br>
Για να δημιουργήσετε μια άσκηση:
<ol>
  <li>Αρχικά πρέπει το υποσύστημα των ασκήσεων να είναι ενεργοποιημένο για το τρέχον μάθημα</li>
  <li>Κάντε κλικ στο σύνδεσμο &quot;Νέα Aσκηση&quot;.</li>
  <li> Πληκτρολογήσετε το όνομα της άσκησης, καθώς και μία (προαιρετική) περιγραφή της.</li>
  <li> Μπορείτε να διαλέξετε μεταξύ 2 τύπων ασκήσεων :
    <ul>
      <li>Ερωτήσεις σε μία μόνο σελίδα</li>
      <li>Μία ερώτηση ανά σελίδα</li>
    </ul>
  </li>
  <li>Επιλέξτε ημερομηνία και ώρα έναρξης της άσκησης (π.χ. 1977-06-29 12:00:00). Πριν από αυτή οι διδασκόμενοι δεν θα μπορούν να συμμετέχουν στην άσκηση.</li>
  <li>Επιλέξτε ημερομηνία και ώρα λήξης της άσκησης (π.χ. 1977-06-29 12:00:00). Μετά από αυτή οι διδασκόμενοι δεν θα μπορούν να συμμετέχουν στην άσκηση.</li>
  <li>Καθορίστε τον χρονικό περιορισμό που θα έχουν οι συμμετέχοντες, δηλαδή πόσα λεπτά θα έχουν στην διάθεση τους για να ολοκληρώσουν όλες τις ερωτήσεις (0 για καθόλου περιορισμό). </li>
  <li>Εισάγεται πόσες επαναλήψεις επιτρέπονται, δηλαδή πόσες φορές θα μπορεί κάποιος να συμμετέχει στην άσκηση. Παρόμοια με πρίν 0 για απεριόριστο αριθμό επαναλήψεων.</li>
</ol>
<br>
<br></p>
<p>Κατόπιν αποθηκεύστε την άσκηση. Θα μεταφερθείτε στην διαχείριση ερωτήσεων για την άσκηση.</p>
<hr>
<p><b>Προσθήκη Ερώτησης</b></p>
<p>Μπορείτε να προσθέσετε μια ερώτηση στην άσκηση που δημιουργήσατε προηγουμένως.
Η περιγραφή είναι προαιρετική, όπως και η εικόνα.</p>
<hr>
<p><b>Πολλαπλής Επιλογής</b></p>
<p>
Για να δημιουργήσετε μια ερώτηση πολλαπλής επιλογής:<br><br>
<ul>
  <li>Δημιουργήστε απαντήσεις για την ερώτηση σας. Μπορείτε να προσθέσετε ή να διαγράψετε μια απάντηση κάνοντας
κλικ στο κατάλληλο κουμπί</li>
  <li>Τσεκάρετε το αριστερό κουμπί για την σωστή απάντηση</li>
  <li>Προσθέστε (αν θέλετε) ένα σχόλιο. Το σχόλιο δεν θα το δει ο μαθητής παρά μόνο όταν απαντήσει στην ερώτηση</li>
  <li>Δώστε ένα βάρος (βαθμό) σε κάθε απάντηση. Το βάρος (βαθμός) μπορεί να είναι ένας οποιοσδήποτε θετικός
ή αρνητικός αριθμός ή μηδέν.</li>
  <li>Αποθηκεύστε τις απαντήσεις σας</li>
</ul></p>
<hr>
<p><b>Συμπλήρωμα κενών</b></p>
<p>Μπορείτε να δημιουργήσετε ένα κείμενο με κενά. Αυτό έχει σαν σκοπό, να βρούν οι μαθητές τις λέξεις που
λείπουν.<br><br>
Για να διαγράψετε μια λέξη από το κείμενο, έτσι ώστε να δημιουργηθεί κενό, βάλτε την λέξη μεταξύ αγκυλών [όπως
αυτή].<br><br>
Από την στιγμή που το κείμενο έχει πληκτρολογηθεί και έχουν οριστεί τα κενά, μπορείτε να προσθέσετε ένα σχόλιο το
οποίο θα το δεί ο μαθητής όταν απαντήσει στην ερώτηση.<br><br>
Αποθηκεύστε το κείμενο σας, και θα προχωρήσετε στο επόμενο βήμα, που θα σας επιτρέψει να δώσετε ένα βάρος σε κάθε
κενό. Για παράδειγμα αν θέλετε να ορίσετε στην ερώτηση,  σαν άριστα το 10 και έχετε 5 κενά, μπορείτε να δώσετε σαν
βαθμολογία το 2 σε κάθε κενό.</p>
<hr>
<p><b>Ταίριασμα</b></p>
<p>Μπορείτε να δημιουργήσετε μια ερώτηση όπου ο μαθητής θα πρέπει να συνδυάσει στοιχεία από δύο σύνολα.<br><br>
Μπορείτε επίσης να ζητήσετε από τους μαθητές, να ταξινομήσουν στοιχεία με κάποια σειρά.<br><br>
Πρώτα ορίζετε τις επιλογές, μεταξύ των οποίων οι μαθητές θα μπορούν να διαλέξουν την σωστή απάντηση. Ύστερα ορίζετε
τις ερωτήσεις που θα πρέπει να συνδεθούν με τις επιλογές.
Τέλος, αντιστοιχήστε τες, μέσω του μενού, από το πρώτο σύνολο με αυτό του δεύτερου συνόλου.<br><br>
Σημείωση: Μερικά στοιχεία από το πρώτο σύνολο, μπορούν να δείχνουν στο ίδιο στοιχείο του δεύτερου συνόλου.<br><br>
Δώστε ένα βάρος σε κάθε σωστό ταίριασμα, και σώστε την απάντησή σας.</p>
<hr>
<p><b>Αλλαγή Άσκησης</b></p>
<p>Για να αλλάξετε μια άσκηση, εκτελείτε παρόμοιες ενέργειες όπως και στη δημιουργία.
Απλά κάντε κλικ στην εικόνα <img src=\"../../template/classic/img/edit.gif\" border=\"0\" align=\"absmiddle\"> δίπλα στην άσκηση για να
την αλλάξετε.</p>
<hr>
<p><b>Διαγραφή Άσκησης</b></p>
<p>Για να διαγράψετε μια άσκηση, κάντε κλικ στην εικόνα
<img src=\"../../template/classic/img/delete.gif\" border=\"0\" align=\"absmiddle\"> δίπλα από την άσκηση για να τη διαγράψετε.</p>
<hr>
<p><b>Ενεργοποίηση Άσκησης</b></p>
<p>Για να χρησιμοποιηθεί η άσκησή σας από τους μαθητές, πρέπει να την ενεργοποιήσετε κάνοντας κλικ στην εικόνα
<img src=\"../../template/classic/img/invisible.gif\" border=\"0\" align=\"absmiddle\"> δίπλα από την άσκηση για να την ενεργοποιήσετε.</p>
<hr>
<p><b>Δοκιμή της Άσκησης</b></p>
<p>Μπορείτε να δοκιμάσετε την άσκησή σας κάνοντας κλικ στο όνομά της.</p>
<hr>
<p><b>Τυχαίες ασκήσεις</b></p>
<p>Την ώρα της δημιουργίας / αλλαγής μιας άσκησης μπορείτε να ορίσετε αν θέλετε οι ερωτήσεις να εμφανίζονται σε τυχαία
σειρά.<br><br>
Αυτό σημαίνει ότι, ενεργοποιώντας την επιλογή αυτή, οι ερωτήσεις θα εμφανίζονται σε διαφορετική σειρά κάθε φορά
που θα εκτελείται η άσκηση από τους μαθητές.<br><br>
Αν έχετε ένα μεγάλο αριθμό ερωτήσεων, μπορείτε να επιλέξετε να εμφανίζονται τυχαία, ένας ορισμένος αριθμός
ερωτήσεων.</p>
<hr>
<p><b>Διαθέσιμες Ερωτήσεις</b></p>
<p>Οταν διαγράφετε μια άσκηση, οι ερωτήσεις τις δεν διαγράφονται από την βάση δεδομένων και μπορούν να
επαναχρησιμοποιηθούν σε μια καινούρια άσκηση.<br><br>
Με αυτό τον τρόπο μπορεί να χρησιμοποιήσετε τις ίδιες ερωτήσεις σε αρκετές ασκήσεις.<br><br>
Εξ' ορισμού, παρουσιάζονται όλες οι ερωτήσεις του μαθήματος σας. Μπορείτε να δείτε τις ερωτήσεις σχετικές με μια άσκηση,
επιλέγοντας την άσκηση από το μενού &quot;Φιλτράρισμα&quot;.<br><br>
Οι &quot;ερωτήσεις χωρίς απάντηση&quot; είναι αυτές που δεν ανήκουν σε καμμία άσκηση.</p>
<p><b>Αποτελέσματα</b></p>
<p>Μπορείτε να δείτε τα αποτελέσματα επιλέγοντας την μορφή που επιθυμείτε.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τις ασκήσεις από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langExercise_studentContent="<p>Το υποσύστημα αυτό ενσωματώνει ένα μηχανισμό διαχείρισης Ασκήσεων Αυτοαξιολόγησης για τους εκπαιδευόμενους, τις οποίες έχει δημιουργήσει ο υπεύθυνος εκπαιδευτής του μαθήματος. Βασικός στόχος είναι η εξάσκηση των Εκπαιδευόμενων στην ύλη του μαθήματος. Σε κάποιες ασκήσεις μπορεί να υπάρχει επιπλέον χρονικός περιορισμός ή περιορισμός στον αριθμό συμμετοχών.</p><p>Ειδικότερα, για να επιλύσετε μια άσκηση αυτοαξιολόγησης επιλέξτε αυτή που επιθυμείτε, κάνοντας κλικ στο όνομά της.
</p>" ;


// help work
$langHWork = "Εργασίες";
$langHWork_student = $langHWork ;
$langWorkContent = "<p>Το υποσύστημα των εργασιών είναι ένα ολοκληρωμένο σύστημα δημιουργίας / παράδοσης / βαθμολογίας εργασιών.</p>
<p>Σαν καθηγητής μπορείτε να δημιουργήσετε μια εργασία κάνοντας κλικ στη <b>\"Δημιουργία Εργασίας\"</b>.
Συμπληρώστε τον τίλο της εργασίας, καθορίστε την ημερομηνία υποβολής και προεραιτικά προσθέστε και ένα
σχόλιο.</p>
<p>Όταν ολοκληρωθεί η δημιουργία της εργασίας, μην παραλείψετε να την ενεργοποιήσετε κάνοντας κλικ
στο εικονίδιο <img src=\"../../template/classic/img/invisible.gif\" border=\"0\" align=\"absmiddle\">. Η εργασία θα είναι ορατή και
προσβάσιμη από τους φοιτητές μόνο όταν την ενεργοποιήσετε. Μπορείτε ανά πάσα στιγμή να διορθώσετε την
εργασία κάνοντας κλικ στο εικονίδιο <img src=\"../../template/classic/img/edit.gif\" border=\"0\" align=\"middle\"> ή να την
διαγράψετε κάνοντας κλικ στο εικονίδιο <img src=\"../../images/delete.gif\" border=\"0\" align=\"middle\">.
Κάνοντας κλικ στον τίτλο της εργασίας βλέπετε τις τυχόν εργασίες που έχουν υποβληθεί από τους φοιτητές.
Στα στοιχεία του φοιτητή βλέπετε τον αριθμό μητρώου, την ημερομηνία υποβολής και το αντίστοιχο αρχείο.
Κάνοντας κλικ στο \"Κατέβασμα όλων των εργασιών σε μορφή .zip \" θα \"κατεβάσετε\" όλα τα αρχεία που έχουν
υποβάλλει οι φοιτητές (σε συμπιεσμένη μορφή .zip) και που αντιστοιχούν στην εργασία που έχετε ορίσει.
Για να βαθμολογήσετε την εργασία συμπληρώστε τον αντίστοιχο βαθμό δίπλα στο όνομα του φοιτητή και κάντε
κλικ στο κουμπί <b>\"Υποβολή Βαθμολογίας\"</b>. Ο φοιτητής θα δει τον βαθμό του μόλις κάνει κλικ στο τίτλο της
εργασίας.</p>
<p>Ο φοιτητής μπορεί να δεί όλες τις εργασίες που έχουν υποβληθεί από τον καθηγητή.
Ο κατάλογος των εργασιών περιλαβάνει (εκτός από τον τίτλο της εργασίας), την προθεσμία υποβολής, τυχόν
βαθμολογία από τον καθηγητή και μια ένδειξη για το αν έχει στείλει εργασία ή όχι.
Μπορεί να υποβάλλει τη εργασία κάνοντας κλικ στον αντίστοιχο τίτλο της.
Να σημειωθεί, ότι ο φοιτητής δεν μπορεί να υποβάλλει εργασία μετά τη λήξη της προθεσμίας υποβολής.
Επίσης αν έχει \"ανεβάσει\" μια εργασία και θέλει να \"ανεβάσει\" ακόμα μία, η παλιά του εργασία θα σβηστεί και θα
αντικατασταθεί από την καινούρια.
</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τις εργασίες από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
$langPHPMathPublisher";
$langWork_studentContent = "<p>Το υποσύστημα Εργασίες Μαθήματος είναι ένα πολύ χρήσιμο εργαλείο του ηλεκτρονικού μαθήματος μιας και επιτρέπει την ηλεκτρονική υποβολή και βαθμολόγηση των εργασιών του μαθήματος.</p><p>Ειδικότερα, παρέχει τη δυνατότητα στους εγγεγραμμένους εκπαιδευόμενους να ανεβάσουν ηλεκτρονικά στην πλατφόρμα τις εργασίες τους μέχρι την ημερομηνία υποβολής και στη συνέχεια αφού ο εκπαιδευτής τις βαθμολογήσει να δουν το βαθμό τους.</p>";


// Help Group
$langHGroup="Ομάδες Χρηστών";
$langHGroup_student=$langHGroup;
$langGroupContent="<p>Το εργαλείο αυτό επιτρέπει τη δημιουργία και τη διαχείριση ομάδων
εργασίας. Κατά τη δημιουργία («Δημιουργία καινούριας ομάδας χρηστών»),
οι ομάδες είναι κενές. Υπάρχουν διάφοροι τρόποι για να συμπληρωθούν:
<ul><li>αυτόματα («Συμπλήρωση των ομάδων χρηστών»),</li>
<li>απο τον υπεύθυνο του μαθήματος («Διόρθωση της ομάδας χρηστών»),</li>
<li>με αυτοεγγραφή των φοιτητών («Αλλαγή ρυθμίσεων»: Οι φοιτητές επιτρέπονται να εγγραφούν...).</li>
</ul>
<p>Αυτοί οι τρείς τρόποι μπορούν να συνδυαστούν. Μπορείτε για παράδειγμα να ζητήσετε από τους
φοιτητές να εγγραφούν μόνοι τους. Αργότερα, διαπιστώνετε ότι κάποιοι δεν εγγράφηκαν
και επιλέγετε την αυτόματη συμπλήρωση ομάδων. Μπορείτε επίσης να αλλάξετε τα μέλη των
ομάδων πριν ή μετά την αυτόματη συμπλήρωση ή την εγγραφή από τους ίδιους.</p>
<p>Η εγγραφή σε ομάδες, αυτόματα ή όχι, λειτουργεί μόνο εάν υπάρχουν ήδη
φοιτητές εγγεγραμμένοι στο μάθημα (η εγγραφή σε ομάδες δε σχετίζεται με την
εγγραφή στο ίδιο το μάθημα). Οι εγγεγραμμένοι φοιτητές στο μάθημα εμφανίζονται στο
εργαλείο «Χρήστες».</p>
<hr noshade size=1>
<p><b>Δημιουργία ομάδων</b></p>
<p>Για να δημιουργήσετε νέες ομάδες, επιλέξτε το «Δημιουργία καινούριας ομάδας χρηστών»
και ορίστε πόσες ομάδες θα δημιουργηθούν. Ο μέγιστος αριθμός μελών είναι προαιρετικός
αλλά προτείνουμε να επιλέξετε κάποιον. Αν δεν τον αλλάξετε, στις ομάδες
θα μπορούν να εγγραφούν απεριόριστα μέλη.</p>
<hr noshade size=1>
<p><b>Συμπλήρωση των ομάδων χρηστών</b></p>
<p>Για να συμπληρώσετε χρήστες στις νέες ομάδες, επιλέξτε το «Συμπλήρωση των ομάδων χρηστών»
και ορίστε ποιοί χρήστες θα ανήκουν στην κάθε ομάδα.</p>
<hr noshade size=1>
<p><b>Διαγραφή όλων των ομάδων χρηστών</b></p>
<p>Για να διαγράψετε όλες τις ομάδες των χρηστών μαζί με τους χρήστες του μαθήματος επιλέξτε το
«Διαγραφή όλων των ομάδων χρηστών». Διαγράφονται και οι χρήστες και οι ομάδες, το μόνο που παραμένει
εάν υπάρχει είναι το αρχείο συζητήσεων της ομάδας, για μελλοντική αναφορά.</p>
<hr noshade size=1>
<p><b>Εκκαθάριση όλων των ομάδων χρηστών</b></p>
<p>Για να διαγράψετε όλους τους χρήστες του μαθήματος, αλλά να παραμείνουν οι ομάδες κενές επιλέξτε το
«Εκκαθάριση όλων των ομάδων χρηστών». Διαγράφονται και οι χρήστες και οι ομάδες, το μόνο που παραμένει
εάν υπάρχει είναι το αρχείο συζητήσεων της ομάδας, για μελλοντική αναφορά.</p>
<hr noshade size=1>
<p><b>Ρυθμίσεις ομάδων</b></p>
<p>Μπορείτε να ορίσετε τις ρυθμίσεις που ισχύουν για όλες τις ομάδες.
<p><b>Ρυθμίσεις ομάδων χρηστών</b>:
<p>Μπορείτε να δημιουργήσετε κενές ομάδες και να επιτρέψετε την εγγραφή φοιτητών
σε αυτές. Αν έχετε ορίσει μέγιστο αριθμό μελών, οι πλήρεις ομάδες δε δέχονται
νέα μέλη. Αυτή η μέθοδος εξυπηρετεί όταν δε γνωρίζετε τον ακριβή κατάλογο των
φοιτητών όταν δημιουργείτε ομάδες.</p>
<p><b>Εργαλεία</b>:</p>
<p>Κάθε ομάδα έχει είτε μια περιοχή συζητήσεων (δημόσια ή ιδιωτική) είτε
μια περιοχή εγγράφων (ένα σύστημα διαχείρισης αρχείων που μοιράζονται τα μέλη)
είτε (συχνότερα) και τα δύο.</p>
<hr noshade size=1>
<p><b>Διόρθωση ομάδων</b></p>
<p>Αφού δημιουργηθούν οι ομάδες, στο κάτω μέρος της σελίδας εμφανίζεται ο κατάλογος
των ομάδων με μια σειρά από πληροφορίες και λειτουργίες. Επιλέξτε:
<ul><li><b>Διόρθωση</b> για να αλλάξετε το όνομα της ομάδας, την περιγραφή,
τον διδάσκοντα και τον κατάλογο των μελών.</li>
<li><b>Διαγραφή</b> για να διαγράψετε μια ομάδα.</li></ul>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τις ομάδες χρηστών από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";


$langGroup_studentContent="<p>Μια ομάδα χρηστών είναι μια συλλογή εγγεγραμμένων χρηστών του μαθήματος που μοιράζονται την ίδια περιοχή συζητήσεων καθώς και την ίδια περιοχή μεταφόρτωσης αρχείων και εργασιών</p>";

// Help Agenda
$langHAgenda = "Ατζέντα";
$langHAgenda_student = $langHAgenda ;
$langAgendaContent = "<p>Αν επιθυμείτε να προσθέσετε ένα γεγονός στην ατζέντα, κάντε κλικ στο σύνδεσμο 'Προσθήκη ενός γεγονότος'. Στην φόρμα που θα σας εμφανιστεί, επιλέξτε την ημερομηνία του γεγονότος, τον τίτλο του και τις λεπτομέρειες. Κάτοπιν πατήστε το πλήκτρο 'Προσθήκη / Αλλαγή'. Με αυτό τον τρόπο, το γεγονός προστίθεται στην ατζέντα.</p><p>
Στη συνέχεια, σας δίνεται η δυνατότητα αν επιθυμείτε, να αλλάξετε κάποια από τις παραμέτρους του γεγονότος,
επιλέγοντας το εικονίδιο 'Αλλαγή', να διαγράψετε κάποιο γεγονός από την ατζέντα επιλέγοντας το εικονίδιο 'διαγραφή' ή να γίνει το 
γεγονός ορατό ή αόρατο για τους φοιτητές, επιλέγοντας το εικονίδιο 'Ορατό/Αόρατο'.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την ατζέντα του μαθήματος από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
$langPHPMathPublisher";
$langAgenda_studentContent = '<p>Το υποσύστημα Ατζέντα σας επιτρέπει να παρακολουθείτε με χρονολογική σειρά τα γεγονότα σταθμούς του μαθήματος (διαλέξεις, συναντήσεις, αξιολογήσεις, κλπ). Η επιλογή που έχετε είναι να αλλάξετε τη σειρά με την οποία εμφανίζονται τα γεγονότα (πρόσφατο - παλαιότερο), κάνοντας κλικ στο σύνδεσμο "Αντιστροφή σειράς παρουσίασης" πάνω δεξιά.
</p>' ;

// Help link
$langHLink = "Σύνδεσμοι";
$langHLink_student = $langHLink;
$langLinkContent = "<p>Σας δίνεται η δυνατότητα να προσθέσετε συνδέσμους προς κάποιες υπάρχουσες ιστοσελίδες στο
δίκτυο (ή κάπου αλλού στον δικό σας δικτυακό τόπο).</p><p>Για να προσθέσετε ένα σύνδεσμο επιλέξτε 'Προσθήκη
συνδέσμου'. Πληκτρολογήστε το URL, τον τίτλο και κάποια περιγραφή του συνδέσμου. Επιλέξτε την κατηγορία στην οποία θέλετε να προστεθεί ο σύνδεσμος και στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'.</p> <p>Για να προσθέσετε μια νέα κατηγορία συνδέσμων, με σκοπό να ομαδοποιήσετε κάποιους συνδέσμους, επιλέξτε 'Προσθήκη κατηγορίας'.  Πληκτρολογήστε το όνομα και την περιγραφή της κατηγορίας. Στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'. Επίσης μπορείτε να αλλάξετε το όνομα ή την περιγραφή του συνδέσμου επιλέγοντας 'αλλαγή' ή να διαγράψετε κάποιο σύνδεσμο επιλέγοντας 'διαγραφή'.
Επιλέγοντας 'διαγραφή' κατηγορίας διαγράφετε την κατηγορία και όλους τους συνδέσμους που περιέχει.</p>
<p> Τέλος υπάρχει η επιλογή 'Εμφάνιση' αν θέλετε να εμφανιστούν οι σύνδεσμοι που περιέχει μια κατηγορία
και η επιλογή 'Απόκρυψη' αν θέλετε να μην εμφανίζονται.</p>
<p> Εάν έχουν ορισθεί κατηγορίες, στην προσθήκη συνδέσμου ορίζουμε και σε ποιά κατηγορία θα ανήκει.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τους συνδέσμους από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langLink_studentContent = "<p>Το υποσύστημα Σύνδεσμοι σας δίνει τη δυνατότητα πρόσβασης σε χρήσιμες πηγές από το Διαδίκτυο ομαδοποιημένες σε κατηγορίες που αφορούν το μάθημα. Οι σύνδεσμοι αυτοί έχουν επιλεχτεί από τον υπεύθυνο εκπαιδευτή του μαθήματος. Κάθε σύνδεσμος διαθέτει έναν τίτλο, μια περιγραφή, με επιπλέον πληροφορίες.</p>";


// Help announcements
$langHAnnounce = "Ανακοινώσεις";
$langHAnnounce_student = $langHAnnounce ;
$langAnnounceContent = "<p>Μπορείτε να προσθέσετε ανακοινώσεις στην σελίδα του μαθήματος κάνοντας κλικ στο σύνδεσμο 'Προσθήκη Ανακοίνωσης'. Στην φόρμα που θα σας εμφσνιστεί πληκτρολογήστε τον τίτλο και το σώμα της ανακοίνωσης. Με τα κάντε κλικ στο Προσθήκη'. Αν επιθυμείτε η ανακοίνωση να σταλεί και με mail στους φοιτητές που είναι εγγεγραμμένοι στομάθημα, τότε επιλέγετε 'Αποστολή (με email) της ανακοίνωσης στους εγγεγραμμένους μαθητές'.</p>
<p>Επίσης μπορείτε να αλλάξετε το περιεχόμενο της ανακοίνωσης επιλέγοντας το κατάλληλο εικονίδιο για 'Aλλαγή' ή να διαγράψετε μια ανακοίνωση  επιλέγοντας
το εικονίδιο για 'Διαγραφή'. Τα εικονίδια αυτά βρίσκονται στην στήλη 'Εργαλεία'.</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τις ανακοινώσεις από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>

$langPHPMathPublisher";

$langHAnnounce_student = $langHAnnounce;
$langAnnounce_studentContent = '<p>Το υποσύστημα Ανακοινώσεις επιτρέπει την ενημέρωση των εγγεγραμμένων χρηστών σε θέματα που αφορούν το συγκεκριμένο μάθημα. Παράλληλα επιτρέπει στους υπεύθυνους εκπαιδευτές του μαθήματος να στέλνουν τις ανακοινώσεις με ηλεκτρονικό ταχυδρομείο, στους Εκπαιδευόμενους που είναι εγγεγραμμένοι στο μάθημα.</p><p>Βασική προϋπόθεση για να λαμβάνετε τα ενημερωτικά μηνύματα είναι να έχετε ορίσει σωστή διεύθυνση email στο προφίλ σας. ("Αλλαγή του Προφίλ μου" στο χαρτοφυλάκιο χρήστη).
</p>';


// Help profile
$langHProfile = "Αλλαγή προσωπικών στοιχείων";
$langProfileContent = "<p>Σας δίνετε η δυνατότητα να αλλάξετε κάποια από τα προσωπικά σας στοιχεία που
χρησιμοποιείτε στην πλατφόρμα.</p>
<li>Σε περίπτωση που έχει γίνει κάποιο λάθος στην καταχώρηση σας μπορείτε να αλλάξετε το όνομα, το επώνυμο και
την ηλεκτρονική σας διεύθυνση.</li>
<li>Επίσης αν επιθυμείτε μπορείτε να αλλάξετε το όνομα χρήστη και το συνθηματικό σας.</li>
<li>Τέλος για να καταχωρηθούν στη βάση δεδομένων οι αλλαγές που κάνατε πατήστε το πλήκτρο 'Αλλαγή'.</li>";


//Help import page
$langHImport = "Ανέβασμα ιστοσελίδας";
$langImportContent = "<p>Αν θέλετε μπορείτε να ανεβάσετε αρχείο σχετικό με το μάθημα σας. Το αρχείο αυτό θα αποθκευτεί στον εξυπηρετητή του Open eClass. Θα δημιουργηθεί σύνδεσμος προς αυτό στο αριστερό μενού του μαθήματος που θα ανοίγει σε νέο παράθυρο του φυλλομετρητή του χρήστη.</p>
<p>Για να το κάνετε αυτό πατήστε το πλήκτρο 'Browse', επιλέξτε το αρχείο που θέλετε να ανεβάσετε, δώστε ένα τίτλο στο πεδίο 'Τίτλος σελίδας' και πιέστε το πλήκτρο 'Προσθήκη'.</p>
<p>Ο σύνδεσμος του αρχείου που ανεβάζετε μπορεί να απενεργοποιηθεί και να διαγραφεί από το εργαλείο
'Διαχείριση εργαλείων'.</p>";


// Help external  module
$langHModule = "Προσθήκη εξωτερικού συνδέσμου";
$langModuleContent = "<p>Αν θέλετε να προσθέσετε συνδέσμους από την αρχική σελίδα του μαθήματος προς ιστοσελίδες
που υπάρχουν ήδη κάπου αλλού στο δίκτυο (ή ακόμα κάπου αλλού στον δικό σας δικτυακό τόπο) πληκτρολογήστε το
σύνδεσμο και τον τίτλο του συνδέσμου και στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'. Οι σελίδες που προσθέτετε εσείς στην αρχική σελίδα μπορούν να απενεργοποιηθούν και να διαγραφούν, ενώ τα ενσωματωμένα εργαλεία μπορούν να
απενεργοποιηθούν μόνο, αλλά όχι να διαγραφούν.</p>";


//tools management
$langHcourseTools = "Ενεργοποίηση εργαλείων";
$langcourseToolsContent = "<p>O καθηγητής μπορεί να ενεργοποιήσει ή να απενεργοποιήσει τα υποσυστήματα του μαθήματος. Στις δύο στήλες παρουσιάζεται η κατάσταση του κάθε υποσυστήματος, δηλαδή αν είναι ενεργό ή όχι.</p>
<p>Για να αλλάξετε την κατάσταση σε κάποιο υποσύστημα, κάντε κλικ στο αντίστοιχο υποσύστημα και στη συνέχεια πατήστε το πλήκτρο '>>' για να αλλάξετε την κατάστασή του. Μπορείτε να μετακινήσετε περισσότερα υποσυστήματα από την μια στήλη στην άλλη πατώντας CTRL και το επιθυμητό υποσύστημα. Τέλος πατήστε το πλήκτρο 'Υποβολή αλλαγών', για να αποθηκευτούν οι αλλαγές σας.</p>
<p>Μπορεί ακόμα να ανέβει μια έτοιμη ιστοσελίδα και να προστεθεί στην πλαφτόρμα με την επιλογή του συνδέσμου 'Ανέβασμα ιστοσελίδας'. Εάν υπάρχει κάποιος Εξωτερικός σύνδεσμος με υλικό που μπορεί να χρησιμοποιηθεί στην πλατφόρμα, τότε αυτός μπορεί να ορισθεί χρησιμοποιώντας τον σύνδεσμο 'Προσθήκη εξωτερικού σύνδεσμου στο αριστερό μενού'</p>";

// course info
$langHInfocours = "Διαχείριση Μαθήματος";
$langInfocoursContent = "<p>Μπορείτε να αλλάξετε κάποια από τα στοιχεία του μαθήματος όπως το όνομα του διδάσκοντα, την γλώσσα του μαθήματος, τον τίτλο του και την πρόσβασε σε αυτό. Αφού ολοκληρώσετε τις αλλαγές σας κάντε κλικ στο 'Υποβολή'.
</p>
<p><u>Πρόσβαση στο μάθημα:</u></p>
<p><b>Ανοικτό Μάθημα :</b> μπορεί οποιοσδήποτε να έχει πρόσβαση σε αυτό ακόμα και χωρίς λογαριασμό.</p>
<p><b>Απαιτείται Εγγραφή :</b>έχουν πρόσβαση σε αυτό μόνο όσοι έχουν λογαριασμό στην πλατφόρμα.</p>
<p><b>Κλειστό Μάθημα :</b> έχουν πρόσβαση μόνο όσοι βρίσκονται στην λίστα χρηστών του μαθήματος</p>
<p><u>Άλλες ενέργειες :</u></p>
<p><b>Αντίγραφο ασφαλείας του μαθήματος:</b> Μπορείτε να δημιουργήσετε ένα αντίγραφο ασφαλείας του μαθήματος και να το αποθηκεύσετε τοπικά στον υπολογιστή σας. Σε περίπτωση που θέλετε να ανακτήσετε το περιεχόμενό του θα πρέπει να επικοινωνήσετε με τον διαχειριστή της πλατφόρμας.</p>
<p><b>Διαγραφή του μαθήματος :</b> Διαγράφοντας το μάθημα, διαγράφετε το περιεχόμενό του και οι χρήστες από αυτό. (σημειώστε ότι δεν διαγράφονται από την πλατφόρμα).</p>
<p><b>Ανανέωση μαθήματος :</b> Μπορείτε επιλεκτικά να διαγράψετε κάποια από τα δεδομένα του μαθήματος για να το προετοιμάσετε για την καινούρια ακαδημαϊκή χρονιά.</p>";


// Help Conference
$langHConference = "Τηλεσυνεργασία";
$langHConference_student = $langHConference ;
$langConferenceContent = "<p>Μπορείτε να ανταλλάσετε μηνύματα με όσους χρήστες είναι εγγεγραμμένοι στο μάθημα πληκτρολογώντας το μήνυμά σας και στη συνέχεια κάνοντας κλικ στο πλήκτρο '>>'. Επίσης μπορείτε να διαγράψετε όλα τα μηνύματα που υπάρχουν στην ζωντανή συζήτηση επιλέγοντας 'Καθάρισμα'. Τέλος επιλέγοντας 'Αποθήκευση' όλα τα μηνύματα που ανταλλάξατε αποθηκεύονται στο υποσύστημα έγγραφα</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την τηλεσυνεργασία από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";

//$langHConference_stud = $langHConference;
$langConference_studentContent ="<p>Το υποσύστημα «Τηλεσυνεργασία» (conference) περιλαμβάνει τη λειτουργικότητα ανταλλαγής μηνυμάτων κειμένου (chat). Ο εκπαιδευόμενος έχει την δυνατότητα να ανταλλάσσει μηνύματα με όσους χρήστες είναι εγγεγραμμένοι στο μάθημα πληκτρολογώντας το μήνυμα του και στη συνέχεια κάνοντας κλικ στο πλήκτρο '>>'.
</p>";


// Help Video
$langHVideo = "Βίντεο";
$langHVideo_student = $langHVideo ;
$langVideoContent = "<p>
Μέρος του υλικού των μαθημάτων μπορεί να είναι οπτικοακουστικό υλικό. Οι τρόποι με τους οποίους μπορεί να διανεμηθεί το υλικό αυτό είναι δύο. Ο πρώτος είναι το απλό κατέβασμα των αρχείων τοπικά στο απομακρυσμένο υπολογιστή και η τοπική αναπαραγωγή του μετά την ολοκλήρωση του κατεβάσματος. Ο δεύτερος είναι η διάθεση του οπτικοακουστικού υλικού από έναν εξυπηρετητή ροών με πλεονέκτημα την άμεση αναπαραγωγή του υλικού χωρίς καθυστέρηση στον απομακρυσμένο υπολογιστή. Το υποσύστημα video δίνει την δυνατότητα σύνδεσης της πλατφόρμας με εξυπηρετητή ροών.</p>
<p>
Μπορείτε να ανεβάσετε αρχεία video (τύπου mpeg, avi κ.λπ.) στην πλατφόρμα. Επιλέξτε \"Προσθήκη βίντεο\" και στη συνέχεια πληκτρολογήστε το όνομα του αρχείου ή κάντε κλικ στον πλήκτρο \"Browse\" για να το αναζητήσετε. Επίσης, πληκτρολογήστε στα αντίστοιχα πεδία το τίτλο του βίντεο και, αν επιθυμείτε, μια σύντομη περιγραφή. Μετά κάντε κλικ στο πλήκτρο \"Προσθήκη\" για να γίνει το \"ανέβασμα\" στη πλατφόρμα.</p>
<p>
 Έχετε τη δυνατότητα να προσθέσετε συνδέσμους βιντεοσκοπημένων μαθημάτων στην σελίδα του μαθήματός σας. Επιλέξτε \"Προσθήκη συνδέσμου βίντεο\" πληκτρολογήστε την διεύθυνση του vod server, στον οποίο βρίσκεται το αρχείο βιντεοσκοπημένου μαθήματος που επιθυμείτε να προσθέσετε, στο πεδίο \"URL\". Στη συνέχεια πληκτρολογήστε τον τίτλο και την περιγραφή και τέλος πατήστε το πλήκτρο \"Προσθήκη\". Μπορείτε να αλλάξετε κάποια από τις παραμέτρους επιλέγοντας \"Αλλαγή\" ή να διαγράψετε κάποιο σύνδεσμο ή αρχείο επιλέγοντας \"Διαγραφή\". Επίσης επιλέγοντας \"Διαγραφή όλων\" διαγράφετε όλους τους συνδέσμους προς βιντεοσκοπημένα μαθήματα και όλα τα αρχεία που υπάρχουν στην σελίδα του μαθήματος.</p>
<p>
Αν το σύστημα είναι συνδεμένο με εξυπηρετητή ροών η σύνδεση είναι διάφανη στον εκπαιδευτή και δεν υπάρχει ανάγκη να κάνει κάποια επιπλέον κίνηση ή ενέργεια για να διατεθούν τα αρχεία οπτικοακουστικού υλικού από τον εξυπηρετητή ροών. Πρέπει να έχετε υπ' όψιν σας ότι το υλικό θα είναι διαθέσιμο από τον εξυπηρετητή ροών και εκτός της εφαρμογής Open eClass εάν κάποιος γνωρίζει τον απευθείας σύνδεσμο του αρχείου στον εξυπηρετητή ροών.
</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει τα Video από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";

//$langHVideo_stud = $langHVideo;
$langVideo_studentContent = "<p>Πρόκειται για ένα υποσύστημα διάθεσης οπτικοακουστικού εκπαιδευτικού υλικού. Υπάρχουν αρχεία βίντεο και σύνδεσμοι σε εξωτερικά αρχεία βίντεο που βρίσκονται αποθηκευμένα σε ένα Video On Demand (VOD) Server.
</p>";



// Help course description
$langHCoursedescription = "Περιγραφή Μαθήματος";
$langHCoursedescription_student = $langHCoursedescription ;
$langCoursedescriptionContent = "<p>Έχετε τη δυνατότητα να προσθέσετε πληροφορίες για το μάθημα επιλέγοντας
'Δημιουργία και Διόρθωση'. Οι κατηγορίες είναι: 'Περιεχόμενο Μαθήματος', 'Εκπαιδευτικές Δραστηριότητες', 'Βοηθήματα
Ανθρώπινο Δυναμικό', 'Τρόποι αξιολόγησης/εξέτασης' και 'Συμπληρωματικά Στοιχεία'. Μπορείτε να προσθέσετε μια κατηγορία, επιλέγοντας την από τον κατάλογο με τις υπάρχουσες κατηγορίες και κάνοντας κλικ στο πλήκτρο 'Προσθήκη'.</p><p>
Στην συνέχεια γράφουμε την περιγραφή που αντιστοιχεί στην επιλεγμένη κατηγορία, και μπορούμε να οριστικοποιήσουμε την αλλαγή με το
'Προσθήκη' ή να ακυρώσουμε την περιγραφή της κατηγορίας χρησιμοποιώντας το 'Ακύρωση και επιστροφή'. Για την διόρθωση κάποιας κατηγορίας περιγραφής, μπορεί να χρησιμοποιηθεί το εικονίδιο 'Αλλαγή', ή για την διαγραφή της περιγραφής μιας κατηγορίας
μπορεί να χρησιμοποιηθεί το εικονίδιο 'Διαγραφή', που βρίσκεται στην ίδια γραμμή με την κατηγορία που θέλουμε να επέμβουμε. Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την περιγραφή του μαθήματος από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα</p>$langPHPMathPublisher";

$langCoursedescription_studentContent ="<p>Αν ο υπεύθυνος εκπαιδευτής δημιουργήσει την περιγραφή του μαθήματος, τότε στο υποσύστημα αυτό θα μπορείτε να βρείτε χρήσιμες πληροφορίες που αφορούν την ταυτότητα το μαθήματος, τους στόχους και το εκπαιδευτικό περιεχόμενο, τον τρόπο αξιολόγησης και εξέτασης, το υποστηρικτικό εκπαιδευτικό υλικό και τις εκπαιδευτικές δραστηριότητες και οποιοδήποτε άλλο στοιχείο ο υπεύθυνος εκπαιδευτής κρίνει σημαντικό.</p>";


// Help Scorm / Learning Path
$langHPath="Βοήθεια - Γραμμή Μάθησης";
$langHPath_student=$langHPath ;
$langPathContent="
Το εργαλείο Γραμμή Μάθησης έχει τέσσερις λειτουργίες:
<ul>
<li>Δημιουργία γραμμής μάθησης</li>
<li>Εισαγωγή γραμμής μάθησης από πρότυπο SCORM ή IMS</li>
<li>Εξαγωγή γραμμής μάθησης σε πρότυπο συμβατό με Scorm 2004 ή 1.2</li>
<li>Παρακολούθηση των εκπαιδευόμενων στις γραμμές μάθησης</li>
</ul>

<p><b>Τί είναι η γραμμή μάθησης ;</b></p>

<p>Η γραμμή μάθησης είναι μια ακολουθία από βήματα μάθησης που περιλαμβάνονται σε ενότητες.
Μπορεί να είναι είτε βασισμένη σε περιεχόμενo (μοιάζοντας με πίνακα περιεχομένων)
είτε βασισμένη σε ενέργειες, μοιάζοντας με ατζέντα ή πρόγραμμα του τί χρειάζεται να κάνει
ο εκπαιδευόμενος για να κατανοήσει ή να εκπαιδευτεί σε μια συκγκεκριμένη πηγή γνώσης.
</p>

<p>Επιπροσθέτως του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει μια
συγκεκριμένη αλληλοδιαδοχή. Αυτό σημαίνει πως κάποια βήματα είναι προαπαιτούμενα για τα
αμέσως επόμενα αυτών βήματα (\"δεν μπορείτε να πάτε στο βήμα 2 πρίν το βήμα 1\").
Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική (τα βήματα εμφανίζονται το ένα μετά
το άλλο).</p>

<p><b>Πώς δημιουργείτε τη δικιά σας γραμμή μάθησης ;</b></p>

<p>Το πρώτο βήμα είναι να προσπελάσετε τον τομέα Λίστα Γραμμών Μάθησης. Στην κεντρική
οθόνη της λίστας γραμμών μάθησης, υπάρχει ένας ειδικός σύνδεσμος. Εκεί μπορείτε να
δημιουργήσετε όσες γραμμές μάθησης επιθυμείτε κάνοντας κλικ στο
<i>Δημιουργία νέας γραμμής μάθησης</i>. Δημιουργούνται με αυτόν τον τρόπο κενές
γραμμές μάθησης, μέχρι να τους προσθέσετε ενότητες και βήματα.</p>

<p><b>Ποιά είναι τα βήματα για τις γραμμές αυτές ; (Ποιά είναι τα αντικείμενα που μπορούν να προστεθούν ;)</b></p>

<p>Κάποια από τα εργαλεία, τις ενέργειες και το περιεχόμενο του Open eClass που θεωρείτε
χρήσιμα και κατάλληλα για τη γραμμή σας μπορούν να προστεθούν:</p>

<ul>
<li>Ξεχωριστά έγγραφα (κείμενα, εικόνες, Έγγραφα τύπου Office, ...)</li>
<li>Ετικέτες</li>
<li>Σύνδεσμοι</li>
<li>Ασκήσεις του Open eClass</li>
<li>Περιγραφή μαθήματος</li>
</ul>

<p><b>Άλλα χαρακτηριστικά της Γραμμής Μάθησης</b></p>

<p>Μπορεί να ζητηθεί από τους εκπαιδευόμενους να ακολουθήσουν (αναγνώσουν)
τη γραμμή σας με μια συγκεκριμένη σειρά. Αυτό σημαίνει για παράδειγμα ότι οι
εκπαιδευόμενοι δεν μπορούν να προσπελάσουν την Άσκηση 2 αν δεν έχουν διαβάσει
το Έγγραφο 1. Όλα τα αντικείμενα έχουν κατάσταση: ολοκληρωμένη ή μη ολοκληρωμένη,
επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του ειδικού
εργαλείου <i>Παρακολούθηση γραμμών μάθησης</i>.</p>

<p>Αν θέλετε να τροποποιήσετε τον αρχικό τίτλο ενός βήματος, ο νέος τίτλος
μπορεί να φαίνεται στη γραμμή, χωρίς να επηρεαστεί ο αρχικός. Επομενώς, αν θέλετε
να εμφανίσετε το test8.doc ως 'Τελική Εξέταση' στη γραμμή, δε χρειάζεται να
μετονομάσετε το αρχείο, αλλά αρκεί να χρησιμοποιήσετε έναν άλλο τίτλο στη γραμμή.
Είναι επίσης προτεινόμενο να δίνετε νέους τίτλους στους συνδέσμους αν οι
τελευταίοι έχουν μεγάλο μήκος ονόματος.</p>
<br>


<p><b>Τί είναι η γραμμή μάθησης κατά το πρότυπο Scorm ή IMS και πώς μπορείτε να το εισάγετε ;</b></p>

<p>Το εργαλείο γραμμή μάθησης σας επιτρέπει να ανεβάσετε και να εισάγετε
εκπαιδευτικό περιεχόμενο συμβατό με τα πρότυπα SCORM και IMS.</p>

<p>Το SCORM (<i>Sharable Content Object Reference Model</i>) είναι ένα διεθνές
πρότυπο, με το οποίο έχουν ταχθεί πολλοί κυρίαρχοι οργανισμοί που ασχολούνται
με την ασύγχρονη τηλεκπαίδευση (e-Learning), όπως οι: NETg, Macromedia,
Microsoft, Skillsoft, κλπ και το οποίο δρα σε τρείς τομείς:</p>

<ul>
<li><b>Οικονομία</b>: Το πρότυπο Scorm επιτρέπει σε ολόκληρα μαθήματα ή
μικρότερες ενότητες περιεχομένου να επαναχρησιμοποιηθούν σε διαφορετικές
πλατφόρμες τηλεκπαίδευσης (Learning Management Systems - LMS) μέσω του
διαχωρισμού του περιεχομένου και της δομής του,</li>
<li><b>Παιδαγωγική</b>: Το πρότυπο Scorm ενσωματώνει τις έννοιες των
προαπαιτούμενων ή της <i>αλληλοδιαδοχής</i> (<i>π.χ. </i>\"Δεν
μπορείτε να προσπελάσετε το κεφάλαιο 2 αν δεν ολοκληρώσετε επιτυχώς την Άσκηση 1\"),</li>
<li><b>Τεχνολογία</b>: Το πρότυπο Scorm συνθέτει έναν πίνακα περιεχομένων
ως ένα επιπλέον επίπεδο αφαιρετικότητας, ασχέτως περιεχομένου και πλατφόρμας
τηλεκπαίδευσης. Βοηθάει τις έννοιες του περιεχομένου και της πλατφόρμας
τηλεκπαίδευσης στο να επικοινωνούν μεταξύ τους. Η επικοινωνία αυτή αποτελείται
κυρίως από <i>δείκτες</i> (\"Πού ακριβώς βρίσκεται ο Γιάννης στο μάθημα ;\"),
<i>βαθμολογία</i> (\"Με τί βαθμό πέρασε ο Γιάννης την άσκηση ;\") και <i>χρόνο</i>
(\"Πόσο χρόνο ξόδεψε ο Γιάννης στο κεφάλαιο 1 ;\").</li>
</ul>

<p><b>Πώς δημιουργείτε μια γραμμή μάθησης συμβατή με το πρότυπο SCORM ;</b></p>

<p>Η πιο φυσική μέθοδος είναι να χρησιμοποιήσετε το εργαλείο δημιουργίας γραμμής
μάθησης του Open eClass και στη συνέχεια να το εξάγετε κάνοντας κλικ στο κατάλληλο
εικονίδιο. Όμως, μπορεί να θέλετε να δημιουργήσετε εκπαιδευτικό περιεχόμενο
συμβατό με το πρότυπο Scorm τοπικά στον υπολογιστή σας και στη συνέχεια να το
εισάγετε στο εργαλείο γραμμή μάθησης του Open eClass. Σε αυτήν την περίπτωση, σας
προτείνουμε να χρησιμοποιήσετε κάποιο εξεζητημένο εργαλείο όπως το
Lectora&reg; ή το Reload&reg;</p>

<p><b>Χρήσιμοι σύνδεσμοι</b></p>

<ul>
<li>Adlnet: ή υπεύθυνη αρχή για την κανονικοποίηση του προτύπου Scorm, <a
href=\"http://www.adlnet.org/\">http://www.adlnet.org</a></li>
<li>Reload: εργαλείο Ελεύθερου Λογισμικού/Λογισμικού Ανοικτού Κώδικα για σύνταξη και
ανάγνωση περιεχομένου Scorm, <a
href=\"http://www.reload.ac.uk/\">http://www.reload.ac.uk</a></li>
<li>Lectora: εργαλείο για σύνταξη και δημοσίευση περιεχομένου Scorm, <a
href=\"http://www.trivantis.com/\">http://www.trivantis.com</a></li>
</ul>

<p><b>Σημείωση:</b></p>

<p>Ο τομέας Λίστα γραμμών μάθησης εμφανίζει όλες τις γραμμές μάθησης
<i>που δημιουργήθηκαν μέσω του Open eClass</i> και όλες τις εισηγμένες
γραμμές μάθησης <i>συμβατές με το πρότυπο Scorm</i>.</p>

<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την γραμμή μάθησης από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langPath_studentContent="<p>Ο εκπαιδευόμενος μέσω του υποσυστήματος μπορεί να πλοηγηθεί στις διαθέσιμες γραμμές μάθησης και να ακολουθήσει τα βήματα που έχει ορίσει ο εκπαιδευτής με συγκεκριμένη σειρά. Στις περιπτώσεις που αυτό απαιτείται το υποσύστημα παρακολουθεί την πρόοδο, το χρόνο και τη βαθμολογία του εκπαιδευόμενου στα διάφορα βήματα της εκάστοτε γραμμής μάθησης.</p>";

//Help Dropbox
$langHDropbox="Χώρος Ανταλλαγής Αρχείων";
$langHDropbox_student=$langHDropbox ;
$langDropboxContent="<p>Ο Χώρος Ανταλλαγής Αρχείων είναι ένα εργαλείο ανταλλαγής αρχείων μεταξύ του διδάσκοντα
και των φοιτητών. Μπορείτε να ανταλλάξετε οποιοδήποτε τύπο αρχείων (π.χ. αρχεία Word, Excel, PDF κ.λπ.)</p>
<p>Υπάρχουν δύο κατάλογοι στο Χώρο Ανταλλαγής Αρχείων. Στον κατάλογο <b>Εισερχόμενα Αρχεία</b>
εμφανίζονται τα αρχεία που έχετε παραλάβει από άλλους χρήστες της πλατφόρμας, με κάποιες επιπλέον
πληροφορίες που αφορούν το αρχείο, όπως το όνομα του χρήστη, το μέγεθος του αρχείου και η ημερομηνία που
το παραλάβατε. Στον κατάλογο <b>Απεσταλμένα Αρχεία</b> εμφανίζονται τα αρχεία που έχετε στείλει
σε άλλους χρήστες της πλατφόρμας με τις αντίστοιχες πληροφορίες.</p>
<p>Για να διαγράψετε ένα αρχείο κάντε κλικ στο εικονίδιο (<img src='../../template/classic/img/delete.gif' width=10 height=10 align=baseline>) που βρίσκεται στην ίδια σειρά με το αρχείο που θελετε να διαγράψετε.
Σημειώστε, ότι αν διαγράψετε ένα αρχείο, δεν διαγράφετε από τη βάση δεδομένων της πλατφόρμας πάρα μόνο από τον κατάλογο.</p>
<p>Για να στείλετε ένα αρχείο σε κάποιον χρήστη, αρχικά επιλέξτε το αρχείο στον υπολογιστή σας κάνοντας κλικ στο 'Ανέβασμα αρχείου'. Προαιρετικά μπορείτε να πληκτρολογήστε μια σύντομη περιγραφή.
Επιλέξτε από τον κατάλογο των χρηστών τον παραλήπτη του αρχείου και κάντε κλικ στο πλήκτρο 'Αποστολή'.
Αν θέλετε το αρχείο να σταλεί σε περισσότερους χρήστες, επιλέξτε τους επιθυμητούς παραλήπτες
κάνοντας κλικ με το ποντίκι σας στο όνομα του παραλήπτη και κρατώντας πατημένο το πλήκτρο <b>CTRL (Control)</b>.
</p>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει την ανταλλαγή αρχείων από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>
";
$langDropbox_studentContent='<p>Ο Χώρος Ανταλλαγής Αρχείων είναι ένα εργαλείο ανταλλαγής αρχείων μεταξύ των Εκπαιδευομένων και του υπεύθυνου Εκπαιδευτή. Μπορείτε να ανταλλάξετε οποιοδήποτε τύπο αρχείων κειμένου, εικόνων ή παρουσιάσεων.</p><p>Ειδικότερα, για να στείλετε ένα αρχείο επιλέξτε το σύνδεσμο «Ανέβασμα αρχείου».
</p>' ;

$langHUsage = "Στατιστικά Χρήσης";
$langUsageContent = "<p>Το υποσύστημα αυτό παρέχει τη δυνατότητα στον καθηγητή να δει στατιστικά που αφορούν το μάθημα του. Τα στατιστικά αυτά παρουσιάζονται υπό τη μορφή γραφικών παραστάσεων ή λίστας.</p>
<p><strong>Κατηγορίες στατιστικών</strong></p>
<ul>
<li>Στατιστικά χρήσης</li>
<li>Προτίμηση υποσυστημάτων</li>
<li>Επισκέψεις χρηστών στο μάθημα</li>
<li>Εμφάνιση παλιών στατιστικών</li>
</ul>
<p>Τα στατιστικά χρήσης μπορούν να ομαδοποιηθούν κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποια υποσυστήματα χρειάζονται στατιστικά και η χρονική διάρκεια τους.</p>
<p>Τα στατιστικά προτίμησης υποσυστημάτων  μπορούν να ομαδοποιηθούν κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποιους χρήστες χρειάζονται στατιστικά.</p>
<p>Τα στατιστικά επισκέψεων χρηστών στο μάθημα  μπορούν να ομαδοποιηθούν βάσει των χρηστών για ποιους χρήστες χρειάζονται στατιστικά.</p>
<p>Η εμφάνιση παλιών στατιστικών μπορεί να ομαδοποιηθεί κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποια υποσυστήματα χρειάζονται στατιστικά και η χρονική διάρκεια τους.</p>
";

//Help Create Course Wizard
$langHCreateCourse = "Δημιουργία μαθήματος";
$langCreateCourseContent = "<p>Ο οδηγός δημιουργίας μαθημάτων αποτελεί ένα πολύ σημαντικό εργαλείο της πλατφόρμας, αφού μέσω αυτού ο χρήστης-καθηγητής μπορεί να δημιουργεί νέα μαθήματα.</p><p>Ο οδηγός αποτελείται από 3 βήματα. Η συμπλήρωση απαιτούμενων πληροφοριών στα πεδία με αστερίσκο είναι απαραίτητη. Κάτω από κάθε πεδίο βρίσκεται μια ενδεικτική τιμή για να βοηθήσει τον χρήστη στη συμπλήρωσή τους.</p><p>Σε περίπτωση συμπλήρωσης ενός πεδίου με λανθασμένη τιμή, το σύστημα ενημερώνει τον χρήστη για το λάθος του και τον προτρέπει να το διορθώσει προκειμένου να μπορεί να μεταφερθεί στο επόμενο βήμα.</p>";

// Wiki Help
$langHWiki = "Σύστημα - Wiki";
$langHWiki_student = $langHWiki ;
$langWikiContent = "<p>Για να δημιουργήσετε ένα νέο Wiki</p>
<ul>
<li>Κάντε κλικ στο σύνδεσμο 'Δημιουργήστε ένα νέο Wiki'. Μετά εισάγετε τις ιδιότητες του Wiki:</li>
<li><b>Τίτλος του Wiki</b> : επιλέξτε έναν τίτλο για το Wiki</li>
<li><b>Περιγραφή του Wiki</b> : επιλέξτε μια περιγραφή για το Wiki</li>
<li><b>Διαχείριση ελέγχου πρόσβασης</b> : θέστε τον έλεγχο πρόσβασης για τον Wiki επιλέγοντας/αποεπιλέγοντας το κουτί (δείτε πιο κάτω)</li>
</ul>
<p>Για να εισάγετε το Wiki κάντε κλικ στον τίτλο του Wiki στον κατάλογο. </p>
<p> Για να αλλάξετε τις ιδιότητες του Wiki κάντε κλικ στο εικονίδιο <img src='../../template/classic/img/edit.gif' align='absmiddle' border='0'>.</p>

<p>Για να διαγράψετε το wiki κάντε κλικ στο εικονίδιο <img src='../../template/classic/img/delete.gif' align='absmiddle' border='0'></p>
<p>Για να δείτε τον κατάλογο των τελευταίων τροποποιημένων σελίδων κάντε κλικ στο εικονίδιο <img src='../../template/classic/img/history.gif' align='absmiddle' border='0'></p>

<p>Χρησιμοποιήστε τα εικονίδια για να μορφοποιήσετε το κείμενό σας. Σημειώστε ότι μπορείτε να δημιουργήστε σύνδεσμο (επιλέγοντας το κείμενο σας και κάνοντας κλικ στο εικονίδιο <img src='../../modules/wiki/toolbar/bt_link.png' align='absmiddle' border='0'>) προς μια καινούρια σελίδα του wiki την οποία θα δημιουργήσετε στη συνέχεια. Εναλλακτικά, κείμενο το οποίο περικλείεται σε αγκύλες μετατρέπεται αυτόματα σε εσωτερικό σύνδεσμο προς την αντίστοιχη σελίδα (π.χ. στη φράση «Η [λύση του προβλήματος] είναι», το κείμενο στις αγκύλες θα μετατραπεί σε σύνδεσμο).

<h4>Σύνταξη των εντολών</h4>
<p>Δημιουρία σελίδων wiki και συνδέσμων μεταξύ τους</p>
<p><strong>Λέξεις του wiki</strong>: Οι λέξεις του Wiki είναι λέξεις που είναι γραμμένες σαν <em>Λέξη</em>. Για να δημιουργήσετε μια σελίδα wiki ή ένα σύνδεσμο προς μια σελίδα wiki, διορθώστε μια υπάρχουσα και προσθέστε τον τίτλο της σελίδας σύμφωνα με την σύνταξη. Για παράδειγμα <em>Η σελίδα μου</em>, και ύστερα αποθηκεύστε την. Αυτόματα η λέξη <em>H σελίδα μου</em> θα αντικατασταθεί με ένα σύνδεσμο στη σελίδα Wiki <em>Η σελίδα μου</em>&nbsp;</p>
<p><strong>Σύνδεσμοι Wiki</strong>: Οι σύνδεσμοι Wiki είναι σαν τους υπερσυνδέσμους (βλέπε παρακάτω) εκτός του ότι δεν έχουν αναφορά σε κάποιο πρωτόκολλο (όπως π.χ. <em>http://</em> ή <em>ftp://</em>) και αυτόματα μετατρέπονται σε συνδέσμους σε σελίδες Wiki. Για να δημιουργήσουμε μια καινούρια σελίδα ή ένα σύνδεσμο σε μια υπάρχουσα, διορθώστε την σελίδα και προσθέστε <code>[τίτλο σελίδας]</code> ή <code>[όνομα συνδέσμου|τίτλο σελίδας]</code> προς το περιεχόμενο. Μπορείτε να χρησιμοποιήσετε την παρακάτω σύνταξη για να αλλάξετε το όνομα ενός συνδέσμου Wiki: <code>[όνομα συνδέσμου|λέξη]</code>.</p>
<ul>Υπερσύνδεσμοι
<li><code>[url]</code>, <code>[όνομα|url]</code>, <code>[όνομα|url|γλώσσα]</code> ή <code>[όνομα|url|γλώσσα|τίτλος]</code>.&nbsp;</li></ul>
<ul>Εισαγωγή Εικόνας
<li><code>((url|εναλλακτικό κείμενο))</code>, <code>((url|εναλλακτικό κείμενο|θέση))</code> ή <code>((url|εναλλακτικό κείμενο|θέση|περιγραφή))</code>. <br />Το όρισμα θέσης μπορεί να πάρει τις ακόλουθες τιμές : L (αριστερά), R (δεξιά) ή C (κέντρο).&nbsp;
Επίσης μπορείτε να χρησιμοποιήσετε την σύνταξη των υπερσυνδέσμων. Για παράδειγμα <code>[τίτλος|image.gif]</code>. Πλέον η σύνταξη τείνει να καταργηθεί οπότε καλύτερα να χρησιμοποιήτε την προηγούμενη &nbsp;</li></ul>
<ul>Σύνδεσμο σε εικόνα
<li>σαν τους υπερσυνδέσμου απλά βάλτε ένα 1 σαν πέμπτο όρισμα για να αποφύγετε το φόρτωμα της εικόνας οπότε θα πάρετε ένα υπερσύνδεσμο σε μια εικόνα. Για παράδειγμα <code>[εικόνα|image.gif||0]</code> θα παρουσιάσει ένα σύνδεσμο στην εικόνα image.gif αντί για την ίδια την εικόνα.</li></ul>
<p>Σελιδοποίηση</p>
<ul>
<li><strong>Πλάγια</strong>: περικλείστε το κείμενό σας με απλά εισαγωγικά <code>''κείμενο''</code>&nbsp;</li>
<li><strong>Έντονα</strong>: περικλείστε το κείμενό σας με τρία απλά εισαγωγικά <code>'''text'''</code>&nbsp;</li>
<li><strong>Υπογραμμισμένα</strong>: περικλείστε το κείμενό σας με 2 χαρακτήρες υπογράμμισης <code>__κείμενο__</code>&nbsp;</li>
<li><strong>Διαγραμμισμένα</strong>: περικλείστε το κείμενό σας με δύο παύλες <code>--κείμενο--</code>&nbsp;</li>
<li><strong>Τίτλος</strong>: <code>!!!</code>, <code>!!</code>, <code>!</code> για τίτλους, υπότιτλους, υπο-υπότιτλους αντίστοιχα&nbsp;</li>
<li>Λίστα</li>
Η γραμμή πρέπει να ξεκινάει με <code>*</code> (μη διατεταγμένη λίστα) ή <code>#</code> (διατεταγμένη λίστα). Μπορείτε να ανακατέψετε λίστες (<code>*#*</code>) για να δημιουργήσετε λίστες πολλών επιπέδων.&nbsp;
<li>Παράγραφος</li>
Χωρίστε τις παραγράφους με μία ή περισσότερες γραμμές&nbsp;
</ul>

<h4>Προχωρημένη σύνταξη</h4>
<ul>
<li>Υποσημείωση</li>
<code>$$ κείμενο υποσημείωσης$$</code>&nbsp;
<li>Κείμενο με έτοιμη μορφοποίηση</li>
Ξεκινήστε κάθε γραμμή με ένα κενό &nbsp;
<li>Μπλόκ αναφοράς</li>
<code>&gt;</code> ή <code>;:</code> πριν από κάθε γραμμή &nbsp;
<li>Οριζόντια γραμμή</li>
<code>----</code>&nbsp;
<li>Αναγκαστική αλλαγή γραμμής</li>
<code>%%%</code>&nbsp;
<li>Ακρωνύμιο</li>
<code>??ακρωνύμιο??</code> ή <code>??ακρωνύμιο|ορισμός??</code>&nbsp;
<li>Άμεση αναφορά</li>
<code>{{αναφορά}}</code>, <code>{{αναφορά|γλώσσα}}</code> ή <code>{{αναφορά|γλώσσα|url}}</code>&nbsp;
</ul>
</ul>
<p>Ο Σύνδεσμος 'Απενεργοποίηση' / 'Ενεργοποίηση' μεταφέρει το σύστημα Wiki από τα ενεργά στα ανενεργά εργαλεία και αντίστροφα.</p>";


$langWiki_studentContent = "<p>Το σύστημα Wiki είναι ένα συνεργατικό εργαλείο μάθησης που ενσωματώνεται στην τρέχουσα έκδοση της πλατφόρμας Open eClass. Επιτρέπει στους συμμετέχοντες στο μάθημα εκπαιδευτές κι εκπαιδευόμενους να επεξεργάζονται από κοινού το περιεχόμενο διαφόρων κειμένων.</p>";

// Help Course Units
$langHAddCourseUnits = "Προσθήκη/Διόρθωση θεματικής ενότητας";
$langAddCourseUnitsContent = "<p class='helptopic'>Για να προσθέσετε μια νέα θεματική ενότητα εισάγετε ένα τίτλο και μια σύντομη περιγραφή της ενότητας. Μόλις ολοκληρώσετε κάντε κλικ στο πλήκτρου 'Προσθήκη' για να προστεθεί μια νέα θεματική ενότητα.</p>";

$langHAddCourseUnitscontent = "Προσθήκη περιεχομένου θεματικής ενότητας";
$langAddCourseUnitscontentContent = "<p class='helptopic'>Σε αυτή την οθόνη προστίθεται περιεχόμενο ή πόροι στην επιλεγμένη θεματική ενότητα. Το είδος των πόρων που μπορούν να προστεθούν αναφέρονται δίπλα από την λέξη 'Προσθήκη:'. Κάνοντας κλικ στο 'Προσθήκη' εμφανίζονται οι διαθέσιμοι πόροι του μαθήματος που αντιστοιχούν στον επιλεγμένο τύπο. Επιλέξτε τους πόρους που επιθυμείται και μετά κάντε κλικ στο 'Προσθήκη επιλεγμένων'. Κάθε πόρος που προστίθεται, εμφανίζεται σε λίστα ενώ δεξιά του εμφανίζονται τα εικονίδια διόρθωσης και διαγραφής. Σημειώστε ότι στην περίπτωση που υπάρχουν περισσότερες από μία θεματικές ενότητες σε ένα μάθημα, εμφανίζεται σύνδεσμοι προς την επόμενη ή την προηγούμενη ενότητα. Εναλλακτικά μπορεί να χρησιμοποιηθεί και ο κατάλογος επιλογών που εμφανίζεται στο κάτω μέρος της σελίδας, για να μπορεί να γίνει μετάβαση απ' ευθείας σε κάποια ενότητα.</p>";
