<?
/*
      +----------------------------------------------------------------------+
      | GUnet eClass 2.0                                                     |
      | Asychronous Teleteaching Platform                                    |
      +----------------------------------------------------------------------+
      | Copyright (c) 2003-2007  GUnet                                       |
      +----------------------------------------------------------------------+
      |                                                                      |
      | GUnet eClass 2.0 is an open platform distributed in the hope that    |
      | it will be useful (without any warranty), under the terms of the     |
      | GNU License (General Public License) as published by the Free        |
      | Software Foundation. The full license can be read in "license.txt".  |
      |                                                                      |
      | Main Developers Group: Costas Tsibanis <k.tsibanis@noc.uoa.gr>       |
      |                        Yannis Exidaridis <jexi@noc.uoa.gr>           |
      |                        Alexandros Diamantidis <adia@noc.uoa.gr>      |
      |                        Tilemachos Raptis <traptis@noc.uoa.gr>        |
      |                                                                      |
      | For a full list of contributors, see "credits.txt".                  |
      |                                                                      |
      +----------------------------------------------------------------------+
      | Contact address: Asynchronous Teleteaching Group (eclass@gunet.gr),  |
      |                  Network Operations Center, University of Athens,    |
      |                  Panepistimiopolis Ilissia, 15784, Athens, Greece    |
      +----------------------------------------------------------------------+
*/

// help_forums.php

$langClose="Κλείσιμο παραθύρου";

$langHDefault='Βοήθεια μη διαθέσιμη';
$langDefaultContent='<p>Δεν υπάρχει κείμενο βοήθειας για την περιοχή
της πλατφόρμας στην οποία βρίσκεστε.</p>';


$langHFor="Βοήθεια περιοχής συζητήσεων";
$langForContent="<p>Οι περιοχές συζητήσεων είναι ένα εργαλείο για ασύγχρονη
γραπτή επικοινωνία. Ενώ το ηλεκτρονικό ταχυδρομείο επιτρέπει το διάλογο ανάμεσα
σε δύο μόνο άτομα, οι περιοχές συζητήσεων επιτρέπουν δημόσιες συζητήσεις. Από
τεχνική άποψη, για τη χρήση μιας περιοχής συζητήσεων απαιτείται μόνο ένα
πρόγραμμα browser.</p>

<p>Για την οργάνωση των περιοχών συζητήσεων, κάντε κλίκ στο «Διαχείριση». Οι
συζητήσεις είναι οργανωμένες σε σύνολα και υποσύνολα ως εξής:</p>

<p><b>Κατηγορία > Περιοχή > Θέμα > Απαντήσεις</b></p>

<p>Για να έχετε τακτοποιημένες τις συζητήσεις των φοιτητών σας, είναι
απαραίτητο να οργανώσετε κατηγορίες και περιοχές από πριν, και να αφήσετε τη
δημιουργία των θεμάτων και των απαντήσεων σε αυτούς. Οι περιοχές συζητήσεων του
eClass έχουν μια περιοχή συζήτησης και ένα θέμα ως δείγματα.</p>

<p>Το πρώτο πράγμα που πρέπει να κάνετε είναι να διαγράψετε το δοκιμαστικό θέμα
και να μετονομάσετε την περιοχή συζήτησης. Στη συνέχεια, μπορείτε να
δημιουργήσετε και άλλες περιοχές, κατά ομάδες ή κατά θέματα, που να ταιριάζουν
στις εκπαιδευτικές σας ανάγκες.</p> <p>Μην ανακατεύετε τις κατηγορίες και τις
περιοχές συζητήσεων, και μην ξεχνάτε ότι μια κενή κατηγορία (χωρίς περιοχές)
δεν εμφανίζεται στις σελίδες που βλέπουν οι φοιτητές.</p>

<p>Η περιγραφή κάποιας περιοχής μπορεί να περιλαμβάνει τον κατάλογο των μελών
της, το σκοπό της, κάποιο έργο ή θέμα, κλπ.</p>";

// help_home.php

$langHHome="Βοήθεια";
$langHomeContent="<p>Για περισσότερη ευκολία, τα εργαλεία του eClass δε
δημιουργούνται κενά. Σε κάθε εργαλείο υπάρχει ένα μικρό παράδειγμα για να σας
βοηθήσει να κατανοήσετε ευκολότερα τον τρόπο λειτουργίας του.  Μπορείτε να
επιλέξετε να σβήσετε αυτό το παράδειγμα ή να το αλλάξετε.</p>

<p>Για παράδειγμα, στην αρχική σελίδα του μαθήματός σας, υπάρχει ένα μικρό
κείμενο που λέει «Εισαγωγικό κείμενο του μαθήματος. Αντικαταστήτε το με το δικό
σας, κάνοντας κλίκ στην Αλλαγή». Πιέστε το «Αλλαγή», διορθώστε το κείμενο και
πιέστε «Επικύρωση». Κάθε εργαλείο έχει την ίδια απλή λογική: προσθέτετε,
διαγράφετε, αλλάζετε - οι σελίδες του μαθήματος είναι δυναμικές.</p>

<p>Όταν πρωτοδημιουργείτε τις σελίδες του μαθήματός σας, τα περισσότερα
εργαλεία είναι ενεργοποιημένα. Κι εδώ, είναι δική σας επιλογή να
απενεργοποιήσετε αυτά που δε χρειάζεστε. Απλώς κάντε κλίκ στο «Απενεργοποίηση».
Τότε, μεταφέρετε στο γκρίζο μέρος της σελίδας. Δεν είναι πια ορατό από τους
φοιτητές σας, αλλά μπορείτε να το ξαναενεργοποιήσετε όποτε θέλετε.</p>

<p>Μπορείτε να προσθέσετε τις δικές σας σελίδες στην αρχική σελίδα του
μαθήματος. Αυτές οι σελίδες πρέπει να είναι σε μορφή HTML, και που μπορεί να
δημιουργηθεί με κάποιον επεξεργαστή κειμένου ή πρόγραμμα δημιουργίας
ιστοσελίδων. Χρησιμοποιείστε την επιλογή «Ανέβασμα σελίδας και δημιουργία
συνδέσμου στην Αρχική Σελίδα» για να στείλετε τη σελίδα σας στον εξυπηρετητή. Η
επικεφαλίδα του δικτυακού τόπου θα ενσωματωθεί αυτόματα στις σελίδες σας, οπότε
χρειάζεται μόνο να σκεφτείτε για το περιεχόμενο των σελίδων. Αν θέλετε να
προσθέσετε συνδέσμους από την αρχική σελίδα του μαθήματος προς υπάρχουσες
ιστοσελίδες που υπάρχουν ήδη κάπου αλλού στο δίκτυο (ή ακόμα κάπου αλλού στον
δικό σας δικτυακό τόπο), χρησιμοποιήστε την «Προσθήκη συνδέσμου στην αρχική
σελίδα». Οι σελίδες που προσθέτετε εσείς στην αρχική σελίδα μπορούν να
απενεργοποιηθούν και να διαγραφούν, ενώ τα ενσωματωμένα εργαλεία μπορούν να
απενεργοποιηθούν μόνο, αλλά όχι να διαγραφούν.</p>

<p>Όταν η σελίδα του μαθήματός σας είναι έτοιμη, μπορείτε να καθορίσετε τα
δικαιώματα πρόσβασης για τους χρήστες του συστήματος, από την επιλογή «Αλλαγή
πληροφορίας για το μάθημα». Στην αρχή, είναι κρυμμένη (γιατί δουλεύετε ακόμη σε
αυτήν).</p>";


$langHInit = "Αρχική Σελίδα";
$langInitContent = "<p class='helptopic'>Βρίσκεστε στην Αρχική Σελίδα της
πλατφόρμας eClass. Για να χρησιμοποιήσετε την πλατφόρμα πληκτρολογήστε το όνομα
χρήστη και το συνθηματικό σας. Αν δεν θυμάστε τα στοιχεία σας, κάντε κλικ στο
σύνδεσμο 'Ξεχάσατε το συνθηματικό σας' και στην φόρμα που θα σας εμφανιστεί,
συμπληρώστε την ηλεκτρονική σας διεύθυνση που δηλώσατε κατά την εγγραφή σας
στην πλατφόρμα για να σταλούν τα στοιχεία σας.</p>

<p class='helptopic'>Αν είστε φοιτητής και δεν έχετε λογαριασμό, κάντε κλικ στο
σύνδεσμο 'Εγγραφή Φοιτητή' για να αποκτήσετε. Αν θέλετε να αποκτήσετε
λογαριασμό με δικαιώματα 'καθηγητή', κάντε κλικ στο σύνδεσμο 'Εγγραφή καθηγητή'
για να συμπληρώσετε την 'Αίτηση Εγγραφής Καθηγητή'</p>

<p class='helptopic'>Για περισσότερες πληροφορίες σχετικά με τη λειτουργία της
πλατφόρμας διαβάστε τα σχετικά εγχειρίδια χρήσης.</p>";


$langHPortfolio="Χαρτοφυλάκιο χρήστη";
$langPortfolioContent="<p>Σε αυτή τη σελίδα εμφανίζονται τα μαθήματα στα
οποία είστε εγγεγραμμένος (ως φοιτητής) ή έχετε δημιουργήσει (ως καθηγητής).
Μπορείτε να παρακολούθησετε όποιο επιθυμείτε επιλέγοντας τον αντίστοιχο
τίτλο.</p>

<p>Μέσω των συνδέσμων του μενού, μπορείτε να εγγραφείτε σε άλλα μαθήματα ή
να απεγγραφείτε από αυτά που παρακολουθείτε, να αλλάξετε τα στοιχεία του
προφίλ σας όπως όνομα, συνθηματικό και προτιμώμενη γλώσσα, καθώς και
να δείτε συγκεντρωτικά τις ανακοινώσεις και το ημερολόγιο των μαθημάτων
σας.</p>
";

$langHcourse_home_stud='Κεντρική σελίδα μαθήματος';
$langcourse_home_studContent='<p>Βρίσκεστε στην κεντρική σελίδα του
ηλεκτρονικού μαθήματος. Από τις επιλογές του μενού στο αριστερό μέρος της
οθόνης, μπορείτε να μεταβείτε στα υποσυστήματα που έχουν ενεργοποιηθεί από
τους διδάσκοντες του μαθήματος.</p>';

$langHcourse_home_prof='Κεντρική σελίδα μαθήματος';
$langcourse_home_profContent='<p class="helptopic">Βρίσκεστε στην κεντρική σελίδα του
ηλεκτρονικού μαθήματός σας. Από τις επιλογές του μενού στο αριστερό μέρος της
οθόνης, μπορείτε να μεταβείτε στα υποσυστήματα του μαθήματος, στα οποία
μπορείτε να προσθέσετε το εκπαιδευτικό υλικό του μαθήματος. Τα
ενεργά εργαλεία είναι διαθέσιμα και στους φοιτητές/επισκέπτες του μαθήματος,
ενώ τα ανενεργά εμφανίζονται μόνο στο διδάσκοντα.</p>
<p class="helptopic">Από τα εργαλεία διαχείρισης μπορείτε να ενεργοποιήσετε ή να
απενεργοποιήσετε τα υποσυστήματα που επιθυμείτε, να διαχειριστείτε
τους εγγεγραμμένους χρήστες, να αλλάξετε διάφορες επιλογές του μαθήματος
(όπως τίτλο, έλεγχο πρόσβασης κλπ.), και να λάβετε στατιστικά χρήσης
του μαθήματος.</p>';


$langHDoc="Βοήθεια";
$langDocContent="<p>Το εργαλείο αρχείων είναι όμοιο σε λειτουργία με τον
Διαχειριστή Αρχείων του προσωπικού σας υπολογιστή.</p>

<p>Μπορείτε να ανεβάσετε αρχεία οποιουδήποτε τύπου (HTML, Word, Powerpoint,
Excel, Acrobat, Flash, Quicktime, κ.λπ.). Ο μόνος σας περιορισμός είναι ότι οι
φοιτητές πρέπει να έχουν εγκατεστημένη στον υπολογιστή τους την αντίστοιχη
εφαρμογή για να τα διαβάσουν.  Μερικοί τύποι αρχείων μπορεί να περιέχουν ιούς,
έτσι είναι δικιά σας ευθύνη να μην ανεβάζετε μολυσμένα αρχεία. Συνίσταται να
ελέγχεται τα έγγραφα σας με ένα αντιβιοτικό πρόγραμμα πριν τα ανεβάσετε.</p>

<p>Τα έγγραφα παρουσιάζονται με αλφαβητική σειρά.
<br><b>Συμβουλή:</b> Αν θέλετε να τα παρουσιάσετε με διαφορετική σειρά,
αριθμήστε τα: 01, 02, 03...</p>

<p>Μπορείτε :</p>

<h4>Να ανεβάσετε ένα αρχείο</h4>
<ul>
  <li>Επιλέξτε το αρχείο στον υπολογιστή σας χρησιμοποιώντας το πλήκτρο Browse <input
 type=submit value=Browse name=submit2>
    στο δεξί μέρος της οθόνης σας.</li>
  <li>Ξεκινήστε το ανέβασμα με το πλήκτρο Ανέβασμα <input type=submit
 value=Ανέβασμα name=submit2>
    .</li>
</ul>
<h4>Μετονομάστε ένα έγγραφο (ένα κατάλογο)</h4>
<ul>
  <li>κάντε κλίκ στο <img src=../../template/classic/img/renommer.gif width=20 height=20
 align=baseline> πλήκτρο στη
  στήλη Μετονομασία</li>
  <li>Πληκτρολογήστε το καινούριο όνομα στο πεδίο (πάνω αριστερά)</li>
  <li>Επιβεβαιώστε το κάνοντας κλίκ στο <input type=submit value=Ok name=submit24>.
</ul>
    <h4>Διαγραφή ενός αρχείου (ή ενος καταλόγου)</h4>
    <ul>

  <li>Κάντε κλίκ <img src=../../template/classic/img/supprimer.gif width=20 height=20>
    στη στήλη 'Διαγραφή'.</li>
    </ul>
    <h4>Μετατροπή ενός αρχείου (ή καταλόγου) σε αόρατο για τους φοιτητές</h4>
    <ul>

  <li>Κάντε κλίκ <img src=../../template/classic/img/visible.gif width=20 height=20>
 στη στήλη 'Ορατό/Αόρατο'.</li>
      <li>Το αρχείου (ή κατάλογο) υπάρχει αλλά δεν είναι ορατό από τους φοιτητές πλέον.</li>
  <li>Γα να το κάνετε αόρατο ξανά, κάντε κλίκ στη <img
 src=../../template/classic/img/invisible.gif width=24 height=20>
    στήλη 'Ορατό/Αόρατο'</li>
    </ul>
    <h4>Προσθήκη ή τροποποίηση σχολίου σε ένα αρχείο (ή ενός καταλόγου)</h4>
    <ul>
  <li>Κάντε κλίκ <img src=../../template/classic/img/comment.gif width=20
 height=20>
    στη στήλη 'Σχόλιο'</li>
      <li>Πληκτρολογήστε καινούριο σχόλιο στο αντίστοιχο πεδίο (πάνω δεξιά).</li>
      <li>Επιβεβαιώστε το κάντε κλίκ στο <input type=submit value=OK name=submit2>.</li>
    </ul>
    <p>Για να διαγράψετε ένα σχόλιο, κάντε κλίκ στο <img
 src=../../template/classic/img/comment.gif width=20 height=20>,
     για να διαγράψετε το παλιό σχόλιο στο πεδίο κα κάντε κλίκ στο<input type=submit
 value=OK name=submit22>.
    <hr>
    <p>Μπορείτε να οργανώσετε το περιεχόμενό σας μέσο αρχειοθέτησης. Για το σκοπό αυτό:</p>
    <h4><b>Δημιουργήστε ένα κατάλογο</b></h4>
    <ul>
      <li>Κάντε κλίκ στο <img src=../../template/classic/img/dossier.gif width=20
 height=20> 'Δημιουργία ενός καταλόγου' (πάνω αριστερά)</li>
      <li>Πληκτρολογήστε το όνομα του καινούριου σας καταλόγου στο αντίστοιχο πεδίο (πάνω αριστερά)</li>
      <li>Επιβεβαιώστε το κάνοντας κλίκ στο<input type=submit value=OK
 name=submit23>.</li>
    </ul>
    <h4>Μετακίνηση ενός αρχείου (ή καταλόγου)</h4>
    <ul>
      <li>Κάντε κλικ στο πλήκτρο <img src=../../template/classic/img/deplacer.gif
 width=34 height=16>
        στη στήλη 'Μετακίνηση'</li>
      <li>Επιλέξτε τον κατάλογο μέσα στον οποίο θέλετε να μετακινήσετε το έγγραφο (ή το κατάλογο) στο
     αντίστοιχο κυλιόμενο μενού (πάνω αριστερά) (σημείωση: η λέξη 'αρχικό κατάλογο' σημαίνει ότι
     δεν μπορείτε να πάτε πάνω από αυτό το επίπεδο στο δέντρο αρχείων του εξυπηρέτη).</li>
      <li>Επιβεβαιώστε το κάνοντας κλίκ στο <input type=submit value=OK
 name=submit232>.</li>
    </ul>
    <center>
      <p>";



// Help_user.php

$langHUser="Βοήθεια";
$langUserContent="<b>Ρόλοι</b><p>Οι ρόλοι των χρηστών στην πλατφόρμα δεν
σχετίζονται καθόλου με τον υπολογιστή στον οποίο τρέχει η πλατφόρμα. Αυτό
σημαίνει ότι δεν δίνουν κανένα δικαιώμα πάνω στο λειτουργικό σύστημα.  Συνήθως
δείχνουν στους ανθρώπους, ποιος είναι ποιος.</p>
<hr>
<b>Δικαιώματα Διαχειριστή</b>
<p>Τα δικαιώματα διαχειριστή, από την άλλη, ανταποκρίνονται στην τεχνική
 εξουσιοδότηση να αλλάξετε τα περιεχόμενα και τον οργάνωση του μαθήματος.</p>
<p>Για να επιτρέψετε σε ένα βοηθό, για παράδειγμα, να συν-διαχειριστεί το
μάθημα, αρκεί να τον εγγράψετε στο μάθημα ή να βεβαιωθείτε ότι είναι ήδη
γραμμένος, ύστερα κάντε κλίκ στην 'Αλλαγή'  κάτω από τα 'Δικαιώματα
Διαχειριστή', ύστερα κάντε κλίκ στο 'Ολα', ύστερα στο 'Εντάξει'.</P><hr>
<b>Συνδιδάσκοντας</b>
<p>Για να αναφέρετε στην επικεφαλίδα του μαθήματος το όνομα ενός συνδιδάσκοντα,
 χρησιμοποιήστε το εργαλείο 'Αλλαγή πληροφορίας για το Μάθημα' .
 Αυτή η αλλαγή δεν κάνει τον συνδιδάσκοντά σας ένα χρήστη ενός μαθήματος.
 Το πεδίο 'Καθηγητές' είναι εντελώς ανεξάρτητο από τη λίστα των χρηστών.</p><hr>
<b>Προσθήκη ενός χρήστη</b>
<p>Για να προσθέσετε ένα χρήστη στο μάθημά σας, συμπληρώστε τα πεδία και
επιβεβαιώστε το. Ο χρήστης θα λάβει ένα e-mail που θα τον/την ενημερώνει ότι
τον/την έχετε εγγράψει και απλά πείτε του/της ή θυμήστε του/της το όνομα χρήστη
και το συνθηματικό.</p>";

// Help guest user

$langHGuest = "Προσθήκη χρήστη επισκέπτη";
$langGuestContent = "Επιλέγοντας 'Προσθήκη χρήστη Επισκέπτη' σας δίνετε η δυνατότητα να δημιουργήσετε ένα χρήστη επισκέπτη,
τα στοιχεία του οποίου θα γνωστοποιήσετε στους χρήστες οι οποίοι είναι εγγεγραμμένοι στο μάθημα (ή στην πλατφόρμα). Ένας
χρήστης επισκέπτης, έχει τη δυνατότητα να βλέπει την αρχική σελίδα του μαθήματος στο οποίο είναι γραμμένος και όλα τα
εργαλεία που είναι ενεργοποιημένα, αλλά δεν μπορεί να εκτελέσει λειτουργίες όπως να ανεβάσει εργασίες.";

// Help survey
$langHSurvey="Βοήθεια";
$langSurveyContent="<p>Το εργαλείο των ερωτηματολογίων μαθησιακού προφίλ (Ε.Μ.Π.) επιτρέπει στον
καθηγητή την δημιουργία και διαχείριση Ε.Μ.Π. Για να σας
εμφανίζεται σαν επιλογή πρέπει να είναι πρώτα ενεργοποιημένο για το
τρέχον μάθημα.</p>
<p>καθηγητής θα μπορεί να ενεργοποιήσει την λειτουργία
σε όσα μαθήματα επιθυμεί. Στην πρώτη σελίδα των Ε.Μ.Π. ενός
μαθήματος ενημερώνεται ο καθηγητής για τα ενεργά και ανενεργά Ε.Μ.Π.
που αντιστοιχούν στο τρέχον μάθημα . Επίσης θα μπορεί να προβεί σε
λειτουργίες όπως προσθήκη, διαγραφή, ενεργοποίηση/απενεργοποίηση.
Κατά την δημιουργία μιας δημοσόπισης ο καθηγητής θα καθορίζει ερώτηση
και όσες απαντήσεις επιθυμεί. Υπάρχουν έτοιμες ερωτήσεις-οδηγεί βασισμένες στα πρότυπα COLLES/ATTL.
Επίσης θα καθορίζει το χρονικό διάστημα
κατά το οποίο η δημοσκόπηση θα είναι ενεργή (ημερομηνία έναρξης-λήξης).
Μέσα από την σελίδα του μαθήματος ο μαθητής θα μπορεί να επισκεφτεί την
σελίδα των Ε.Μ.Π., εφόσον υπάρχουν για το τρέχον μάθημα, και να
τις δεί σε μία λίστα. Επιλέγοντας την Ε.Μ.Π. που τον ενδιαφέρει
από την προηγούμενη λίστα θα μπορεί να επιλέξει μία από τις πιθανές
απαντήσεις. </p>
<p>Αποτελέσματα μπορεί να δεί και ο καθηγητής από την σελίδα
διαχείρισης τoυ Ε.Μ.Π.</p>";

// Help poll.php
$langHPoll="Βοήθεια";
$langPollContent="<p>Το εργαλείο των δημοσκοπίσεων επιτρέπει στον
καθηγητή την δημιουργία και διαχείριση δημοσκοπήσεων. Για να σας
εμφανίζεται σαν επιλογή πρέπει να είναι πρώτα ενεργοποιημένο για το
τρέχον μάθημα.</p>
<p>καθηγητής θα μπορεί να ενεργοποιήσει την λειτουργία δημοσκοπήσεων
σε όσα μαθήματα επιθυμεί. Στην πρώτη σελίδα των δημοσκοπήσεων ενός
μαθήματος ενημερώνεται ο καθηγητής για τα ενεργά και ανενεργά poll
που αντιστοιχούν στο τρέχον μάθημα . Επίσης θα μπορεί να προβεί σε
λειτουργίες όπως προσθήκη, διαγραφή, ενεργοποίηση/απενεργοποίηση.
Κατά την δημιουργία μιας δημοσόπισης ο καθηγητής θα καθορίζει ερώτηση
και όσες απαντήσεις επιθυμεί. Επίσης θα καθορίζει το χρονικό διάστημα
κατά το οποίο η δημοσκόπηση θα είναι ενεργή (ημερομηνία έναρξης-λήξης).
Μέσα από την σελίδα του μαθήματος ο μαθητής θα μπορεί να επισκεφτεί την
σελίδα των δημοσκοπήσεων, εφόσον υπάρχουν για το τρέχον μάθημα, και να
τις δεί σε μία λίστα. Επιλέγοντας την δημοσκόπηση που τον ενδιαφέρει
από την προηγούμενη λίστα θα μπορεί να επιλέξει μία από τις πιθανές
απαντήσεις. </p>
<p>Αποτελέσματα μπορεί να δεί και ο καθηγητής από την σελίδα
διαχείρισης της δημοσκόπισης.</p>";

// Help questionnaire.php
$langHQuestionnaire="Βοήθεια";
$langQuestionnaireContent="<p>Το εργαλείο των Ερωτηματολογίων επιτρέπει στον
καθηγητή την δημιουργία και διαχείριση Ερευνών Μαθησιακού Προφίλ ή Δημοσκοπήσεων. Για να σας
εμφανίζεται σαν επιλογή πρέπει να είναι πρώτα ενεργοποιημένο για το
τρέχον μάθημα.</p>
<p>Ο καθηγητής θα μπορεί να ενεργοποιήσει την λειτουργία ερωτηματολογίων
σε όσα μαθήματα επιθυμεί. </p>
<p>Αποτελέσματα μπορεί να δεί και ο καθηγητής από την σελίδα
διαχείρισης του ερωτηματολογίου.</p>
<p>Το εργαλείο των δημοσκοπίσεων επιτρέπει στον
καθηγητή την δημιουργία και διαχείριση δημοσκοπήσεων. Για να σας
εμφανίζεται σαν επιλογή πρέπει να είναι πρώτα ενεργοποιημένο για το
τρέχον μάθημα.</p>
<p>καθηγητής θα μπορεί να ενεργοποιήσει την λειτουργία δημοσκοπήσεων
σε όσα μαθήματα επιθυμεί. Στην πρώτη σελίδα των δημοσκοπήσεων ενός
μαθήματος ενημερώνεται ο καθηγητής για τα ενεργά και ανενεργά poll
που αντιστοιχούν στο τρέχον μάθημα . Επίσης θα μπορεί να προβεί σε
λειτουργίες όπως προσθήκη, διαγραφή, ενεργοποίηση/απενεργοποίηση.
Κατά την δημιουργία μιας δημοσόπισης ο καθηγητής θα καθορίζει ερώτηση
και όσες απαντήσεις επιθυμεί. Επίσης θα καθορίζει το χρονικό διάστημα
κατά το οποίο η δημοσκόπηση θα είναι ενεργή (ημερομηνία έναρξης-λήξης).
Μέσα από την σελίδα του μαθήματος ο μαθητής θα μπορεί να επισκεφτεί την
σελίδα των δημοσκοπήσεων, εφόσον υπάρχουν για το τρέχον μάθημα, και να
τις δεί σε μία λίστα. Επιλέγοντας την δημοσκόπηση που τον ενδιαφέρει
από την προηγούμενη λίστα θα μπορεί να επιλέξει μία από τις πιθανές
απαντήσεις. </p>
<p>Αποτελέσματα μπορεί να δεί και ο καθηγητής από την σελίδα
διαχείρισης της δημοσκόπισης.</p>
<p>Το εργαλείο των ερωτηματολογίων μαθησιακού προφίλ (Ε.Μ.Π.) επιτρέπει στον
καθηγητή την δημιουργία και διαχείριση Ε.Μ.Π. Για να σας
εμφανίζεται σαν επιλογή πρέπει να είναι πρώτα ενεργοποιημένο για το
τρέχον μάθημα.</p>
<p>καθηγητής θα μπορεί να ενεργοποιήσει την λειτουργία
σε όσα μαθήματα επιθυμεί. Στην πρώτη σελίδα των Ε.Μ.Π. ενός
μαθήματος ενημερώνεται ο καθηγητής για τα ενεργά και ανενεργά Ε.Μ.Π.
που αντιστοιχούν στο τρέχον μάθημα . Επίσης θα μπορεί να προβεί σε
λειτουργίες όπως προσθήκη, διαγραφή, ενεργοποίηση/απενεργοποίηση.
Κατά την δημιουργία μιας δημοσόπισης ο καθηγητής θα καθορίζει ερώτηση
και όσες απαντήσεις επιθυμεί. Υπάρχουν έτοιμες ερωτήσεις-οδηγεί βασισμένες στα πρότυπα COLLES/ATTL.
Επίσης θα καθορίζει το χρονικό διάστημα
κατά το οποίο η δημοσκόπηση θα είναι ενεργή (ημερομηνία έναρξης-λήξης).
Μέσα από την σελίδα του μαθήματος ο μαθητής θα μπορεί να επισκεφτεί την
σελίδα των Ε.Μ.Π., εφόσον υπάρχουν για το τρέχον μάθημα, και να
τις δεί σε μία λίστα. Επιλέγοντας την Ε.Μ.Π. που τον ενδιαφέρει
από την προηγούμενη λίστα θα μπορεί να επιλέξει μία από τις πιθανές
απαντήσεις. </p>
<p>Αποτελέσματα μπορεί να δεί και ο καθηγητής από την σελίδα
διαχείρισης τoυ Ε.Μ.Π.</p>";

// Help exercice.php

$langHExercise="Βοήθεια";
$langExerciseContent="<p>Το εργαλείο των ασκήσεων σας επιτρέπει να δημιουργήσετε ασκήσεις
που θα περιέχουν όσες ερωτήσεις θέλετε.<br>
<br>Υπάρχουν διάφοροι τύποι απαντήσεων για τις ερωτήσεις σας:<br><br>
<ul>
  <li>Πολλαπλής επιλογής (Μοναδική απάντηση)</li>
  <li>Πολλαπλής επιλογής (πολλαπλές απαντήσεις)</li>
  <li>Ταίριασμα</li>
  <li>Συμπλήρωμα κενών</li>
</ul>
Μια άσκηση περιλαμβάνει ένα μόνο κοινό τύπο ερωτήσεων</p>
<hr>
<b>Δημιουργία Aσκησης</b>
<p>Για να δημιουργήσετε μια άσκηση:
<ol>
  <li>Αρχικά πρέπει το υποσύστημα των ασκήσεων να είναι ενεργοποιημένο για το τρέχον μάθημα</li>
  <li>Κάντε κλίκ στο σύνδεσμο &quot;Καινούρια Aσκηση&quot;.</li>
  <li> Πληκτρολογήσετε το όνομα της άσκησης, καθώς και μία (προαιρετική) περιγραφή της.</li>
  <li> Μπορείτε να διαλέξετε μεταξύ 2 τύπων ασκήσεων :
    <ul>
      <li>Ερωτήσεις σε μία μόνο σελίδα</li>
      <li>Μία ερώτηση ανά σελίδα</li>
    </ul>
  </li>
  <li>Επιλέξτε ημερομηνία και ώρα έναρξης της άσκησης (π.χ. 1977-06-29 12:00:00). Πριν από αυτή οι διδασκόμενοι δεν θα μπορούν να συμμετέχουν στην άσκηση.</li>
  <li>Επιλέξτε ημερομηνία και ώρα λήξης της άσκησης (π.χ. 1977-06-29 12:00:00). Μετά από αυτή οι διδασκόμενοι δεν θα μπορούν να συμμετέχουν στην άσκηση.</li>
  <li>Καθορίστε τον χρονικό περιορισμό που θα έχουν οι συμμετέχοντες, δηλαδή πόσα λεπτά θα έχουν στην διάθεση τους για να ολοκληρώσουν όλες τις ερωτήσεις (0 για καθόλου περιορισμό). </li>
  <li>Εισάγεται πόσες επαναλήψεις επιτρέπονται, δηλαδή πόσες φορές θα μπορεί κάποιος να συμμετέχει στην άσκηση. Παρόμοια με πρίν 0 για απεριόριστο αριθμό επαναλήψεων.</li>
</ol>
<br>
<br>
Κατόπιν αποθηκεύστε την άσκηση. Θα μεταφερθείτε στην διαχείριση ερωτήσεων για την άσκηση.</p>
<hr>
<b>Προσθήκη Ερώτησης</b>
<p>Μπορείτε να προσθέσετε μια ερώτηση στην άσκηση που δημιουργήσατε προηγουμένως.
Η περιγραφή είναι προαιρετική, όπως και η εικόνα.</p>
<hr>
<b>Πολλαπλής Επιλογής</b>
<p>
Για να δημιουργήσετε μια ερώτηση πολλαπλής επιλογής:<br><br>
<ul>
  <li>Δημιουργήστε απαντήσεις για την ερώτηση σας. Μπορείτε να προσθέσετε ή να διαγράψετε μια απάντηση κάνοντας
κλίκ στο κατάλληλο κουμπί</li>
  <li>Τσεκάρετε το αριστερό κουμπί για την σωστή απάντηση</li>
  <li>Προσθέστε (αν θέλετε) ένα σχόλιο. Το σχόλιο δεν θα το δει ο μαθητής παρά μόνο όταν απαντήσει στην ερώτηση</li>
  <li>Δώστε ένα βάρος (βαθμό) σε κάθε απάντηση. Το βάρος (βαθμός) μπορεί να είναι ένας οποιοσδήποτε θετικός
ή αρνητικός αριθμός ή μηδέν.</li>
  <li>Αποθηκεύστε τις απαντήσεις σας</li>
</ul></p>
<hr>
<b>Σημπλήρωμα κενών</b>
<p>Μπορείτε να δημιουργήσετε ένα κείμενο με κενά. Αυτό έχει σαν σκοπό, να βρούν οι μαθητές τις λέξεις που
λείπουν.<br><br>
Για να διαγράψετε μια λέξη από το κείμενο, έτσι ώστε να δημιουργηθεί κενό, βάλτε την λέξη μεταξύ αγκυλών [όπως
αυτή].<br><br>
Από την στιγμή που το κείμενο έχει πληκτρολογηθεί και έχουν οριστεί τα κενά, μπορείτε να προσθέσετε ένα σχόλιο το
οποίο θα το δεί ο μαθητής όταν απαντήσει στην ερώτηση.<br><br>
Αποθηκεύστε το κείμενο σας, και θα προχωρήσετε στο επόμενο βήμα, που θα σας επιτρέψει να δώσετε ένα βάρος σε κάθε
κενό. Για παράδειγμα αν θέλετε να ορίσετε στην ερώτηση,  σαν άριστα το 10 και έχετε 5 κενά, μπορείτε να δώσετε σαν
βαθμολογία το 2 σε κάθε κενό.</p>
<hr>
<b>Ταίριασμα</b>
<p>Μπορείτε να δημιουργήσετε μια ερώτηση όπου ο μαθητής θα πρέπει να συνδυάσει στοιχεία από δύο σύνολα.<br><br>
Μπορείτε επίσης να ζητήσετε από τους μαθητές, να ταξινομήσουν στοιχεία με κάποια σειρά.<br><br>
Πρώτα ορίζετε τις επιλογές, μεταξύ των οποίων οι μαθητές θα μπορούν να διαλέξουν την σωστή απάντηση. Ύστερα ορίζετε
τις ερωτήσεις που θα πρέπει να συνδεθούν με τις επιλογές.
Τέλος, αντιστοιχήστε τες, μέσω του μενού, από το πρώτο σύνολο με αυτό του δεύτερου συνόλου.<br><br>
Σημείωση: Μερικά στοιχεία από το πρώτο σύνολο, μπορούν να δείχνουν στο ίδιο στοιχείο του δεύτερου συνόλου.<br><br>
Δώστε ένα βάρος σε κάθε σωστό ταίριασμα, και σώστε την απάντησή σας.</p>
<hr>
<b>Αλλαγή Aσκησης</b>
<p>Για να αλλάξετε μια άσκηση, εκτελείτε παρόμοιες ενέργειες όπως και στη δημιουργία.
Απλά κάντε κλίκ στην εικόνα <img src=\"../../template/classic/img/edit.gif\" border=\"0\" align=\"absmiddle\"> δίπλα στην άσκηση για να
την αλλάξετε.</p>
<hr>
<b>Διαγραφή Aσκησης</b>
<p>Για να διαγράψετε μια άσκηση, κάντε κλίκ στην εικόνα
<img src=\"../../template/classic/img/delete.gif\" border=\"0\" align=\"absmiddle\"> δίπλα από την άσκηση για να τη διαγράψετε.</p>
<hr>
<b>Ενεργοποίηση Aσκησης</b>
<p>Για να χρησιμοποιηθεί η άσκησή σας από τους μαθητές, πρέπει να την ενεργοποιήσετε κάνοντας κλίκ στην εικόνα
<img src=\"../../template/classic/img/invisible.gif\" border=\"0\" align=\"absmiddle\"> δίπλα από την άσκηση για να την ενεργοποιήσετε.</p>
<hr>
<b>Δοκιμή της Aσκησης</b>
<p>Μπορείτε να δοκιμάσετε την άσκησή σας κάνοντας κλίκ στο όνομά της.</p>
<hr>
<b>Τυχαίες ασκήσεις</b>
<p>Την ώρα της δημιουργίας / αλλαγής μιας άσκησης μπορείτε να ορίσετε αν θέλετε οι ερωτήσεις να εμφανίζονται σε τυχαία
σειρά.<br><br>
Αυτό σημαίνει ότι, ενεργοποιώντας την επιλογή αυτή, οι ερωτήσεις θα εμφανίζονται σε διαφορετική σειρά κάθε φορά
που θα εκτελείται η άσκηση από τους μαθητές.<br><br>
Αν έχετε ένα μεγάλο αριθμό ερωτήσεων, μπορείτε να επιλέξετε να εμφανίζονται τυχαία, ένας ορισμένος αριθμός
ερωτήσεων.</p>
<hr>
<b>Διαθέσιμες Ερωτήσεις</b>
<p>Οταν διαγράφετε μια άσκηση, οι ερωτήσεις τις δεν διαγράφονται από την βάση δεδομένων και μπορούν να
επαναχρησιμοποιηθούν σε μια καινούρια άσκηση.<br><br>
Με αυτό τον τρόπο μπορεί να χρησιμοποιήσετε τις ίδιες ερωτήσεις σε αρκετές ασκήσεις.<br><br>
Εξ' ορισμού, παρουσιάζονται όλες οι ερωτήσεις του μαθήματος σας. Μπορείτε να δείτε τις ερωτήσεις σχετικές με μια άσκηση,
επιλέγοντας την άσκηση από το μενού &quot;Φιλτράρισμα&quot;.<br><br>
Οι &quot;ερωτήσεις χωρίς απάντηση&quot; είναι αυτές που δεν ανήκουν σε καμμία άσκηση.</p>
<b>Αποτελέσματα</b>
<p>Μπορείτε να δείτε τα αποτελέσματα επιλέγοντας την μορφή που επιθυμείτε.</p>";


// help work

$langHWork = "Βοήθεια";
$langWorkContent = "
<p>Το εργαλείο των εργασιών είναι ένα ολοκληρωμένο σύστημα δημιουργίας / παράδοσης / βαθμολογίας εργασιών.</p>
<p>Σαν καθηγητής μπορείτε να δημιουργήσετε μια εργασία κάνοντας κλίκ στη <b>\"Δημιουργία Εργασίας\"</b>.
Συμπληρώστε τον τίλο της εργασίας, καθορίστε την ημερομηνία υποβολής και προεραιτικά προσθέστε και ένα
σχόλιο.</p>
<p>Όταν ολοκληρωθεί η δημιουργία της εργασίας, μην παραλείψετε να την ενεργοποιήσετε κάνοντας κλίκ
στο εικονίδιο <img src=\"../../template/classic/img/invisible.gif\" border=\"0\" align=\"absmiddle\">. Η εργασία θα είναι ορατή και
προσβάσιμη από τους φοιτητές μόνο όταν την ενεργοποιήσετε. Μπορείτε ανά πάσα στιγμή να διορθώσετε την
εργασία κάνοντας κλικ στο εικονίδιο <img src=\"../../template/classic/img/edit.gif\" border=\"0\" align=\"middle\"> ή να την
διαγράψετε κάνοντας κλικ στο εικονίδιο <img src=\"../../images/delete.gif\" border=\"0\" align=\"middle\">.
Κάνοντας κλικ στον τίτλο της εργασίας βλέπετε τις τυχόν εργασίες που έχουν υποβληθεί από τους φοιτητές.
Στα στοιχεία του φοιτητή βλέπετε τον αριθμό μητρώου, την ημερομηνία υποβολής και το αντίστοιχο αρχείο.
Κάνοντας κλικ στο \"Κατέβασμα όλων των εργασιών σε μορφή .zip \" θα \"κατεβάσετε\" όλα τα αρχεία που έχουν
υποβάλλει οι φοιτητές (σε συμπιεσμένη μορφή .zip) και που αντιστοιχούν στην εργασία που έχετε ορίσει.
Για να βαθμολογήσετε την εργασία συμπληρώστε τον αντίστοιχο βαθμό δίπλα στο όνομα του φοιτητή και κάντε
κλικ στο κουμπί <b>\"Υποβολή Βαθμολογίας\"</b>. Ο φοιτητής θα δει τον βαθμό του μόλις κάνει κλικ στο τίτλο της
εργασίας.</p>
<p>Ο φοιτητής μπορεί να δεί όλες τις εργασίες που έχουν υποβληθεί από τον καθηγητή.
Ο κατάλογος των εργασιών περιλαβάνει (εκτός από τον τίτλο της εργασίας), την προθεσμία υποβολής, τυχόν
βαθμολογία από τον καθηγητή και μια ένδειξη για το αν έχει στείλει εργασία ή όχι.
Μπορεί να υποβάλλει τη εργασία κάνοντας κλικ στον αντίστοιχο τίτλο της.
Να σημειωθεί, ότι ο φοιτητής δεν μπορεί να υποβάλλει εργασία μετά τη λήξη της προθεσμίας υποβολής.
Επίσης αν έχει \"ανεβάσει\" μια εργασία και θέλει να \"ανεβάσει\" ακόμα μία, η παλιά του εργασία θα σβηστεί και θα
αντικατασταθεί από την καινούρια.
</p>
";


// Help Group
$langHGroup="Βοήθεια ομάδων";
$langGroupContent="<p><b>Εισαγωγή</b></p>
<p>Το εργαλείο αυτό επιτρέπει τη δημιουργία και τη διαχείριση ομάδων
εργασίας. Κατά τη δημιουργία («Δημιουργία καινούριας ομάδας χρηστών»),
οι ομάδες είναι κενές. Υπάρχουν διάφοροι τρόποι για να συμπληρωθούν:
<ul><li>αυτόματα («Συμπλήρωση των ομάδων χρηστών»),</li>
<li>απο τον υπεύθυνο του μαθήματος («Διόρθωση της ομάδας χρηστών»),</li>
<li>με αυτοεγγραφή των φοιτητών («Αλλαγή ρυθμίσεων»: Οι φοιτητές επιτρέπονται να εγγραφούν...).</li>
</ul>
<p>Αυτοί οι τρείς τρόποι μπορούν να συνδυαστούν. Μπορείτε για παράδειγμα να ζητήσετε από τους
φοιτητές να εγγραφούν μόνοι τους. Αργότερα, διαπιστώνετε ότι κάποιοι δεν εγγράφηκαν
και επιλέγετε την αυτόματη συμπλήρωση ομάδων. Μπορείτε επίσης να αλλάξετε τα μέλη των
ομάδων πριν ή μετά την αυτόματη συμπλήρωση ή την εγγραφή από τους ίδιους.</p>
<p>Η εγγραφή σε ομάδες, αυτόματα ή όχι, λειτουργεί μόνο εάν υπάρχουν ήδη
φοιτητές εγγεγραμμένοι στο μάθημα (η εγγραφή σε ομάδες δε σχετίζεται με την
εγγραφή στο ίδιο το μάθημα). Οι εγγεγραμμένοι φοιτητές στο μάθημα εμφανίζονται στο
εργαλείο «Χρήστες».</p>
<hr noshade size=1>
<p><b>Δημιουργία ομάδων</b></p>
<p>Για να δημιουργήσετε νέες ομάδες, επιλέξτε το «Δημιουργία καινούριας ομάδας χρηστών»
και ορίστε πόσες ομάδες θα δημιουργηθούν. Ο μέγιστος αριθμός μελών είναι προαιρετικός
αλλά προτείνουμε να επιλέξετε κάποιον. Αν δεν τον αλλάξετε, στις ομάδες
θα μπορούν να εγγραφούν απεριόριστα μέλη.</p>
<hr noshade size=1>
<p><b>Ρυθμίσεις ομάδων</b></p>
<p>Μπορείτε να ορίσετε τις ρυθμίσεις που ισχύουν για όλες τις ομάδες.
<p><b>Ρυθμίσεις ομάδων χρηστών</b>:
<p>Μπορείτε να δημιουργήσετε κενές ομάδες και να επιτρέψετε την εγγραφή φοιτητών
σε αυτές. Αν έχετε ορίσει μέγιστο αριθμό μελών, οι πλήρεις ομάδες δε δέχονται
νέα μέλη. Αυτή η μέθοδος εξυπηρετεί όταν δε γνωρίζετε τον ακριβή κατάλογο των
φοιτητών όταν δημιουργείτε ομάδες.</p>
<p><b>Εργαλεία</b>:</p>
<p>Κάθε ομάδα έχει είτε μια περιοχή συζητήσεων (δημόσια ή ιδιωτική) είτε
μια περιοχή εγγράφων (ένα σύστημα διαχείρισης αρχείων που μοιράζονται τα μέλη)
είτε (συχνότερα) και τα δύο.</p>
<hr noshade size=1>
<p><b>Διόρθωση ομάδων</b></p>
<p>Αφού δημιουργθούν οι ομάδες, στο κάτω μέρος της σελίδας εμφανίζεται ο κατάλογος
των ομάδων με μια σειρά από πληροφορίες και λειτουργίες. Επιλέξτε:
<ul><li><b>Διόρθωση</b> για να αλλάξετε το όνομα της ομάδας, την περιγραφή,
τον διδάσκοντα και τον κατάλογο των μελών.</li>
<li><b>Διαγραφή</b> για να διαγράψετε μια ομάδα.</li></ul>
<hr noshade size=1>";

// Help Agenda
$langHAgenda = "Ατζέντα";
$langAgendaContent = "<p>Αν επιθυμείτε να προσθέσετε ένα γεγονός στην ατζέντα,
μπορείτε να επιλέξετε την ημερομηνία του γεγονότος, να δώσετε ένα τίτλο, να αναφέρετε τις λεπτομέρειες και στη
συνέχεια να πατήσετε το πλήκτρο 'εντάξει'. Με αυτό τον τρόπο, το γεγονός προστίθετε στην ατζέντα.</p><p>
Στη συνέχεια, σας δίνεται η δυνατότητα αν επιθυμείτε, να αλλάξετε κάποια από τις παραμέτρους του γεγονότος,
επιλέγοντας 'τροποποίηση' ή να διαγράψετε κάποιο γεγονός από την ατζέντα επιλέγοντας 'διαγραφή'.</p>";

// Help link

$langHLink = "Σύνδεσμοι";
$langLinkContent = "<p>Σας δίνεται η δυνατότητα να προσθέσετε συνδέσμους προς κάποιες υπάρχουσες ιστοσελίδες στο
δίκτυο (ή κάπου αλλού στον δικό σας δικτυακό τόπο).</p><p>Για να προσθέσετε ένα σύνδεσμο επιλέξτε 'Προσθήκη
συνδέσμου'. Πληκτρολογήστε το URL, τον τίτλο και κάποια περιγραφή του συνδέσμου. Επιλέξτε την κατηγορία στην οποία θέλετε να προστεθεί ο
σύνδεσμος και στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'.</p> <p>Για να προσθέσετε μια νέα κατηγορία συνδέσμων,
με σκοπό να ομαδοποιήσετε κάποιους συνδέσμους, επιλέξτε 'Προσθήκη κατηγορίας'.  Πληκτρολογήστε το όνομα και την
περιγραφή της κατηγορίας. Στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'. Επίσης μπορείτε να αλλάξετε το όνομα ή την
περιγραφή του συνδέσμου επιλέγοντας 'αλλαγή' ή να διαγράψετε κάποιο σύνδεσμο επιλέγοντας 'διαγραφή'.
Επιλέγοντας 'διαγραφή' κατηγορίας διαγράφετε την κατηγορία και όλους τους συνδέσμους που περιέχει.</p>
<p> Τέλος υπάρχει η επιλογή 'Εμφάνιση' αν θέλετε να εμφανιστούν οι σύνδεσμοι που περιέχει μια κατηγορία
και η επιλογή 'Απόκρυψη' αν θέλετε να μην εμφανίζονται.</p>";

// Help announcements

$langHAnnounce = "Ανακοινώσεις";
$langAnnounceContent = "<p>Σας δίνεται η δυνατότητα να  προσθέσετε ανακοινώσεις στην σελίδα του μαθήματος
πληκτρολογώντας  την περιγραφή της  και στη συνέχεια πατώντας το πλήκτρο 'εντάξει'.</p><p>Επίσης μπορείτε να
αλλάξετε το περιεχόμενο της ανακοίνωσης επιλέγοντας 'Aλλαγή' ή να διαγράψετε μια ανακοίνωση  επιλέγοντας
'Διαγραφή'. Αν επιθυμείτε η ανακοίνωση να σταλεί και με mail στους φοιτητές που είναι εγγεγραμμένοι στο
μάθημα, τότε επιλέγετε 'Αποστολή (με email) της ανακοίνωσης στους εγγεγραμμένους μαθητές'.</p>";

// Help profile

$langHProfile = "Αλλαγή προσωπικών στοιχείων";
$langProfileContent = "<p>Σας δίνετε η δυνατότητα να αλλάξετε κάποια από τα προσωπικά σας στοιχεία που
χρησιμοποιείτε στην πλατφόρμα.</p>
<li>Σε περίπτωση που έχει γίνει κάποιο λάθος στην καταχώρηση σας μπορείτε να αλλάξετε το όνομα, το επώνυμο και
την ηλεκτρονική σας διεύθυνση.</li>
<li>Επίσης αν επιθυμείτε μπορείτε να αλλάξετε το όνομα χρήστη και το συνθηματικό σας.</li>
<li>Τέλος για να καταχωρηθούν στη βάση δεδομένων οι αλλαγές που κάνατε πατήστε το πλήκτρο 'Αλλαγή'.</li>";


// Help Video

$langHVideo = "Βίντεο";
$langVideoContent = "<b><u>Περιγραφή</u></b>
<p>
Μέρος του υλικού των μαθημάτων που προσφέρονται από την εφαρμογή eClass μπορεί να είναι οπτικοακουστικό υλικό. Οι τρόποι με τους οποίους μπορεί να διανεμηθεί το υλικό αυτό είναι δύο. Ο πρώτος είναι το απλό κατέβασμα των αρχείων τοπικά στο απομακρυσμένο υπολογιστή και η τοπική αναπαραγωγή του μετά την ολοκλήρωση του κατεβάσματος. Ο δεύτερος είναι η διάθεση του οπτικοακουστικού υλικού από έναν εξυπηρετητή ροών με πλεονέκτημα την άμεση αναπαραγωγή του υλικού χωρίς καθυστέρηση στον απομακρυσμένο υπολογιστή. Το υποσύστημα video δίνει την δυνατότητα σύνδεσης της εφαρμογής eClass με εξυπηρετητή ροών.</p>
<b><u>Λειτουργίες Εκπαιδευτή</u></b>
<p>
Μπορείτε να ανεβάσετε αρχεία video (τύπου mpeg, avi κ.λπ.) στην πλατφόρμα. Επιλέξτε \"Προσθήκη βίντεο\" και στη συνέχεια πληκτρολογήστε το όνομα του αρχείου ή κάντε κλικ στον πλήκτρο \"Browse\" για να το αναζητήσετε. Επίσης, πληκτρολογήστε στα αντίστοιχα πεδία το τίτλο του βίντεο και, αν επιθυμείτε, μια σύντομη περιγραφή. Μετά κάντε κλικ στο πλήκτρο \"Προσθήκη\" για να γίνει το \"ανέβασμα\" στη πλατφόρμα. Έχετε τη δυνατότητα να προσθέσετε συνδέσμους βιντεοσκοπημένων μαθημάτων στην σελίδα του μαθήματός σας. Επιλέξτε \"Προσθήκη συνδέσμου βίντεο\" πληκτρολογήστε την διεύθυνση του vod server, στον οποίο βρίσκεται το αρχείο βιντεοσκοπημένου μαθήματος που επιθυμείτε να προσθέσετε, στο πεδίο \"URL\". Στη συνέχεια πληκτρολογήστε τον τίτλο και την περιγραφή και τέλος πατήστε το πλήκτρο \"Προσθήκη\". Μπορείτε να αλλάξετε κάποια από τις παραμέτρους επιλέγοντας \"Αλλαγή\" ή να διαγράψετε κάποιο σύνδεσμο ή αρχείο επιλέγοντας \"Διαγραφή\". Επίσης επιλέγοντας \"Διαγραφή όλων\" διαγράφετε όλους τους συνδέσμους προς βιντεοσκοπημένα μαθήματα και όλα τα αρχεία που υπάρχουν στην σελίδα του μαθήματος. Αν το σύστημα είναι συνδεμένο με εξυπηρετητή ροών η σύνδεση είναι διάφανη στον εκπαιδευτή και δεν υπάρχει ανάγκη να κάνει κάποια επιπλέον κίνηση ή ενέργεια για να διατεθούν τα αρχεία οπτικοακουστικού υλικού από τον εξυπηρετητή ροών. Πρέπει να έχετε υπ' όψιν σας ότι το υλικό θα είναι διαθέσιμο από τον εξυπηρετητή ροών και εκτός της εφαρμογής eClass εάν κάποιος γνωρίζει τον απευθείας σύνδεσμο του αρχείου στον εξυπηρετητή ροών.
</p>
<b><u>Λειτουργίες Εκπαιδευόμενου</u></b>
<p>Επιλέξτε το βίντεο που θέλετε να δείτε. Αν το σύστημα είναι συνδεμένο με εξυπηρετητή ροών ο εκπαιδευόμενος πρέπει να γνωρίζει με
ποιο πρόγραμμα πελάτη μπορεί να αναπαράγει τα αρχεία οπτικοακουστικού υλικού</p>
";



// Help Conference

$langHConference = "Τηλεσυνεργασία";
$langConferenceContent = "
<b><u>Περιγραφή</u></b>
<p>Δίνει την δυνατότητα επικοινωνίας σε πραγματικό χρόνο μεταξύ των εκπαιδευτών και των εκπαιδευόμενων.<br></p>
<p>Το συγκεκριμένο εργαλείο έχει 4 λειτουργικότητες:</p>
<ul>
	<li>Τηλεδιάσκεψη(Πρέπει να έχει ενεργοποιηθεί από τον διαχειριστή της πλατφόρμας eclass)</li>
	<li>Βίντεο</li>
	<li>Παρουσίαση</li>
	<li>Ανταλλαγή μηνυμάτων</li>
</ul>
<b><u>Τηλεδιάσκεψη</u></b>
<p><b><u>Λειτουργίες Εκπαιδευτή</u></b></p>
<p>Για τη λειτουργία τηλεδιάσκεψης, ο εκπαιδευτής δεν έχει παρά να επιλέξει αυτή τη ρύθμιση κατά την είσοδό του στο υποσύστημα και αυτόματα ενεργοποιείται η δυνατότητα σε όλους τους εκπαιδευόμενους που έχουν εισέλθει στο υποσύστημα. Το κάθε μάθημα της πλατφόρμας διαθέτει το δικό του \"εικονικό δωμάτιο τηλεδιάσκεψης\", στο οποίο βρίσκονται συνδεδεμένοι όλοι οι συμμετέχοντες. Ο εκπαιδευτής δεν έχει τρόπο να ελέγχει το ποιός έχει το λόγο και πρέπει να εξηγήσει στους συμμετέχοντες τους κανόνες της τηλεδιάσκεψης που επιθυμεί να τηρήσει. Καλό θα ήταν ο εκπαιδευτής να προτρέπει τους εκπαιδευόμενους για διατήρηση κλειστού μικροφώνου (muting) σε όλους τους συνδεδεμένους σταθμούς μέχρι την ανάγκη επαφής με τον εκπαιδευτή, ώστε τυχόν θόρυβος από τους εκπαιδευόμενους να μην μεταδίδεται άκαιρα στους συμμετέχοντες. Επίσης, συνιστάται η διενέργεια δοκιμαστικής τηλεδιάσκεψης πριν την αναγκαία ημέρα και ώρα, ώστε να υπάρχει προηγούμενη εξοικείωση των συμμετεχόντων με το περιβάλλον.
Οι απαιτήσεις σε εξοπλισμό για τη λειτουργικότητα αυτή είναι η ύπαρξη ηχείων και μικροφώνου (προαιρετική η ύπαρξη κάμερας), ενώ οι α
παιτήσεις σε λογισμικό είναι η χρήση αποκλειστικά του Microsoft Internet Explorer και ταυτόχρονα η ύπαρξη του NetMeeting στην τελευτ
αία του έκδοση 3.0.1 στον προσωπικό υπολογιστή, πράγμα που συμβαίνει αυτόματα σε υπολογιστές με λειτουργικό σύστημα WinXP, ενώ υπάρχ
ει η δυνατότητα εγκατάστασης σε Win2000,Win98,WinNT κ.λ.π. Εφόσον το NetMeeting δεν έχει χρησιμοποιηθεί σε αυτόν τον υπολογιστή, οι
προεπιλεγμένες ρυθμίσεις δεν θα λειτουργήσουν σωστά. Αν όμως έχει μεσολαβήσει η ρύθμιση των επιλογών \"Advanced Calling\" σε προηγούμενη φάση, θα χρειαστεί η ενεργοποίηση της χρήσης του Gatekeeper που θα δωθεί από τον διαχειριστή της πλατφόρμας eclass. Καλή πρακτική για την αποφυγή προβλημάτων κατά την διεξαγωγή των τηλεδιασκέψεων είναι η χρήση του \"Audio Tuning Wizard\" σε φάση προετοιμασίας για την τηλεδιάσκεψη. Η επιλογή αυτή είναι διαθέσιμη στο μενού \"Tools\" του NM και επιτρέπει στον χρήστη να επιβεβαιώσει με απλό τρόπο την καλή λειτουργία των ηχείων (για να λαμβάνει τον ήχο των υπολοίπων) και του μικροφώνου του (για να μπορεί να παίρνει και ο ίδιος τον λόγο).
</p>
<p><b><u>Λειτουργίες Εκπαιδευόμενου</u></b></p>
<p>Ο εκπαιδευόμενος θα αποκτήσει τη δυνατότητα μέσα από τις ιστοσελίδες του υποσυστήματος εφόσον το έχει ενεργοποιήσει ο εκπαιδευτής με την επιλογή του κατά την είσοδό του στο υποσύστημα «Κουβέντα». Η κλήση σύνδεσης στην τηλεδιάσκεψη γίνεται αυτόματα με την είσοδο του εκπαιδευόμενου στο υποσύστημα «Κουβέντα», εφόσον έχει ρυθμιστεί σωστά την πρώτη φορά το NetMeeting για χρήση του gatekeeper, όπως περιγράφεται παραπάνω. Το κάθε μάθημα της πλατφόρμας διαθέτει το δικό του \"εικονικό δωμάτιο τηλεδιάσκεψης\", στο οποίο βρίσκονται συνδεδεμένοι όλοι οι συμμετέχοντες. Καλή πρακτική είναι η διατήρηση κλειστού μικροφώνου (muting) μέχρι την ανάγκη επαφής με τον εκπαιδευτή, ώστε θόρυβοι ή ομιλίες να μην μεταδίδονται άκαιρα στους υπόλοιπους συμμετέχοντες.</p>

<b><u>Βίντεο</u></b>
<p><b><u>Λειτουργίες Εκπαιδευτή</u></b></p>
<p>
Ο καθηγητής επιλέγει «video» εμφανίζεται ένα πεδίο που του λέει να τοποθετήσει το σύνδεσμο του βίντεο. Όταν τοποθετήσει το link και πατήσει «Play»φορτώνει από πάνω το video που επέλεξε στον ανάλογο πρόγραμμα παρουσίασης αναπαραγωγής οπτικοακουστικού υλικού  σύμφωνα με την κατάληξη που έχει. Ο εκπαιδευτής πρέπει να έχει ενημερώσει τους εκπαιδευόμενους για τον τύπο του προγράμματος αναπαραγωγής οπτικοακουστικού υλικού που πρέπει να διαθέτουν. </p>
<p><b><u>Λειτουργίες Εκπαιδευόμενου</u></b></p>
<p>Ο εκπαιδευόμενος από την πλευρά του δεν χρειάζεται να κάνει τίποτα. Αυτόματα θα φορτώσει το ανάλογο πρόγραμμα αναπαραγωγής οπτικοακουστικού υλικού αναλόγως το βιντεο που επέλεξε ο εκπαιδευτής</p>

<b><u>Παρουσίαση</u></b>
<p><b><u>Λειτουργίες Εκπαιδευτή</u></b></p>
<p>Ο καθηγητής τοποθετεί την ιστοσελίδα που θέλει να εμφανίσει στους εκπαιδευόμενους στο πεδίο «Σύνδεσμος παρουσίασης» και στη συνέχει πατάει το πλήκτρο «ΟΚ». Αμέσως θα εμφανιστεί στον παράθυρο παρουσίασης η ιστοσελίδα που επέλεξε όπως επίσης και στα παράθυρα των εκπαιδευόμενων. Από αυτή τη στιγμή και μετά δεν υπάρχει συγχρονισμός μεταξύ εκπαιδευτή-εκπαιδευόμενου στο παράθυρο παρουσίαση. Π.χ. Στην συνέχει αν αποφασίσει να πατήσει ένα σύνδεσμο μέσα στο παράθυρο της παρουσίασης πρέπει να ενημερώσει του εκπαιδευόμενους για την κίνησή του.</p>
<p><b><u>Λειτουργίες Εκπαιδευόμενου</u></b></p>
<p>Στον εκπαιδευόμενο παρουσιάζεται ο σύνδεσμος που επέλεξε ο καθηγητής  και στη συνέχεια πρέπει να ακολουθεί τις οδηγίες που τους λέει ο καθηγητής ώστε να ακολουθεί τους συνδέσμους που πατάει.</p>
<b><u>Ανταλλαγή μηνυμάτων</u></b>
<p><b><u>Λειτουργίες Εκπαιδευτή</u></b></p>
<p>Ο εκπαιδευτή έχει την δυνατότητα να ανταλλάσει μηνύματα με όσους χρήστες είναι εγγεγραμμένοι στο μάθημα πληκτρολογώντας το μήνυμα σας και συνέχεια κάνοντας κλικ στο πλήκτρο '>>'. Τέλος μπορείτε να διαγράψετε όλα τα μηνύματα που υπάρχουν στην ζωντανή συζήτηση επιλέγοντας 'Καθάρισμα'.</p>
<p><b><u>Λειτουργίες Εκπαιδευόμενου</u></b></p>
<p>Ο εκπαιδευόμενος έχει την δυνατότητα να ανταλλάσει μηνύματα με όσους χρήστες είναι εγγεγραμμένοι στο μάθημα πληκτρολογώντας το μήνυμα σας και συνέχεια κάνοντας κλικ στο πλήκτρο '>>'.</p>
";


// Help course description

$langHCoursedescription = "Πληροφορίες Μαθήματος";
$langCoursedescriptionContent = "<p>Έχετε τη δυνατότητα να προσθέσετε πληροφορίες για το μάθημα επιλέγοντας
'Δημιουργία και Διόρθωση'. Μπορείτε να προσθέσετε μια κατηγορία, επιλέγοντας την από τον κατάλογο με τις
υπάρχουσες κατηγορίες και κάνοντας κλικ στο πλήκτρο 'Προσθήκη'.</p><p>Στη συνέχεια μπορείτε να πληκτρολογήσετε  τις
πληροφορίες που επιθυμείτε σχετικά με την κατηγορία που επιλέξατε και για να ολοκληρωθεί η προσθήκη των
πληροφοριών πατήστε το πλήκτρο 'Προσθήκη'.</p><p>Αν τελικά δεν επιθυμείτε να προσθέσετε την κατηγορία που επιλέξατε
πατήστε 'Επιστροφή και Ακύρωση'. Οποιαδήποτε χρονική  στιγμή  σας δίνετε η δυνατότητα να αλλάξετε τις πληροφορίες
μιας κατηγορίας επιλέγοντας 'Αλλαγή' ή να διαγράψετε τις πληροφορίες μιας κατηγορίας επιλέγοντας
'Διαγραφή'.</p>";

// Help external  module

$langHModule = "Προσθήκη συνδέσμου στην αρχική σελίδα";
$langModuleContent = "<p>Αν θέλετε να προσθέσετε συνδέσμους από την αρχική σελίδα του μαθήματος προς ιστοσελίδες
που υπάρχουν ήδη κάπου αλλού στο δίκτυο (ή ακόμα κάπου αλλού στον δικό σας δικτυακό τόπο) πληκτρολογήστε το
σύνδεσμο
και τον τίτλο του συνδέσμου και στη συνέχεια πατήστε το πλήκτρο 'Προσθήκη'. Οι σελίδες που προσθέτετε εσείς στην
αρχική σελίδα μπορούν να απενεργοποιηθούν και να διαγραφούν, ενώ τα ενσωματωμένα εργαλεία μπορούν να
απενεργοποιηθούν μόνο, αλλά όχι να διαγραφούν.</p>";

//Help import page
$langHImport = "Ανέβασμα ιστοσελίδας / αρχείου";
$langImportContent = "<p>Αν θέλετε μπορείτε να ανεβάσετε αρχείο σχετικό με το μάθημα σας. Το αρχείο αυτό θα αποθκευτεί στον εξυπηρετητή του eClass. Θα δημιουργηθεί σύνδεσμος προς αυτό στο αριστερό μενού του μαθήματος
που θα ανοίγει σε νέο παράθυρο του φυλλομετρητή του χρήστη.</p>
<p>Για να το κάνετε αυτό πατήστε το πλήκτρο 'Browse', επιλέξτε το αρχείο που θέλετε να ανεβάσετε, δώστε ένα τίτλο στο πεδίο 'Τίτλος σελίδας' και πιέστε το πλήκτρο 'Προσθήκη'.</p>
<p>Ο σύνδεσμος του αρχείου που ανεβάζετε μπορεί να απενεργοποιηθεί και να διαγραφεί από το εργαλείο
'Διαχείριση εργαλείων'.</p>";

//Help Course tools
$langHcourseTools = "Διαχείριση εργαλείων";
$langcourseToolsContent = "<p>Αυτό το εργαλείο προσφέρει τη δυνατότητα στον καθηγητή να ενεργοποιήσει και να απενεργοποιήσει τα εργαλεία του μαθήματος. Στις δύο στήλες παρουσιάζεται η κατάσταση του κάθε εργαλείου , δηλαδή αν είναι ενεργό ή όχι.</p>

<p>Για να αλλάξετε την κατάσταση κάποιου εργαλείου κάντε κλικ στο αντίστοιχο εργαλείο και στη συνέχεια πιέστε το πλήκτρο '>>' για να αλλαχθεί η κατάσταση του εργαλείου. Μπορείτε να μετακινείσετε πολλά εργαλεία από την μια στήλη στην άλλη με CTRL+κλίκ. Τέλος πιέστε το πλήκτρο 'Υποβολή αλλαγών' στο τέλος του table, για να αποθηκευτούν οι αλλαγές σας.</p>
";


// Help Scorm / Learning Path


$langHPath="Βοήθεια - Γραμμή Μάθησης";

$langPathContent="
Το εργαλείο Γραμμή Μάθησης έχει τέσσερις λειτουργίες:
<ul>
<li>Δημιουργία γραμμής μάθησης</li>
<li>Εισαγωγή γραμμής μάθησης από πρότυπο SCORM ή IMS</li>
<li>Εξαγωγή γραμμής μάθησης σε πρότυπο συμβατό με Scorm 2004 ή 1.2</li>
<li>Παρακολούθηση των εκπαιδευόμενων στις γραμμές μάθησης</li>
</ul>

<p><b>Τί είναι η γραμμή μάθησης ;</b></p>

<p>Η γραμμή μάθησης είναι μια ακολουθία από βήματα μάθησης που περιλαμβάνονται σε ενότητες.
Μπορεί να είναι είτε βασισμένη σε περιεχόμενo (μοιάζοντας με πίνακα περιεχομένων)
είτε βασισμένη σε ενέργειες, μοιάζοντας με ατζέντα ή πρόγραμμα του τί χρειάζεται να κάνει
ο εκπαιδευόμενος για να κατανοήσει ή να εκπαιδευτεί σε μια συκγκεκριμένη πηγή γνώσης.
</p>

<p>Επιπροσθέτως του να είναι δομημένη, μια γραμμή μάθησης μπορεί επίσης να έχει μια
συγκεκριμένη αλληλοδιαδοχή. Αυτό σημαίνει πως κάποια βήματα είναι προαπαιτούμενα για τα
αμέσως επόμενα αυτών βήματα (\"δεν μπορείτε να πάτε στο βήμα 2 πρίν το βήμα 1\").
Η αλληλοδιαδοχή μπορεί να είναι μόνο υποδηλωτική (τα βήματα εμφανίζονται το ένα μετά
το άλλο).</p>

<p><b>Πώς δημιουργείτε τη δικιά σας γραμμή μάθησης ;</b></p>

<p>Το πρώτο βήμα είναι να προσπελάσετε τον τομέα Λίστα Γραμμών Μάθησης. Στην κεντρική
οθόνη της λίστας γραμμών μάθησης, υπάρχει ένας ειδικός σύνδεσμος. Εκεί μπορείτε να
δημιουργήσετε όσες γραμμές μάθησης επιθυμείτε κάνοντας κλικ στο
<i>Δημιουργία νέας γραμμής μάθησης</i>. Δημιουργούνται με αυτόν τον τρόπο κενές
γραμμές μάθησης, μέχρι να τους προσθέσετε ενότητες και βήματα.</p>

<p><b>Ποιά είναι τα βήματα για τις γραμμές αυτές ; (Ποιά είναι τα αντικείμενα που μπορούν να προστεθούν ;)</b></p>

<p>Κάποια από τα εργαλεία, τις ενέργειες και το περιεχόμενο του Eclass που θεωρείτε
χρήσιμα και κατάλληλα για τη γραμμή σας μπορούν να προστεθούν:</p>

<ul>
<li>Ξεχωριστά έγγραφα (κείμενα, εικόνες, Έγγραφα τύπου Office, ...)</li>
<li>Ετικέτες</li>
<li>Σύνδεσμοι</li>
<li>Ασκήσεις του Eclass</li>
<li>Περιγραφή μαθήματος</li>
</ul>

<p><b>Άλλα χαρακτηριστικά της Γραμμής Μάθησης</b></p>

<p>Μπορεί να ζητηθεί από τους εκπαιδευόμενους να ακολουθήσουν (αναγνώσουν)
τη γραμμή σας με μια συγκεκριμένη σειρά. Αυτό σημαίνει για παράδειγμα ότι οι
εκπαιδευόμενοι δεν μπορούν να προσπελάσουν την Άσκηση 2 αν δεν έχουν διαβάσει
το Έγγραφο 1. Όλα τα αντικείμενα έχουν κατάσταση: ολοκληρωμένη ή μη ολοκληρωμένη,
επομένως η πρόοδος των εκπαιδευόμενων είναι πάντα διαθέσιμη μέσω του ειδικού
εργαλείου <i>Παρακολούθηση γραμμών μάθησης</i>.</p>

<p>Αν θέλετε να τροποποιήσετε τον αρχικό τίτλο ενός βήματος, ο νέος τίτλος
μπορεί να φαίνεται στη γραμμή, χωρίς να επηρεαστεί ο αρχικός. Επομενώς, αν θέλετε
να εμφανίσετε το test8.doc ως 'Τελική Εξέταση' στη γραμμή, δε χρειάζεται να
μετονομάσετε το αρχείο, αλλά αρκεί να χρησιμοποιήσετε έναν άλλο τίτλο στη γραμμή.
Είναι επίσης προτεινόμενο να δίνετε νέους τίτλους στους συνδέσμους αν οι
τελευταίοι έχουν μεγάλο μήκος ονόματος.</p>
<br>


<p><b>Τί είναι η γραμμή μάθησης κατά το πρότυπο Scorm ή IMS και πώς μπορείτε να το εισάγετε ;</b></p>

<p>Το εργαλείο γραμμή μάθησης σας επιτρέπει να ανεβάσετε και να εισάγετε
εκπαιδευτικό περιεχόμενο συμβατό με τα πρότυπα SCORM και IMS.</p>

<p>Το SCORM (<i>Sharable Content Object Reference Model</i>) είναι ένα διεθνές
πρότυπο, με το οποίο έχουν ταχθεί πολλοί κυρίαρχοι οργανισμοί που ασχολούνται
με την ασύγχρονη τηλεκπαίδευση (e-Learning), όπως οι: NETg, Macromedia,
Microsoft, Skillsoft, κλπ και το οποίο δρα σε τρείς τομείς:</p>

<ul>
<li><b>Οικονομία</b>: Το πρότυπο Scorm επιτρέπει σε ολόκληρα μαθήματα ή
μικρότερες ενότητες περιεχομένου να επαναχρησιμοποιηθούν σε διαφορετικές
πλατφόρμες τηλεκπαίδευσης (Learning Management Systems - LMS) μέσω του
διαχωρισμού του περιεχομένου και της δομής του,</li>
<li><b>Παιδαγωγική</b>: Το πρότυπο Scorm ενσωματώνει τις έννοιες των
προαπαιτούμενων ή της <i>αλληλοδιαδοχής</i> (<i>π.χ. </i>\"Δεν
μπορείτε να προσπελάσετε το κεφάλαιο 2 αν δεν ολοκληρώσετε επιτυχώς την Άσκηση 1\"),</li>
<li><b>Τεχνολογία</b>: Το πρότυπο Scorm συνθέτει έναν πίνακα περιεχομένων
ως ένα επιπλέον επίπεδο αφαιρετικότητας, ασχέτως περιεχομένου και πλατφόρμας
τηλεκπαίδευσης. Βοηθάει τις έννοιες του περιεχομένου και της πλατφόρμας
τηλεκπαίδευσης στο να επικοινωνούν μεταξύ τους. Η επικοινωνία αυτή αποτελείται
κυρίως από <i>δείκτες</i> (\"Πού ακριβώς βρίσκεται ο Γιάννης στο μάθημα ;\"),
<i>βαθμολογία</i> (\"Με τί βαθμό πέρασε ο Γιάννης την άσκηση ;\") και <i>χρόνο</i>
(\"Πόσο χρόνο ξόδεψε ο Γιάννης στο κεφάλαιο 1 ;\").</li>
</ul>

<p><b>Πώς δημιουργείτε μια γραμμή μάθησης συμβατή με το πρότυπο SCORM ;</b></p>

<p>Η πιο φυσική μέθοδος είναι να χρησιμοποιήσετε το εργαλείο δημιουργίας γραμμής
μάθησης του Eclass και στη συνέχεια να το εξάγετε κάνοντας κλικ στο κατάλληλο
εικονίδιο. Όμως, μπορεί να θέλετε να δημιουργήσετε εκπαιδευτικό περιεχόμενο
συμβατό με το πρότυπο Scorm τοπικά στον υπολογιστή σας και στη συνέχεια να το
εισάγετε στο εργαλείο γραμμή μάθησης του Eclass. Σε αυτήν την περίπτωση, σας
προτείνουμε να χρησιμοποιήσετε κάποιο εξεζητημένο εργαλείο όπως το
Lectora&reg; ή το Reload&reg;</p>

<p><b>Χρήσιμοι σύνδεσμοι</b></p>

<ul>
<li>Adlnet: ή υπεύθυνη αρχή για την κανονικοποίηση του προτύπου Scorm, <a
href=\"http://www.adlnet.org/\">http://www.adlnet.org</a></li>
<li>Reload: εργαλείο Ελεύθερου Λογισμικού/Λογισμικού Ανοικτού Κώδικα για σύνταξη και
ανάγνωση περιεχομένου Scorm, <a
href=\"http://www.reload.ac.uk/\">http://www.reload.ac.uk</a></li>
<li>Lectora: εργαλείο για σύνταξη και δημοσίευση περιεχομένου Scorm, <a
href=\"http://www.trivantis.com/\">http://www.trivantis.com</a></li>
</ul>

<p><b>Σημείωση:</b></p>

<p>Ο τομέας Λίστα γραμμών μάθησης εμφανίζει όλες τις γραμμές μάθησης
<i>που δημιουργήθηκαν μέσω του Eclass</i> και όλες τις εισηγμένες
γραμμές μάθησης <i>συμβατές με το πρότυπο Scorm</i>.</p>
";

//Help Dropbox

$langHDropbox="Χώρος Ανταλλαγής Αρχείων";

$langDropboxContent="<p>Ο Χώρος Ανταλλαγής Αρχείων είναι ένα εργαλείο ανταλλαγής αρχείων μεταξύ διδάσκων
και φοιτητών. Μπορείτε να ανταλλάξετε οποιοδήποτε τύπο αρχείων (π.χ. αρχεία Word, Excel, PDF κ.λπ.)</p>
<p>Υπάρχουν δύο κατάλογοι στο Χώρο Ανταλλαγής Αρχείων. Στον κατάλογο <b>Εισερχόμενα Αρχεία</b>
εμφανίζονται τα αρχεία που έχετε παραλάβει από άλλους χρήστες της πλατφόρμας, με κάποιες επιπλέον
πληροφορίες που αφορούν το αρχείο, όπως το όνομα του χρήστη, το μέγεθος του αρχείου και η ημερομηνία που
το παραλάβατε. Στον κατάλογο <b>Απεσταλμένα Αρχεία</b> εμφανίζονται τα αρχεία που έχετε στείλει
σε άλλους χρήστες της πλατφόρμας με τις αντίστοιχες πληροφορίες.</p>
<p>Αν ο κατάλογος με τα αρχεία που έχετε παραλάβει ή τα αρχεία που έχετε αποστείλει, γίνει αρκετά μεγάλος
μπορείτε να τον ελαττώσετε διαγράφοντας όλα ή μερικά από τα αρχεία του.
Σημειώστε, ότι το αρχείο δεν διαγράφεται από τη βάση δεδομένων της πλατφόρμας πάρα μόνο από τον κατάλογο.</p>
<p>Για να στείλετε ένα αρχείο σε κάποιον χρήστη, αρχικά επιλέξτε το αρχείο στον υπολογιστή σας
χρησιμοποιώντας το πλήκτρο Browse. Προαιρετικά μπορείτε να πληκτρολογήστε μια σύντομη περιγραφή.
Επιλέξτε από τον κατάλογο των χρηστών τον παραλήπτη του αρχείου και κάντε κλικ στο πλήκτρο 'Αποστολή'.
Αν θέλετε το αρχείο να σταλεί σε περισσότερους χρήστες, επιλέξτε τους επιθυμητούς παραλήπτες
κάνοντας κλικ με το ποντίκι σας στο όνομά του και κρατώντας πατημένο το πλήκτρο <b>CTRL (Control)</b>
</p>";

$langHUsage = "Στατιστικά Χρήσης";
$langUsageContent =
"
<p>Το υποσύστημα αυτό παρέχει τη δυνατότητα στον καθηγητή να δει στατιστικά που αφορούν το μάθημα του. Τα στατιστικά αυτά παρουσιάζονται υπό τη μορφή γραφικών παραστάσεων ή λίστας.</p>
<p><strong>Κατηγορίες στατιστικών</strong></p>
<ul>
<li>Στατιστικά χρήσης</li>
<li>Προτίμηση υποσυστημάτων</li>
<li>Επισκέψεις χρηστών στο μάθημα</li>
<li>Εμφάνιση παλιών στατιστικών</li>
</ul>
<p>Τα στατιστικά χρήσης μπορούν να ομαδοποιηθούν κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποια υποσυστήματα χρειάζονται στατιστικά και η χρονική διάρκεια τους.</p>
<p>Τα στατιστικά προτίμησης υποσυστημάτων  μπορούν να ομαδοποιηθούν κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποιους χρήστες χρειάζονται στατιστικά.</p>
<p>Τα στατιστικά επισκέψεων χρηστών στο μάθημα  μπορούν να ομαδοποιηθούν βάσει των χρηστών για ποιους χρήστες χρειάζονται στατιστικά.</p>
<p>Η εμφάνιση παλιών στατιστικών μπορεί να ομαδοποιηθεί κατά αριθμό επισκέψεων ή κατά τη χρονική διάρκεια των επισκέψεων. Επιπλέον μπορεί να επιλεγεί για ποια υποσυστήματα χρειάζονται στατιστικά και η χρονική διάρκεια τους.</p>
";

//Help Create Course Wizard
$langHCreateCourse = "Οδηγός δημιουργίας μαθημάτων";
$langCreateCourseContent = "<p>Ο οδηγός δημιουργίας μαθημάτων αποτελεί ένα πολύ σημαντικό εργαλείο της πλατφόρμας, αφού μέσω αυτού ο χρήστης-καθηγητής μπορεί να δημιουργεί νέα μαθήματα.</p><p>Ο οδηγός αποτελείται από 3 βήματα. Η συμπλήρωση απαιτούμενων πληροφοριών στα πεδία με αστερίσκο είναι απαραίτητη. Κάτω από κάθε πεδίο βρίσκεται μια ενδεικτική τιμή για να βοηθήσει τον χρήστη στη συμπλήρωσή τους.</p><p>Σε περίπτωση συμπλήρωσης ενός πεδίου με λανθασμένη τιμή, το σύστημα ενημερώνει τον χρήστη για το λάθος του και τον προτρέπει να το διορθώσει προκειμένου να μπορεί να μεταφερθεί στο επόμενο βήμα.</p>";

// Wiki Help

$langHWiki = "Βοήθεια - Wiki";
$langWikiContent = "<h3>Βοήθεια διαχείρισης Wiki</h3>
<dl class=\"Βοήθεια wiki\">
<dt>Πώς να δημιουργήσετε ένα νέο Wiki ?</dt>
<dd>Κάντε κλίκ στο σύνδεσμο 'Δημιουργήστε ένα νέο Wiki'. Μετά εισαγάγετε τις ιδιότητες του Wiki:
<ul>
<li><b>Τίτλος του Wiki</b> : επιλέξτε έναν τίτλο για το Wiki</li>
<li><b>Περιγραφή του Wiki</b> : επιλέξτε μια περιγραφή για το Wiki</li>
<li><b>Διαχείριση ελέγχου πρόσβασης</b> : θέστε τον έλεγχο πρόσβασης για τον Wiki επιλέγοντας/αποεπιλέγοντας το κουτί (δείτε πιο κάτω)</li>
</ul>
</dd>
<dt> Πώς να εισαγάγετε το Wiki ?</dt>
<dd> Κάντε κλικ στον τίτλο του Wiki στον κατάλογο.</dd>
<dt> Πώς να αλλάξετε τις ιδιότητες του Wiki ?</dt>
<dd>Κάντε κλικ στο εικονίδιο 'Properties' στην λίστα του Wiki και πήγαινε στη φόρμα ιδιοτήτων του Wiki.</dd>
<dt> Πώς να χρησιμοποιήσει τις διοικητικές επιλογές ελέγχου πρόσβασης;</dt>
<dd> Μπορείτε να θέσετε τα δικαιώματα πρόσβασης για τους χρήστες με τον επιλογή/αποεπιλογή του κουτιού στο \"διοικητικό\" τμήμα ελέγχου πρόσβασης των ιδιοτήτων Wiki.
 Μπορείτε να χορηγήσετε/μη χορηγήσετε πρόσβαση σε τρεις τύπους χρηστών:<ul>
<li><b> Μέλη μαθημάτων </b> : οι χρήστες εγγράφονται στη σειρά μαθημάτων (εκτός από τους διευθυντές μαθημάτων)</li>
<li><b> Μέλη ομάδας </b> (μόνο διαθέσιμο μεσα σε  μια ομάδα) : χρήστες που είναι μέλη της ομάδας (αναμείνετε τους δασκάλους ομάδας s)</li>
<li><b>Αλλοι χρήστες </b> : ανώνυμοι χρήστες ή χρήστες που δεν είναι μέλη σειράς μαθημάτων </li></ul>
Για κάθε τύπο χρηστών, μπορείτε να χορηγήσετε τον τύπο τρίων προνομίων για το Wiki(*) :<ul>
<li><b> Διαβάστε τις σελίδες </b> : ο χρήστης του δεδομένου τύπου μπορεί να διαβάσει τις σελίδες του Wiki</li>
<li><b>Αλλαγή σελίδων</b> : ο χρήστης του δεδομένου τύπου μπορεί να τροποποιήσει το περιεχόμενο των σελίδων του Wiki</li>
<li><b> Δημιουργήστε τις σελίδες </b> : ο χρήστης του δεδομένου τύπου μπορεί να δημιουργήσει νέες σελίδες του Wiki</li>
</ul><small><em>(*) Σημειώστε ότι εάν ένας χρήστης δεν μπορεί να διαβάσει τις σελίδες του  Wiki, δεν μπορεί να τις αλλάξει ή να τις τροποποιήσει. Σημειώστε ότι εάν ένας χρήστης δεν μπορεί να αλλαξει τις σελίδες του Wiki, δεν μπορεί να δημιουργήσει νέες σελίδες.</em></small></dd>
<dt> Πώς να διαγράψει το Wiki ?</dt>
<dd>Κάντε κλικ στο εικονίδιο 'Delete' στη στήλη για να σβήσετε το Wiki και όλες του τις σελίδες.</dd>
<dt> Πώς να πάρετε τον κατάλογο των σελίδων σε ένα Wiki ;</dt>
<dd>Κάντε κλικ στον αριθμό των σελίδως σε αυτό το Wiki στην λίστα των Wiki.</dd>
<dt> Πώς να πάρετε τον κατάλογο των  τελευταίων τροποποιημένων σελίδων σε ένα Wiki;</dt>
<dd>Κάντε κλικ στο εικονίδιο 'Recent changes' στη στήλη του καταλόγου του Wiki.</dd>
</dl>";

$langHWikiSyntax = "Βοήθεια - Σύνταξη Wiki";
$langWikiSyntaxContent = "<h1>Σύνταξη Wiki </h1>
<h2>1. Βασική σύνταξη </h2>
<dl class=\"Βοήθεια wiki\">
<dt> Δημιουργία των σελίδων και των συνδέσεων wiki μεταξύ τους </dt>
<dd><strong>Λέξεις Wiki </strong> : Οι λέξεις Wiki είναι λέξεις που γράφονται όπως <em>ΛέξηWiki</em>. Τα Wiki2xhtml τους αναγνωρίζουν ατόματα ως συνδέσεις σελίδων Wiki. Για να δημιουργήσετε μια σελίδα wiki ή για να δημιουργήσετε μια σύνδεση με μια σελίδα wiki, τροποποιήστε μια ήδη υπάρχουσα και προσθέστε το τίτλο στην σύνταξη του wiki, για παράδειγμα <em>ΝεαΣελιδα</em> (χωρίς τόνους ή με αγγλικούς χαρακτήρες), και μετά φύλαξε τη σελίδα. Wiki2xhtml θα αντικαταστήσει αυτόματα τη λέξη <em>ΝεαΣελιδα</em> με μια σύνδεση με τη σελίδα Wiki <em>ΝεαΣελιδα</em>&nbsp;</dd>
<dd><strong> συνδέσεις  Wiki </strong> : Οι συνδέσεις Wiki είναι όπως τους συνδέσμους υπερ-κειμένου (βλ. κατωτέρω) αναμένουν ότι δεν περιέχουν οποιοδήποτε σχέδιο πρωτοκόλλου (όπως <em>http://</em> ή <em>ftp://</em>) και ότι αυτόματα αναγνωρίζουν συνδέσμους σε σελίδες  Wiki. Για να δημιουργήσετε μια νέα σελίδα ή να δημιουργήσετε μια σύνδεση με μια υπάρχουσα που χρησιμοποιεί τις συνδέσεις Wiki, αλλαξτε μια σελίδα και προσθέστε <code>[page title]</code> η <code>[name of link|title of page]</code> στα περιεχόμενα του. Μπορείτε επίσης να χρησιμοποιήσετε αυτήν την σύνταξη για να αλλάξετε το κείμενο μιας σύνδεσης WikiWord: <code>[όνομα συνδέσμου|WikiWord]</code>.</dd>
<dt> Σύνδεσμοι υπερ-κειμένου </dt>
<dd><code>[url]</code>, <code>[name|url]</code>, <code>[name|url|language]</code> or <code>[name|url|language|title]</code>.&nbsp;</dd>
<dt> Συνυπολογισμός εικόνας </dt>
<dd><code>((url|alternate text))</code>, <code>((url| εναλλάσσομενο κείμενο |position))</code> ou <code>((url|alternate text|position|long description))</code>. <br /> Το επιχείρημα θέσης μπορεί να πάρει τις ακόλουθες τιμές : L (αριστερά), R (δεξιά) or C (κεντρικά).&nbsp;</dd>
<dd> Μπορείτε να χρησιμοποιήσετε τη σύνταξη ως συνδέσμους υπερ-κειμένου. Παραδείγματος χάριν <code>[τίτλος|image.gif]</code>. Αυτή η σύνταξη είναι αποδοκιμασμένη, σκεφτήτε να χρησιμποιήσετε την προηγούμενη&nbsp;</dd>
<dt> Σύνδεση με μια εικόνα </dt>
<dd> όπως τους συνδέσμους υπερ-κειμένου αλλά τεθειμένο 0 στο τέταρτο επιχείρημα για να αποφευχθεί η αναγνώριση εικόνας και να φταθεί ένας σύνδεσμος υπερ-κειμένου σε μια εικόνα. Παραδείγματος χάριν <code>[image|image.gif||0]</code> θα επιδείξει μια σύνδεση με την image.gif iαντι για επίδειξη της ίδιας της φωτογραφίας</dd>
<dt> Σχεδιάγραμμα </dt>
<dd><strong> Κυρτός </strong> : περιβάλτε το κείμενό σας με δύο ενιαία αποσπάσματα <code>'' κείμενο ''</code>&nbsp;</dd>
<dd><strong>Εντονα</strong> : περιβάλτε το κείμενό σας με τρία ενιαία αποσπάσματα υπογραμμίζει <code>''' κείμενο '''</code>&nbsp;</dd>
<dd><strong>Υπογράμμιση</strong> : περιβάλτε το κείμενό σας με δύο υπογραμμίζει <code>__ κείμενο __</code>&nbsp;</dd>
<dd><strong> Γραμμή</strong> : περιβάλτε το κείμενό σας με δύο αρνητικά σύμβολα <code>-- κείμενο --</code>&nbsp;</dd>
<dd><strong> Τίτλος </strong> : <code>!!!</code>, <code>!!</code>, <code>!</code> αντίστοιχα για τους τίτλους, τους υποτίτλους και τους υπο-υπο-τίτλους &nbsp;</dd>
<dt> Κατάλογος </dt>
<dd> γραμμή αρχίζοντας από <code>*</code> (άδιάτακτος κατάλογος) ή <code>#</code> (διαταγμένος κατάλογος). Μπορείτε να αναμίξετε τους καταλόγους (<code>*#*</code>) για να δημιουργήθούν πολυ - κατάλογοι επιπέδων.&nbsp;</dd>
<dt> Παράγραφος </dt>
<dd> Χωριστές παράγραφοι με μια ή περισσότερες νέες γραμμές &nbsp;</dd>
</dl>
<h2>2. Προχωρημένη σύνταξη </h2>
<dl class=\"Βοήθεια wiki\">
<dt> Υποσημείωση </dt>
<dd><code>\$\$ κείμενο υποσημειώσεων \$\$</code>&nbsp;</dd>
<dt>προκαθοριμένο κείμενο </dt>
<dd> αρχίστε κάθε γραμμή του κείμενο με ένα κενό διάστημα &nbsp;</dd>
<dt> Αναφέρετε φραγμού </dt>
<dd><code>&gt;</code> ή <code>;:</code> πριν από κάθε γραμμή &nbsp;</dd>
<dt> Οριζόντια γραμμή </dt>
<dd><code>----</code>&nbsp;</dd>
<dt> Αναγκασμένο σπάσιμο γραμμών </dt>
<dd><code>%%%</code>&nbsp;</dd>
<dt>ακρώνυμο</dt>
<dd><code>??ακρώνυμο??</code> or <code>??ακρώνυμο|ορισμός??</code>&nbsp;</dd>
<dt>Ευθυγραμμισμένη αναφορά </dt>
<dd><code>{{αναφορα}}</code>, <code>{{αναφορά|γλώσσα}}</code> or <code>{{αναφορά|γλώσσα|url}}</code>&nbsp;</dd>
<dt>Κώδικας</dt>
<dd><code>@@Ο κωδικας σου εδώ@@</code>&nbsp;</dd>
<dt>Ονομα στηρίγματος</dt>
<dd><code>~στήριγμα~</code>&nbsp;</dd>
</dl>";


?>

