<?php

/*
      +----------------------------------------------------------------------+
      | GUnet eClass 2.0                                                     |
      | Asychronous Teleteaching Platform                                    |
      +----------------------------------------------------------------------+
      | Copyright (c) 2003-2007  GUnet                                       |
      +----------------------------------------------------------------------+
      |                                                                      |
      | GUnet eClass 2.0 is an open platform distributed in the hope that    |
      | it will be useful (without any warranty), under the terms of the     |
      | GNU License (General Public License) as published by the Free        |
      | Software Foundation. The full license can be read in "license.txt".  |
      |                                                                      |
      | Main Developers Group: Costas Tsibanis <k.tsibanis@noc.uoa.gr>       |
      |                        Yannis Exidaridis <jexi@noc.uoa.gr>           |
      |                        Alexandros Diamantidis <adia@noc.uoa.gr>      |
      |                        Tilemachos Raptis <traptis@noc.uoa.gr>        |
      |                                                                      |
      | For a full list of contributors, see "credits.txt".                  |
      |                                                                      |
      +----------------------------------------------------------------------+
      | Contact address: Asynchronous Teleteaching Group (eclass@gunet.gr),  |
      |                  Network Operations Center, University of Athens,    |
      |                  Panepistimiopolis Ilissia, 15784, Athens, Greece    |
      +----------------------------------------------------------------------+
*/

$lang_remind_pass = 'Επανατοποθέτηση συνθηματικού';

$lang_pass_intro = '<p>Αν έχετε ξεχάσει τα στοιχεία του λογαριασμού σας, συμπληρώστε το <em>όνομα χρήστη</em>
και την διεύθυνση ηλεκτρονικού ταχυδρομείου με την οποία είστε εγγεγραμμένος 
(<em>προσοχή: αυτή που έχετε δηλώσει στην πλατφόρμα</em>).</p> <p>Στη συνέχεια θα παραλάβετε ένα μήνυμα σε αυτή τη
διεύθυνση με οδηγίες για να αλλάξετε το συνθηματικό σας.</p>';

$lang_pass_submit = 'Αποστολή';



$lang_pass_invalid_mail1 = 'H διεύθυνση ηλεκτρονικού ταχυδρομείου που δώσατε,';
$lang_pass_invalid_mail2 = 'δεν είναι έγκυρη. Αν κάνατε λάθος, δοκιμάστε ξανά.
	Αλλιώς, και αν είστε σίγουροι ότι έχετε ήδη λογαριασμό στο σύστημα,
	παρακαλούμε να επικοινωνήστε με τους διαχειριστές του συστήματος στη διεύθυνση';
$lang_pass_invalid_mail3 = 'δίνοντας και στοιχεία που μπορούν να βοηθήσουν στο να βρούμε
		το λογαριασμό σας, όπως ονοματεπώνυμο, σχολή/τμήμα, κ.λπ.';

$langPassResetIntro ="
Έχει ζητηθεί να γίνει επανατοποθέτηση του συνθηματικού πρόσβασης σας στην πλατφόρμα τηλεκπαίδευσης $siteName.
Αν δεν ζητήσατε εσείς αυτή την ενέργεια, απλώς αγνοήστε τις οδηγίες αυτού του μηνύματος και αναφέρετέ το γεγονός αυτό στο διαχειριστή του συστήματος, στην διεύθυνση: ";


$langHowToResetTitle = "

===============================================================================
			Οδηγίες επανατοποθέτησης συνθηματικού
===============================================================================
";

$langPassResetGoHere = "
Για να επανατοποθετήσετε το συνθηματικό σας πηγαίνεται στην πιο κάτω διεύθυνση. Αν δεν μπορείτε να μεταβείτε κάνοντας κλικ πάνω στη διεύθυνση αυτή, αντιγράψτε την στη μπάρα διευθύνσεων του φυλλομετρητή σας.
Η διεύθυνση αυτή έχει ισχύ μίας (1) ώρας. Πέραν αυτού του χρονικού ορίου θα πρέπει να κάνετε από την αρχή τη διαδικασία επανατοποθέτησης συνθηματικού.


";

$langPassEmail1 = "Το συνθηματικό σας έχει επανατοποθετηθεί επιτυχώς. Το νέο σας συνθηματικό είναι αυτό που ακολουθεί

";
			
$langPassEmail2 = "


Για λόγους ασφάλειας, παρακαλούμε αλλάξετε αυτό το συνθηματικό άμεσα, σε κάτι που μόνο εσείς το γνωρίζετε μόλις συνδεθείτε στην πλατφόρμα.
";


$langAccountResetSuccess1="Η επανατοποθέτηση του συνθηματικού σας έχει ολοκληρωθεί";
$langAccountResetSuccess2="Στη διεύθυνση ηλεκτρονικού ταχυδρομείου σας";
$langAccountResetSuccess3="έχει σταλεί ένα μήνυμα με το νέο σας συνθηματικό πρόσβασης.";

$langAccountEmailError1 = 'Παρουσιάστηκε σφάλμα κατά την αποστολή των στοιχείων σας';
$langAccountEmailError2 = "Δεν κατέστη δυνατή η αποστολή των οδηγιών επανατοποθέτησης του συνθηματικού σας στη διεύθυνση";
$langAccountEmailError3 = 'Αν χρειαστεί, μπορείτε να επικοινωνήσετε με τους διαχειριστές του συστήματος στη διεύθυνση';
$lang_pass_email_ok = 'Τα στοιχεία του λογαριασμού σας βρέθηκαν και στάλθηκαν
	μέσω ηλεκτρονικού ταχυδρομείου στη διεύθυνση';

$langAccountNotFound1 = 'Δε βρέθηκε λογαριασμός στο σύστημα με τη διεύθυνση ηλεκτρονικού ταχυδρομείου που δώσατε'; 
$langAccountNotFound2 = ' Αν παρόλα αυτά είστε σίγουρος ότι έχετε ήδη λογαριασμό, παρακαλούμε επικοινωνήστε με τους διαχειριστές του συστήματος στη διεύθυνση ';

$langAccountNotFound3 = 'δίνοντας και στοιχεία που μπορούν να βοηθήσουν στο να βρούμε το λογαριασμό σας, όπως ονοματεπώνυμο, σχολή/τμήμα, κλπ.';

$langHome = "Επιστροφή στην αρχική σελίδα";

$lang_email = 'e-mail';
$lang_send = 'Αποστολή';
$lang_username="Όνομα χρήστη";

?>
