<?
$lang_remind_pass = 'Υπενθύμιση συνθηματικού';
$lang_pass_intro = 'Αν έχετε ξεχάσει τα στοιχεία του λογαριασμού σας, 
	πληκτρολογήστε παρακάτω την ηλεκτρονική σας διεύθυνση 
	(<em>προσοχή: αυτή που έχετε δηλώσει στην πλατφόρμα</em>) 
	για να σας αποσταλούν με ασφάλεια.';
$lang_pass_submit = 'Αποστολή';
$lang_pass_invalid_mail1 = 'H διεύθυνση ηλεκτρονικού ταχυδρομείου που δώσατε,';
$lang_pass_invalid_mail2 = 'δεν είναι έγκυρη. Αν κάνατε λάθος, δοκιμάστε ξανά. 
	Αλλιώς, και αν είστε σίγουροι ότι έχετε ήδη λογαριασμό στο σύστημα, 
	παρακαλούμε να επικοινωνήστε με τους διαχειριστές του συστήματος στη διεύθυνση';
$lang_pass_invalid_mail3 = 'δίνοντας και στοιχεία που μπορούν να βοηθήσουν στο να βρούμε 
		το λογαριασμό σας, όπως ονοματεπώνυμο, σχολή/τμήμα, κ.λπ.';

$lang_pass_email_intro =
'Ζητήθηκε να αποσταλούν μέσω ηλεκτρονικού ταχυδρομείου τα στοιχεία
του λογαριασμού σας στην πλατφόρμα τηλεκπαίδευσης. Αν δεν ζητήσατε
εσείς αυτή την ενέργεια, απλώς αγνοήστε το μήνυμα αυτό ή αναφέρετέ
το στο διαχειριστή του συστήματος, στη διεύθυνση: ';
$lang_pass_email_account = 'Τα στοιχεία σας είναι τα ακόλουθα:';
$lang_pass_email_many_accounts =
'Στην πλατφόρμα βρέθηκαν περισσότεροι από ένας λογαριασμοί που
έχουν δηλώσει ως διεύθυνση ηλεκτρονικού ταχυδρομείου τη δική
σας. Ακολουθούν τα στοιχεία όλων αυτών των λογαριασμών:';
$lang_pass_email_ldap =
'Ο λογαριασμός αυτός πιστοποιείται μέσω LDAP, και το συνθηματικό
του είναι αυτό του καταλόγου LDAP του ιδρύματος στο οποίο ανήκετε.';
$lang_pass_email_name = 'Ονοματεπώνυμο: ';
$lang_pass_email_status = 'Ιδιότητα: ';
$lang_pass_email_username = 'Όνομα πρόσβασης: ';
$lang_pass_email_password = 'Συνθηματικό: ';

$lang_pass_email_error1 = 'Παρουσιάστηκε σφάλμα κατά την αποστολή των στοιχείων σας προς τη διεύθυνση';
$lang_pass_email_error2 = 'Αν χρειαστεί, μπορείτε να επικοινωνήστε με τους διαχειριστές του συστήματος στη διεύθυνση';
$lang_pass_email_ok = 'Τα στοιχεία του λογαριασμού σας βρέθηκαν και στάλθηκαν
	μέσω ηλεκτρονικού ταχυδρομείου στη διεύθυνση';

$lang_pass_not_found1 = 'Δε βρέθηκε κανένας λογαριασμός στο σύστημα με τη διεύθυνση ηλεκτρονικού ταχυδρομείου που δώσατε,'; 
$lang_pass_not_found2 = ' Αν παρόλα αυτά είστε σίγουρος ότι έχετε ήδη λογαριασμό, παρακαλούμε επικοινωνήστε με 
τους διαχειριστές του συστήματος στη διεύθυνση ';
$lang_pass_not_found3 = ', δίνοντας και στοιχεία που μπορούν να βοηθήσουν στο να βρούμε το λογαριασμό σας, όπως 
ονοματεπώνυμο, σχολή/τμήμα, κλπ.';

$lang_student = 'Φοιτητής';
$lang_prof = 'Καθηγητής';
$lang_other = 'Άλλο';
$lang_email = 'e-mail';
$lang_send = 'Αποστολή';

?>
