<?
$langManuals = "Χρήσιμα Εγχειρίδια";
$langIntroMan = "Στην ενότητα αυτή υπάρχουν διαθέσιμα χρήσιμα εγχειρίδια που αφορούν την περιγραφή, τη λειτουργία και τις δυνατότητες της πλατφόρμας eClass";
$langFinalDesc = "Αναλυτική Περιγραφή eClass";
$langShortDesc = "Σύντομη Περιγραφή eClass";
$langManS = "Εγχειρίδιο Χρήστη Φοιτητή";
$langManT = "Εγχειρίδιο Καθηγητή";
$langOr = "ή";
$langNote = "Σημείωση";
$langAcrobat = "Για να διαβάσετε τα αρχεία PDF μπορείτε να χρησιμοποιήσετε το πρόγραμμα Acrobat Reader";
$langWhere ="που θα βρείτε";
$langHere = "εδώ";
?>
