<?
$opencours="Κατάλογος Μαθημάτων";
$listfac="Κατάλογος Τμημάτων";
$listtomeis = "Τομείς";
$langDepartmentsList = "Ακολουθεί ο κατάλογος τμημάτων του ιδρύματος.
	Επιλέξτε οποιοδήποτε από αυτά για να δείτε τα διαθέσιμα σε αυτό μαθήματα."; 
$avlesson="διαθέσιμο μάθημα";
$avlessons="διαθέσιμα μαθήματα";
$langWrongPassCourse = "Λάθος συνθηματικό για το μάθημα";

$m['department'] = 'Σχολή/Τμήμα';
$m['tomeis'] = 'Τομείς';
$m['tomeas'] = 'Τομέας';
$m['open'] = 'Ανοικτά μαθήματα (Ελεύθερη Πρόσβαση)';
$m['restricted'] = 'Ανοικτά μαθήματα με εγγραφή (Απαιτείται λογαριασμός χρήστη)';
$m['closed'] = 'Κλειστά μαθήματα';
$m['code'] = 'Κωδικός';
$m['title'] = 'Τίτλος';
$m['description'] = 'Περιγραφή';
$m['professor'] = 'Υπεύθυνος καθηγητής';
$m['type']  = 'Κατηγορία μαθήματος';
$m['pre']  = 'Προπτυχιακό';
$m['post']  = 'Μεταπτυχιακό';
$m['other']  = '¶λλο';

$m['pres']  = 'Προπτυχιακά';
$m['posts']  = 'Μεταπτυχιακά';
$m['others']  = '¶λλα';
$m['legend'] = 'Υπόμνημα';
$m['legopen'] = 'Ανοικτό Μάθημα';
$m['legrestricted'] = 'Απαιτείται εγγραφή';
$m['legclosed'] = 'Κλειστό μάθημα';

$m['type']="Τύπος";
$m['name']="Μάθημα";
$m['code']="Κωδικός μαθήματος";
$m['prof']="Καθηγητής(ες)";

$m['mailprof'] = "(Για να εγγραφείτε στο μάθημα θα πρέπει να στείλετε mail στον διδάσκοντα του μαθήματος
κάνοντας κλικ";
$m['here'] = " εδώ.)";
?>
