<?
 $msgAdminPanel = "Πίνακας Διαχείρισης";
 $msgStats = "Στατιστικά";
 $msgStatsBy = "Στατιστικά σύμφωνα με";
 $msgHours = "ώρες";
 $msgDay = "μέρα";
 $msgWeek = "εβδομάδα";
 $msgMonth = "μήνα";
 $msgYear = "χρόνος";
 $msgFrom = "από ";
 $msgTo = "έως ";
 $msgPreviousDay = "προηγούμενη μέρα";
 $msgNextDay = "επόμενη μέρα";
 $msgPreviousWeek = "προηγούμενη εβδομάδα";
 $msgNextWeek = "επόμενη εβδομάδα";
 $msgCalendar = "ημερολόγιο";
 $msgShowRowLogs = "show row logs";
 $msgRowLogs = "row logs";
 $msgRecords = "εγγραφές";
 $msgDaySort = "Ταξινόμηση σύμφωνα με την ημέρα";
 $msgMonthSort = "Ταξινόμηση σύμφωνα με το μήνα";
 $msgCountrySort = "Ταξινόμηση σύμφωνα με τη χώρα";
 $msgOsSort = "Ταξινόμηση σύμφωνα με το λειτουργικό σύστημα";
 $msgBrowserSort = "Ταξινόμηση σύμφωνα με το Browser";
 $msgProviderSort = "Ταξινόμηση σύμφωνα με το παροχέα υπηρεσιών";
 $msgTotal = "Συνολικά";
 $msgBaseConnectImpossible = "Δεν είναι δυνατή η επιλογή βάσης δεδομένων";
 $msgSqlConnectImpossible = "Δεν είναι δυνατή η σύνδεση με τον εξυπηρέτη SQL";
 $msgSqlQuerryError = "Δεν είναι δυνατό το ερώτημα SQL";
 $msgBaseCreateError = "Παρουσιάστηκε σφάλμα κατά την διάρκεια της δημιουργίας ezboo";
 $msgMonthsArray = array("Ιανουαρίου",
			"Φεβρουαρίου",
			"Μαρτίου",
			"Απριλίου",
			"Μαΐου",
			"Ιουνίου",
			"Ιουλίου",
			"Αυγούστου",
			"Σεπτεμβρίου",
			"Οκτωβρίου",
			"Νοεμβρίου",
			"Δεκεμβρίου");
 $msgDaysArray = array("Κυριακή","Δευτέρα","Τρίτη","Τετάρτη","Πέμπτη","Παρασκευή","Σάββατο");
 $msgDaysShortArray=array("Κ","Δ","Τ","Τ","Π","Π","Σ");
 $msgToday = "Σήμερα";
 $msgOther = "Αλλο";
 $msgUnknown = "Αγνωστο";
 $msgServerInfo = "Πληροφορίες για τον εξυπηρέτη της php";
 $msgStatBy = "Στατιστικά με";
 $msgVersion = "Webstats 1.30";
 $msgCreateCook = "<b>Διαχειριστής:</b> Ένα cookie έχει δημιουργηθεί στον υπολογιστή σας,<BR>
     Δεν θα εμφανίζεστε πλέον στα logs σας.<br><br><br><br>";
 $msgCreateCookError = "<b>Διαχειριστής:</b>το cookie δεν ήταν δυνατόν να αποθηκευθεί στον υπολογιστή σας<br>
     Ελέγξτε τις ρυθμίσεις του browser και ανανεώστε ξανά τη σελίδα.<br><br><br><br>";
 $msgInstalComments = "<p>Η αυτόματη διαδικασία εγκατάστασης θα προσπαθήσει να:</p>
       <ul>
         <li>δημιουργήσει ένα πίνακα που ονομάζεται <b>liste_domaines</b> στην βάση δεδομένων<br>
           </b>Ο πίνακας αυτόματα θα συμπληρωθεί με ονόματα χωρών με βάση τους κωδικούς από το InterNIC</li>
         <li>δημιουργία ενός πίνακα που ονομάζεται <b>logezboo</b><br>
           Αυτός ο πίνακας θα αποθηκεύει τα logs</li>
       </ul>
       <font color=\"#FF3333\">Πρέπει να έχετε τροποποιήσει κατάλληλα το αρχείο<ul><li><b>config_sql.php3</b> με το  
<b>όνομα χρήστη</b>, <b>συνθηματικό</b> και τη<b>βάση δεδομένων </b> για τη σύνδεση με τον SQL εξυπηρέτη.</li><br><li>Το αρχείο
<b>config.inc.php3</b> 
πρέπει να έχει τροποποιηθεί για την επιλογή κατάλληλης γλώσσας.</font></li></ul><br>Μπορείτε να χρησιμοποιήσετε για αυτόν το σκοπό 
οποιοδήποτε επεξεργαστή κειμένου (π.χ. Notepad).";
 $msgInstallAbort = "Εγκατάλειψη του SETUP";
 $msgInstall1 = "Αν δεν υπάρχει μήνυμα λάθους παραπάνω, η εγκατάσταση είναι επιτυχημένη.";
 $msgInstall2 = "Εχουν δημιουργηθεί 2 πίνακες στη βάση δεδομένων";
 $msgInstall3 = "Μπορείτε τώρα να ανοίξετε το κύριο interface";
 $msgInstall4 = "Για να συμπληρώσετε το πίνακά σας όταν οι σελίδες φορτωθούν, πρέπει να τοποθετήσετε μία ετικέτα στις σελίδες που θέλετε να παρακολουθείτε.";

 $msgUpgradeComments ="Η νέα έκδοση του ezBOO WebStats χρησιμοποιεί τον ίδιο πίνακα <b>logezboo</b> όπως οι προηγούμενες εκδόσεις.<br>
  						Αν οι χώρες δεν είναι στα Αγγλικά, πρέπει να διαγράψετε τον πίνακα <b>liste_domaine</b> 
  						και να ξεκινήσετε την εγκατάσταση.<br>
  						Αυτό δεν θα έχει αποτέλεσμα στον πίνακα <b>logezboo</b> .<br>
  						Το μήνυμα λάθους ειναι φυσιολογικό. :-)";
$langStats="Στατιστικά";
?>
