<?php

$iso639_2_code = "el";
$iso639_1_code = "ell";

$langNameOfLang['english']="Αγγλικά";
$langNameOfLang['french']="Γαλλλικά";
$langNameOfLang['greek']="Ελληνικά";

$charset = 'iso-8859-7';
$text_dir = 'ltr'; // ('ltr' for left to right, 'rtl' for right to left)
$left_font_family = 'verdana, helvetica, arial, geneva, sans-serif';
$right_font_family = 'helvetica, arial, geneva, sans-serif';
$number_thousands_separator = ',';
$number_decimal_separator = '.';
$byteUnits = array('Bytes', 'KB', 'MB', 'GB');

$langDay_of_weekNames['init'] = array('Κ', 'Δ', 'Τ', 'Τ', 'Π', 'Π', 'Σ');
$langDay_of_weekNames['short'] = array('Κυρ', 'Δευ', 'Τρι', 'Τετ', 'Πεμ', 'Παρ', 'Σαβ');
$langDay_of_weekNames['long'] = array('Κυριακή', 'Δευτέρα', 'Τρίτη', 'Τετάρτη', 'Πέμπτη', 'Παρασκευή', 'Σάββατο');

$langMonthNames['init']  = array('Ι', 'Φ', 'Μ', 'Α', 'Μ', 'Ι', 'Ι', 'Α', 'Σ', 'Ο', 'Ν', 'Δ');
$langMonthNames['short'] = array('Ιαν', 'Φεβ', 'Μαρ', 'Απρ', 'Μάι', 'Ιουν', 'Ιουλ', 'Αυγ', 'Σεπ', 'Οκτ', 'Νοε', 'Δεκ');
$langMonthNames['long'] = array('Ιανουάριος', 'Φεβρουάριος', 'Μάρτιος', 'Απρίλιος', 'Μάιος', 'Ιούνιος', 'Ιούλιος', 'Αύγουστος', 'Σεπτέμβριος', 'Οκτώβριος', 'Νοέμβριος', 'Δεκέμβριος');
$langMonthNames['fine'] = array('Ιανουαρίου', 
				'Φεβρουαρίου', 
				'Μαρτίου', 
				'Απριλίου', 
				'Μαΐου', 
				'Ιουνίου', 
				'Ιουλίου', 
				'Αυγούστου', 
				'Σεπτεμβρίου', 
				'Οκτωβρίου', 
				'Νοεμβρίου', 
				'Δεκεμβρίου');


$dateFormatShort =  "%b %d, %y";
$dateFormatLong  = '%A, %d %B %Y';
$dateTimeFormatLong  = '%d %B %Y / Ώρα: %R';
//$timeNoSecFormat = '%I:%M %p';
$timeNoSecFormat = '%R';

$langBack = "Επιστροφή";
$langModify="Αλλαγή";
$langDelete="Διαγραφή";
$langTitle="Τίτλος";
$langHelp="Βοήθεια";
$langOk="Επικύρωση";
$langAddIntro="Προσθήκη εισαγωγικού κειμένου";
$langBackList="Επιστροφή στη λίστα";
$langUser = "Χρήστης:";
$langProfessor = "Καθηγητής";
$langLogout = "Έξοδος";
$langNoAdminAccess = '
		<p><b>Η σελίδα
		που προσπαθείτε να μπείτε απαιτεί όνομα 
		χρήστη και συνθηματικό.</b> <br/>Το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε πρωτού προχωρήσετε σε άλλες ενέργειες. Αυτό μπορεί να συνέβηκε 
		λόγω εσφαλμένου URL ή λόγω λήξης της συνόδου σας (time-out).</p>
';

$langLoginRequired = '
		<p><b>Δεν είστε εγγεγραμμένος στο μάθημα που προσπαθείτε να μπείτε. </b>
		Το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να εγγραφείτε στο μάθημα, αν η εγγραφή είναι ελεύθερη. </p>
';

$langSessionIsLost = "
		<p><b>Η σύνοδος σας έχει λήξει. </b><br/>Το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε πρωτού προχωρήσετε σε άλλες ενέργειες.</p>
			";

$langCheckProf = "
		<p><b>Η ενέργεια που προσπαθήσατε να εκτελέσετε απαιτεί δικαιώματα καθηγητή. </b><br/>
		Το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε, εάν είστε ο καθηγητής του εν λόγω μαθήματος.</p>
";

$langLessonDoesNotExist = "
	<p><b>Το μάθημα που προσπαθήσατε να προσπελάσετε δεν υπάρχει.</b><br/>
	Αυτό μπορεί να συμβαίνει λόγω του ότι εκτελέσατε μια μη επιτρεπτή ενέργεια ή λόγω προβλήματος
	στην πλατφόρμα.</p>
";

$langCheckAdmin = "
		<p><b>Η ενέργεια που προσπαθήσατε να εκτελέσετε απαιτεί δικαιώματα διαχειριστή. </b><br/>
		Το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε, εάν είστε ο διαχειριστής της πλατφόρμας.</p>
";

$langCheckGuest = "
		<p><b>Η ενέργεια που προσπαθήσατε να εκτελέσετε δεν είναι δυνατή με δικαιώματα επισκέπτη χρήστη. </b><br/>
		Για λόγους ασφάλειας το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε ξανά.</p>
";

$langCheckPublicTools = "
		<p><b>Προσπαθήσατε να αποκτήσετε πρόσβαση σε απενεργοποιημένο εργαλείο μαθήματος. </b><br/>
		Για λόγους ασφάλειας το σύστημα σας ανακατεύθυνε αυτόματα στην αρχική σελίδα
		για να συνδεθείτε ξανά.</p>
";

$langUserBriefcase = "Χαρτοφυλάκιο χρήστη";
$langPersonalisedBriefcase = "Προσωπικό χαρτοφυλάκιο";
$langEclass = "Πλατφόρμα ασύγχρονης τηλεκπαίδευσης eClass";
$langCopyrightFooter="Πληροφορίες πνευματικών δικαιωμάτων";

$langGreek="Ελληνικά";
$langEnglish="Αγγλικά";
?>
